[
  {
    "id": "90641004",
    "name-th": "โครงงานกลุ่ม 1",
    "name-en": "TEAM-PROJECT 1",
    "credits": "1 (0-2-1)",
    "prerequisite": null,
    "description-th": "นักศึกษากลุ่มย่อยสามารถกำหนดและวางแผนโครงงานที่จะใช้เป็นแนวทางแก้ไขปัญหาที่เกิดขึ้นในโลก แห่งความเป็นจริง นักศึกษาทำการศึกษาความเป็นไปได้สำหรับการเลือกและการนำเสนอโครงงาน",
    "description-en": "Small teams of students can formulate and plan a project that will provide a solution to an identified real-world problem. Students undertake a feasibility study to justify project selection and presentation."
  },
  {
    "id": "90641005",
    "name-th": "โครงงานกลุ่ม 2",
    "name-en": "TEAM-PROJECT 2",
    "credits": "1 (0-2-1)",
    "prerequisite": "90641004 OR EQUIVALENT SUBJECT",
    "description-th": "นักศึกษากลุ่มย่อยสามารถออกแบบ ใช้งาน ทดสอบ ประเมิน และนำเสนอโครงงานที่ได้รับมอบหมาย โดยมีขนาดและความซับซ้อนที่เหมาะสมกับนักศึกษาในระดับเริ่มต้นได้",
    "description-en": "Small teams of students undertake the design, implementation, testing, evaluation, and presentation of a specific project of size and complexity suitable for novice students."
  },
  {
    "id": "90641006",
    "name-th": "โครงงานกลุ่ม 3",
    "name-en": "TEAM-PROJECT 3",
    "credits": "1 (0-2-1)",
    "prerequisite": "90641005 OR EQUIVALENT SUBJECT",
    "description-th": "นักศึกษากลุ่มย่อยสามารถออกแบบ ดำเนินการ ทดสอบ ประเมิน และนำเสนอโครงงาน ผลิตภัณฑ์ หรือ การบริการที่มีความสมบูรณ์ครบถ้วนได้",
    "description-en": "Small teams of students undertake the design, implementation, testing, evaluation, and presentation of a complete project/product/service."
  },
  {
    "id": "90641007",
    "name-th": "พลเมืองดิจิทัล",
    "name-en": "DIGITAL CITIZEN",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "พัฒนาความรู้และทักษะการเป็นพลเมืองดิจิทัล ใช้ชีวิตร่วมกับผู้อื่นในโลกออนไลน์อย่างมีความ รับผิดชอบและปลอดภัย ใช้เทคโนโลยีอย่างสร้างสรรค์และมีจริยธรรม สร้างสรรค์และเผยแพร่สื่อออนไลน์อย่างมี สติสัมปชัญญะ รู้เท่าทันการลงทุนสมัยใหม่ และใช้ชีวิตในยุคดิจิทัลได้อย่างชาญฉลาด",
    "description-en": "Development of digital citizen skills, live safely and responsibly online, use technology creatively and morally, innovate and deliver digital media sensibly, understand modern investment, and live wisely in digital world."
  },
  {
    "id": "90641008",
    "name-th": "พื้นฐานทักษะการสื่อสารภาษาอังกฤษ",
    "name-en": "INTRODUCTION TO ENGLISH COMMUNICATION SKILLS",
    "credits": "0 (0-0-45)",
    "prerequisite": null,
    "description-th": "การพัฒนาทักษะการสื่อสารภาษาอังกฤษโดยใช้กิจกรรมการอ่าน การเขียน การพูด และ การฟัง ที่ มุ่งเน้นการฝึกฝนไวยากรณ์เพื่อการสื่อสารที่จำเป็นทั้งหมด การพัฒนาคำศัพท์ การสร้างประโยค และ การแสดงความ คิดเห็นแบบสั้นๆ ผ่านโครงสร้างทางภาษาแบบต่างๆ เพื่อการสื่อสารอย่างมีประสิทธิภาพในหลากหลายบริบท เช่น การ สนทนาในชีวิตประจำวัน การรีวิวสินค้าและบริการ, การเขียนข้อความออนไลน์ และ การนำเสนอด้วยวิดิโอสั้นๆ",
    "description-en": "A development of English language communication skills through reading, writing, speaking, and listening activities with emphasis on a summary and practices of all essential communicative grammatical structures, vocabulary development, types of sentences, and expressions of ideas by using different language structures for successful communication in different contexts such as daily conversations, product reviews, online message writing, and video clip presentation."
  },
  {
    "id": "90641009",
    "name-th": "ทักษะการสื่อสารภาษาอังกฤษระหว่างวัฒนธรรม 1",
    "name-en": "INTERCULTURAL COMMUNICATION SKILLS IN ENGLISH 1",
    "credits": "3 (3-0-6)",
    "prerequisite": "90641008",
    "description-th": "การพัฒนาความสามารถในการสื่อสารระหว่างวัฒนธรรมผ่านการฝึกฝนทักษะการสื่อสารภาษาอังกฤษ ที่ มุ่งเน้นฝึกฝนทักษะการฟัง การอ่านจับใจความอย่างง่าย การสรุปความ การแสดงความคิดเห็น ทักษะการนำเสนอข้อมูลใน ที่ประชุม และ การเขียนบทความสั้นๆ",
    "description-en": "A development of intercultural communication competences through practices of English language communication with emphasis on listening practices, basic reading comprehension, idea summary, expressing opinions, in-group presentation, and basic paragraph writing skills."
  },
  {
    "id": "90641010",
    "name-th": "ทักษะการสื่อสารภาษาอังกฤษระหว่างวัฒนธรรม 2",
    "name-en": "INTERCULTURAL COMMUNICATION SKILLS IN ENGLISH 2",
    "credits": "3 (3-0-6)",
    "prerequisite": "90641009",
    "description-th": "การพัฒนาความสามารถในการสื่อสารระหว่างวัฒนธรรมผ่านการฝึกฝนทักษะการสื่อสารภาษาอังกฤษ ที่ มุ่งเน้นฝึกฝนทักษะการฟัง, การอ่านจับใจความเชิงวิเคราะห์ การอภิปรายแบบกลุ่ม, การกล่าวสุนทรพจน์ เทคนิคการเขียน รูปแบบต่างๆ เช่น การเขียน เชิงอธิบาย การเขียนเชิงบรรยาย การเขียนเชิงพรรณนา และ การเขียนเชิงโน้มน้าวใจ",
    "description-en": "A development of intercultural communication competences through practices of English language communication with emphasis on listening practices, analytic reading, group discussions, public speaking, and different writing techniques such as expository writing, descriptive writing, persuasive writing, and narrative writing."
  },
  {
    "id": "90642001",
    "name-th": "ปฏิบัติงานตามทักษะด้านบุคคลและสนับสนุนวิชาชีพ 1",
    "name-en": "PRACTICE UNDER PERSONAL AND PROFESSIONAL SKILLS 1",
    "credits": "1 (0-2-1)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดำเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านบุคคลและส่งเสริมวิชาชีพ โดยมีเวลาดำเนินการไม่น้อยกว่า 15 ชั่วโมง",
    "description-en": "This course provides practice for working or industrial training or training or other related activities which reflect development of the personal and professional support skills at least 15 hours."
  },
  {
    "id": "90642002",
    "name-th": "ปฏิบัติงานตามทักษะด้านบุคคลและสนับสนุนวิชาชีพ 2",
    "name-en": "PRACTICE UNDER PERSONAL AND PROFESSIONAL SKILLS 2",
    "credits": "2 (0-4-2)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดำเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านบุคคลและส่งเสริมวิชาชีพ โดยมีเวลาดำเนินการไม่น้อยกว่า 30 ชั่วโมง",
    "description-en": "This course provides practice for working or industrial training or training or other related activities which reflect development of the personal and professional support skills at least 30 hours."
  },
  {
    "id": "90642003",
    "name-th": "ปฏิบัติงานตามทักษะด้านบุคคลและสนับสนุนวิชาชีพ 3",
    "name-en": "PRACTICE UNDER PERSONAL AND PROFESSIONAL SKILLS 3",
    "credits": "3 (0-6-3)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดำเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านบุคคลและส่งเสริมวิชาชีพ โดยมีเวลาดำเนินการไม่น้อยกว่า 45 ชั่วโมง",
    "description-en": "This course provides practice for working or industrial training or training or other related activities which reflect development of the personal and professional support skills at least 45 hours."
  },
  {
    "id": "90642011",
    "name-th": "การคิดอย่างมีวิจารณญาณ",
    "name-en": "CRITICAL THINKING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาประเด็นในการสร้างกรอบความคิด การกระตุ้นความคิดเชิงวิพากษ์ ปัญหาและอุปสรรคที่ขัดขวาง ความคิด เทคนิคการเอาชนะหลุมพรางทางความคิดเชิงลบ แนวทางการปฏิบัติในการใช้ทักษะการคิดเชิงวิพากษ์ เทคนิค และเครื่องมือกระตุ้นการพัฒนาทักษะการคิดเชิงวิพากษ์ การประยุกต์ใช้การคิดเชิงวิพากษ์กับสถานการณ์ต่างๆ",
    "description-en": "This course explores issues about the nature and techniques of critical thought, viewed as a way to establish a reliable basis for our claims, beliefs, and attitudes about the world. We explore multiple perspectives, placing established facts, theories, and practices in tension with alternatives to see how things could be otherwise. Views about observation and interpretation, reasoning and inference, valuing and judging, and the production of knowledge in its social context are considered. Special attention is given to translating what is learned into strategies, materials, and interventions for use in students' own educational and professional settings."
  },
  {
    "id": "90642012",
    "name-th": "กระบวนการคิดเชิงออกแบบ",
    "name-en": "DESIGN THINKING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกทักษะการคิดเชิงออกแบบ โดยการวิเคราะห์ปัญหา เรียนรู้พฤติกรรมกลุ่มเป้าหมาย การระบุปัญหา การ สร้างแผนผังความคิด การสัมภาษณ์ การสนทนากลุ่ม ฝึกฝนทักษะการสร้างสรรค์ความคิด การสร้างต้นแบบ การนำเสนอ ต้นแบบ การทดสอบแนวคิดและต้นแบบ เรียนรู้วิธีการนำกระบวนการคิดเชิงออกแบบไปประยุกต์ใช้งานในชีวิตประจำวัน และการสร้างสรรค์นวัตกรรม",
    "description-en": "Learn design thinking process and develop problem-solving skills by studying target group behavior, defining problem, using mind map. Learn techniques for interviewing and group discussion. Practice ideation which leads to creative solutions. Build, present and test prototypes and concepts of design. Learn to apply design thinking process to daily life and create innovation."
  },
  {
    "id": "90642013",
    "name-th": "บูรณาการแห่งการคิด",
    "name-en": "INTEGRATED THINKING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการและประเภทของการคิด การคิดเชิงบวก การคิดนอกกรอบ การคิดเชิงวิพากษ์ การคิดวิเคราะห์ เรียนกระบวนการตั้งคำถาม การวิเคราะห์ การสังเคราะห์ การประเมินค่า และแสดงความคิดเห็นอย่างมีเหตุผล การ พัฒนาการคิด การสร้างผลงานอันเนื่องมาจากการคิด",
    "description-en": "Study principles and various types of thinking; positive thinking lateral thinking, critical thinking, analytical thinking. Learn to develop thinking process through questioning, analyzing, synthesizing and evaluating. Learn to express logical ideas and create workpiece based on own thought."
  },
  {
    "id": "90642014",
    "name-th": "การคิดเชิงระบบและเชิงนวัตกรรม",
    "name-en": "INNOVATIVE AND SYSTEM THINKING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ความคิดสร้างสรรค์ และนวัตกรรม เรียนรู้คุณลักษณะของการสร้างสรรค์สิ่งใหม่ ๆ วิธีการสร้างนวัตกรรมและ แรงจูงใจ ศึกษาตัวอย่างของนวัตกรรมทางวิทยาศาสตร์สุขภาพ ศึกษาแนวความคิดของกรอบการคิดเชิงระบบ หลักการคิด เชิงระบบ รูปแบบของการคิดเชิงระบบ ขั้นตอนสำคัญของแนวทางการคิดเชิงระบบ เรียนรู้การออกแบบการคิดเชิงระบบ และศึกษาตัวอย่างของการคิดเชิงระบบ",
    "description-en": "Creativity and innovativity; features of innovativity; innovative methods, motivation, example of innovation in health sciences, conceptual of systems thinking framework; principle of systems thinking; pattern of systems thinking, key phases of systems thinking approach, systems thinking design, example of systems thinking."
  },
  {
    "id": "90642015",
    "name-th": "การคิดสร้างสรรค์และนวัตกรรม",
    "name-en": "CREATIVE THINKING AND INNOVATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "กระบวนการคิด การคิดสร้างสรรค์ นวัตกรรม การแก้ปัญหา การประยุกต์ใช้การคิดสร้างสรรค์และนวัตกรรม สำหรับการเรียนรู้ การประยุกต์ใช้การคิดสร้างสรรค์ และนวัตกรรมสำหรับการดำรงชีวิต",
    "description-en": "Process thinking, creative thinking, innovation, problem solving, applications of creative thinking and innovation to learning, applications of creative thinking and innovation to living."
  },
  {
    "id": "90642017",
    "name-th": "แกะกล่องนวัตกรรม",
    "name-en": "INNOVATION UNBOXED",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความสำคัญและความจำเป็นของนวัตกรรม การวิเคราะห์แนวคิด ทฤษฎี และหลักการสำคัญที่เกี่ยวข้อง ต่อการพัฒนานวัตกรรม ประโยชน์ของนวัตกรรมต่อการพัฒนาทุกระดับ การศึกษาปัจจัยส่งเสริมและปัจจัยอุปสรรคต่อการ พัฒนานวัตกรรม การปรับเปลี่ยนมุมมองและทัศนคติด้านจิตนวัตกรรม (Innovative Mind) หลักการวิเคราะห์ สังเคราะห์ บูรณาการ และการสร้างนวัตกรรม การสร้างนวัตกรรมจากการนำความรู้สู่การปฏิบัติที่หลากหลาย",
    "description-en": "Study importance and necessity of innovation; analysis of important concepts, theories, and principles concerning a development of innovation; usefulness of innovation to all levels of development, and study positive and negative factors on the development of innovation, with an adaptation or change in perspective to achieve innovative mindset, principles on analysis, synthesis, integration, and formation of innovation, and innovations from variety of applications of knowledge to various issues and situations."
  },
  {
    "id": "90642018",
    "name-th": "เทคโนโลยีการผลิตงานสร้างสรรค์",
    "name-en": "CREATIVE PRODUCTION TECHNOLOGY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เทคโนโลยีการผลิตเพื่อพัฒนาความคิดสร้างสรรค์ เสริมความสำคัญหลักที่สามารถช่วยวิเคราะห์การเรียนรู้ ด้าน เครื่องมือและระบบทั้งในรูปแบบของวัฒนธรรมเครื่องจักรและนวัตกรรมการผลิต จะนำมาฝึกผ่านการสร้างระบบ ความคิดและความสุนทรีย์การรับรู้ สู่การผลิตผลงานศิลปะและการออกแบบอย่างสร้างสรรค์",
    "description-en": "A technology production for the creative process, are transcribed as learning of production tools, and methods of creative productions. Techniques in manufacturing processes and both traditional and innovative methods and tools are explored to define aesthetic perception and practices employ for production as art and design solution."
  },
  {
    "id": "90642019",
    "name-th": "การออกแบบสะเต็มอย่างสร้างสรรค์ขั้นพื้นฐาน",
    "name-en": "BASIC CREATIVE STEM DESIGN",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกประสบการณ์ในการออกแบบการเรียนรู้ด้านสะเต็มเบื้องต้น (วิทยาศาตร์ เทคโนโลยี วิศวกรรมศาสตร์ และ คณิตศาสตร์) เน้นออกแบบโดยมองตามโลกความเป็นจริงโดยใช้วิธีการเรียนการสอนแบบใช้โครงการเป็นหลัก เน้นการ เรียนรู้โดยใช้กระบวนการคิดเชิงออกแบบ การกำหนดปัญหา การวางแผนการทำงาน การสร้างนวัตกรรมต้นแบบ (prototype) และเน้นสื่อสารโดยใช้สื่อการนำเสนอต่างๆ This is the first course in the two-course sequence constructed to give engineering students",
    "description-en": "a chance to experience real-world design challenge using project-based learning. Students team up to work on short STEM (science, technology, engineering and mathematics) projects. Students will learn the overall design process, framing the problem, schedule planning, creating prototype, as well as learning how to communicate their ideas to audience via meetings, reports, and oral presentations. The course should be taken during freshmen year."
  },
  {
    "id": "90642020",
    "name-th": "การออกแบบสะเต็มอย่างสร้างสรรค์ขั้นสูง",
    "name-en": "ADVANCE CREATIVE STEM DESIGN",
    "credits": "3 (3-0-6)",
    "prerequisite": "90642019",
    "description-th": "ฝึกประสบการณ์ในการออกแบบการเรียนรู้ด้านสะเต็มขั้นสูง (วิทยาศาตร์ เทคโนโลยี วิศวกรรมศาสตร์ และ คณิตศาสตร์) เน้นการใช้องค์ความรู้จากวิชาตัวแรก ฝึกการใช้ความคิดสร้างสรรค์และการสื่อสารเพื่อการนำเสนอผลงาน อย่างมีประสิทธิภาพ",
    "description-en": "This is the second course in the two-course sequence for second-year students after creative STEM design I. Student design teams will work on more advanced STEM projects, utilizing some fundamental engineering knowledge acquired from previous semesters. Creative thinking, and communication skills are further emphasized in this course."
  },
  {
    "id": "90642021",
    "name-th": "ไอเดียขยะ",
    "name-en": "JUNK DESIGN",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวโน้มการเพิ่มปริมาณขยะจากสิ่งของเหลือใช้ต่างๆ ในสถานการณ์ อาทิ ของเหลือใช้จากบรรจุภัณฑ์ หรือจากสิ่งของที่เลิกใช้ เป็นต้น สังเกตทำความเข้าใจมุมมองของผู้ผลิตและพฤติกรรมของผู้บริโภคสินค้าเพื่อที่จะพยายาม ใช้ความคิดสร้างสรรค์ในการช่วยลดปริมาณขยะ แสวงหาวิธีการลดขยะด้วยตนเองโดยใช้ความคิดสร้างสรรค์ เรียนรู้วิธีการ และขั้นตอนการออกแบบอย่างเป็นระบบเพื่อชุบชีวิตขยะด้วยความคิดสร้างสรรค์",
    "description-en": "Study the trend of junk accumulation such as unwanted items, observe and understand buyer’s behavior as well as manufacturer’s viewpoints in order to employ creativity to reduce junks, seek personal creative thinking to reduce junks, including learn system of design thinking and turn creative ideas into new design items."
  },
  {
    "id": "90642022",
    "name-th": "ปรัชญาวิทยาศาสตร์",
    "name-en": "PHILOSOPHY OF SCIENCE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาองค์ประกอบต่างๆ ที่เรียกว่า วิทยาศาสตร์ รวมทั้งคุณลักษณะและวิธีการเชิงวิทยาศาสตร์ซึ่งประกอบ ไปด้วย ความหมาย ความเป็นจริง คุณลักษณะของการสังเกตแบบนักวิทยาศาสตร์ ทฤษฎีและการค้นพบรวมทั้งการก่อตัว การอธิบายความหมาย และการคาดการณ์ทางวิทยาศาสตร์ ปัญหาของการสรุปแบบอุปนัย กระบวนการของการเกิดเหตุ และผล ธรรมชาติของความรู้ทางวิทยาศาสตร์ ความเป็นจริง การทดสอบสมมุติฐาน การยืนยันสมมุติฐาน การยืนยัน สมมุติฐานที่เป็นเท็จ ตรรกะทางวิทยาศาสตร์ และความก้าวหน้าทางวิทยาศาสตร์",
    "description-en": "The course provides a study of the thing we call “science”, together with its nature and methodology. The topics cover the meaning of science, reality, the nature of scientific observations, scientific theories and their discovery and formation, scientific explanations and predictions, the problem of induction, scientific rationality, the nature of scientific knowledge, concepts of truth, hypothesis testing, hypothesis confirmation, hypothesis falsification, logic of scientific method, and scientific progress."
  },
  {
    "id": "90642024",
    "name-th": "การวิเคราะห์ข้อมูลทางวิชาชีพและการนำเสนอทางวิชาการ",
    "name-en": "PROFESSIONAL INFORMATION ANALYSIS AND ACADEMIC PRESENTATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาการสืบค้นข้อมูลในระบบสารสนเทศ การเลือกใช้โปรแกรมการวิเคราะห์ข้อมูลทางสถิติ การอ้างอิงเชิง วิทยาศาสตร์ การตรวจสอบการคัดลอกผลงานทางวิชาการ การแปลผลและการวิเคราะห์ข้อมูลทางวิทยาศาสตร์ เทคนิค การศึกษาและนำเสนอผลงานทางวิชาการทางวิทยาศาสตร์ในระดับนานาชาติ",
    "description-en": "Study information database; statistical analysis software for data analysis; scientific literature and information database; statistical analysis software for data analysis; scientific references; plagiarism prevention; scientific methodology and Interpretation; international scientific communication and presentation."
  },
  {
    "id": "90642025",
    "name-th": "วิเคราะห์ความจริงจากตัวเลข",
    "name-en": "FACTS BEHIND NUMBERS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การศึกษาเกี่ยวกับข้อมูลหรือสารสนเทศในด้านต่าง ๆ โดยมองในแง่มุมของตัวเลขที่เห็นในชีวิตประจำวัน ทั้งที่ เป็นข้อเท็จจริงเกี่ยวกับเรื่องนั้น ๆ ด้วยวิธีการเก็บรวบรวมข้อมูล การนำเสนอข้อมูล การวิเคราะห์ข้อมูล และการ ตีความหมายข้อมูล",
    "description-en": "Study and practice about the data and information indifferent perspective focusing on number, the approach to collect the data, to analyze data, to interpret the analyzed data and to present the result."
  },
  {
    "id": "90642026",
    "name-th": "การพัฒนาทักษะเชิงวิจัย",
    "name-en": "RESEARCH SKILL DEVELOPMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "พัฒนาลักษณะนิสัยที่ดีสําหรับการทํางานวิจัย ทักษะการตั้งคําถาม วิเคราะห์และแก้ปัญหา การวางแผน งานวิจัย การค้นคว้าทบทวนงานตีพิมพ์, ฐานข้อมูลการอ้างอิงงานวิจัยทางวิทยาศาสตร์การใช้คําสําคัญ ซอฟท์แวร์การ อ้างอิงงานตีพิมพ์การเขียนเชิงวิชาการ ทักษะการจดบันทึก การสรุปสาระสําคัญ การออกแบบการทดลอง การใช้เหตุผล และการวิจารณ์ผล ทักษะการสรุปความ การนําเสนออย่างมืออาชีพ ความคิดสร้างสรรค์และนวัตกรรม สิทธิบัตรและการ ค้นคว้าหาสิทธิบัตร จรรยาบรรณนักวิจัย",
    "description-en": "Professional practice for research, problem formulation, analysis and problem solving skills, research planning, literature review, scientific citation database, keywords, citation software, professional writing, note-taking skills, summarizing main ideas, experimental design, reasoning and discussion, drawing conclusion, professional presentation, creativity and innovation, patents and patent search, research ethics."
  },
  {
    "id": "90642028",
    "name-th": "รู้เท่าทันการพนัน",
    "name-en": "GAMBLING LITERACY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ รูปแบบการพนัน วิเคราะห์หลักวิธีคิด ความน่าจะเป็นในการเล่นพนันและโอกาสในการชนะและแพ้ พนัน ศึกษาสาเหตุของความชื่นชอบในการเล่น ศึกษาประสบการณ์ของผู้ติดพนันที่ส่งผลลบต่อการใช้ชีวิต และสร้าง นวัตกรรมการป้องกันไม่ให้เกิดการติดพนัน และการรู้เท่าทัน",
    "description-en": "Learn and analyze gambling patterns, methods of play, probability of winning and losing, causes of addiction, and study possible consequences from real case studies which affects lives and create innovation for gambling prevention."
  },
  {
    "id": "90642029",
    "name-th": "จริยธรรมและกฎหมายว่าด้วยความเป็นมืออาชีพทางการแพทย์",
    "name-en": "MEDICAL ETHICS, LAWS AND PROFESSIONALISM",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาและพัฒนาของวิชาชีพแพทย์ศาสตร์ จะต้องมีคุณลักษณะจรรยาบรรณวิชาชีพของการเป็นผู้รักษา รู้จัก การควบคุมตนเอง และ รับผิดชอบต่อสังคม ซึ่งหลักการของจริยธรรมวิชาชีพแพทย์มีหลักสำคัญ ที่มีแนวคิดของเคารพการ ตัดสินใจของผู้ป่วย ประโยชน์สูงสุดของผู้ป่วย ไม่ก่อให้เกิดอันตรายต่อผู้ป่วย และ ความเป็นธรรม ซึ่งแนวคิดของ ทฤษฎี กรณียธรรม (Deontology) อันตวิทยา (Teleology) และ คุณธรรม (Virtue) เป็นแนวทางหนึ่งของจริยศาสตร์และศาสนา โดยมีกฎหมายแพ่งและอาญาเป็นพื้นฐานที่เกี่ยวข้องกับกฎหมายวิชาชีพและกฎหมายทางการแพทย์ หากเกิดความ ผิดพลาดทางการแพทย์ ยารักษาโรค และประเด็นทางจริยธรรมที่ยากต่อการตัดสินใจ",
    "description-en": "Study and develop of medicine as the profession, attributes of the healer, attributes of the professional, code of conducts, self-regulation and social accountability; principles of medical ethics; concepts of autonomy, beneficence, non-maleficence, and justice; concepts of deontology, teleology, and virtue theory; ethics and religions; basic knowledge in civil and criminal laws; professional and related medical laws; disclosure of medical errors; medicolegal and ethical dilemma"
  },
  {
    "id": "90642030",
    "name-th": "จรรยาบรรณและกฎหมายวิศวกรรม",
    "name-en": "ENGINEERING ETHICS AND LAW",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "บทบาทและหน้าที่วิศวกรไทย จรรยาบรรณวิศวกร สภาวิศวกร พระราชบัญญัติวิศวกร วิชาชีพวิศวกรรมและ วิชาชีพวิศวกรรมควบคุม ข้อบังคับในการประกอบวิชาชีพ กฎหมายอื่นๆ ที่เกี่ยวข้องกับการประกอบวิชาชีพ",
    "description-en": "Role of Thai Engineer, Engineering ethics, Council of Engineers, Engineer Act., Professional Engineer, Regulation of the council of engineer, Other laws relating to profession."
  },
  {
    "id": "90642031",
    "name-th": "จริยธรรมและกฎหมายแห่งวิชาชีพ",
    "name-en": "PROFESSIONAL ETHICS AND LAWS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเกี่ยวกับทฤษฎีและแนวปฏิบัติของวิชาชีพและจริยธรรมโดยรวม และกฎหมายสำหรับการทำงาน รวมถึงจรรยาบรรณและข้อบังคับในด้านวิชาการวิชาชีพและเทคนิค ผู้เรียนจะได้เรียนรู้เกี่ยวกับแนวทางต่างๆในการแก้ไข ปัญหาจริยธรรม และศึกษาจากกรณีศึกษาในชีวิตจริง ซึ่งมาจากบริบททางวิชาชีพที่หลากหลาย หลักสูตรนี้ช่วยให้ผู้เรียน พัฒนาทักษะและความรู้ในการจัดการและมีส่วนร่วมกับประเด็นทางจริยธรรมในชีวิตการทำงาน",
    "description-en": "This course introduces the theory and the practice of professional and overall ethics and laws for professional including code of conducts and regulations in academic, professional and technical fields. Students also learn about different approaches to ethical problems and examine real-life case studies, drawn from a variety of professional contexts. This course helps students develop skills and knowledge to manage and engage with ethical issues in their working lives."
  },
  {
    "id": "90642032",
    "name-th": "กฎหมายสำหรับผู้ประกอบการ",
    "name-en": "LAW FOR ENTREPRENEURS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการจัดตั้งองค์กรธุรกิจ บทบาทขององค์การธุรกิจต่อการดำเนินธุรกิจสมัยใหม่ ศึกษาแนวทางการ จัดการด้านภาษีเพื่อประโยชน์ของธุรกิจ หลักการในการจัดทำสัญญาประเภทต่าง ๆ สัญญาซื้อขาย สัญญาเช่า สัญญาจ้าง แรงงาน สิทธิประโยชน์ตามกฎหมายที่ภาครัฐมีขึ้นเพื่อสนับสนุนและส่งเสริมการประกอบธุรกิจของ SMES ตามกฎหมาย ส่งเสริมวิสาหกิจขนาดกลางและขนาดย่อม หลักการทางกฎหมายที่เกี่ยวกับการซื้อขายสินค้าทางออนไลน์ และข้อควรระวัง สำหรับผู้ประกอบธุรกิจดิจิทัลในการปฏิบัติตามกฎหมายเพื่อคุ้มครองผู้ซื้อ การคุ้มครองข้อมูลส่วนบุคคล",
    "description-en": "Study the principles of business foundations in modern business organizations, Learn tax planning and preparation to benefit for business managements, Learn contract laws and relevant rights to promote a future trend of online markets and internet of things in business implementations, discussing precautions in digital literacy and laws for both entrepreneurs and customers’ protections."
  },
  {
    "id": "90642033",
    "name-th": "กฎหมายสำหรับคนรุ่นใหม่",
    "name-en": "LAW FOR NEW GENERATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษากฎหมายและวิเคราะห์ข้อเท็จจริงที่เกิดขึ้นในสังคม บทบาทหน้าที่และสิทธิเสรีภาพในการแสดงความ คิดเห็นในที่สาธารณะ การดูหมิ่นหรือหมิ่นประมาทผู้อื่น การใช้สื่อสังคมออนไลน์ภายใต้กรอบของกฎหมาย ความรับผิดที่ เกี่ยวกับการกระทำผ่านระบบคอมพิวเตอร์ แนวคิดและหลักการของกฎหมายคุ้มครองผู้บริโภคที่มีต่อผู้ประกอบธุรกิจ ปัญหาความรับผิดจากการใช้งานลิขสิทธิ์หรือละเมิดทรัพย์สินทางปัญญาของผู้อื่น และสิทธิในการปกป้องงานลิขสิทธิ์ของ ตนเองตามกฎหมายลิขสิทธิ์",
    "description-en": "Study the laws and analysis facts of law in our society, learning about civic right and responsibilities in expression of opinion, defamation when using online media under acts of computer and digital media use, principles of consumers’ protection laws and relevant copyright laws."
  },
  {
    "id": "90642034",
    "name-th": "กฎหมายและระเบียบในอุตสาหกรรมการบิน",
    "name-en": "LAW AND REGULATION IN AVIATION INDUSTRY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "กฎหมายการเดินอากาศจากองค์การการบินพลเรือนระหว่างประเทศ กฎหมายการบินจากองค์กรในประเทศ ในทวีปยุโรปและองค์กรระหว่างประเทศอื่น ๆ กฎระเบียบการบินในประเทศไทย กรอบการดำเนินงานและกฎระเบียบของ องค์กรระหว่างประเทศ ผลกระทบของกฎหมายการเดินอากาศต่ออุตสาหกรรมการบิน ประเด็นทางกฎระเบียบต่าง ใน อุตสาหกรรมการบิน",
    "description-en": "International Civil Aviation Organization (ICAO) and other international and European organizations’ air law. Aviation regulators in Thailand. Legal and institutional framework of international air law regimes. Impacts of air law towards aviation industry. Legal issues in aviation industry."
  },
  {
    "id": "90642035",
    "name-th": "ประสบการณ์ในอุตสาหกรรมสำหรับวิศวกร",
    "name-en": "INDUSTRIAL EXPERIENCE FOR ENGINEERS",
    "credits": "3 (0-18-0)",
    "prerequisite": null,
    "description-th": "การเปิดตัวสู่การปฏิบัติในวิชาชีพ หรือประสบการณ์ในอุตสาหกรรมทำให้เกิดโอกาสที่จะได้รับการอบรมแบบ ลงมือจริงและมีประสบการณ์จริงในสถานการณ์ปัจจุบันในอุตสาหกรรม นอกจากนั้นแล้ว ผ่านการปฏิบัติจริงใน อุตสาหกรรม ความสามารถของนักศึกษาจะสะท้อนออกมาและสอดรับระหว่างกันอย่างเหมาะสมระหว่างหลักสูตรต่อเนื่อง สู่การปฏิบัติที่ดี รายวิชาปฏิบัตินี้เป็นวิชาที่ต่อยอดจากการฝึกงานและสหกิจศึกษา ผู้เรียนจะได้รับการพัฒนาทักษะทั้งที่ เกี่ยวข้องกับทางด้านวิศวกรรมศาสตร์และการทำงานในที่ทำงาน รวมทั้งประสบการณ์การปฏิบัติจริงที่จำเป็นสำหรับการ ประกอบอาชีพในอนาคต",
    "description-en": "Exposure to Professional Practice (EPP), or Industrial Experience (IE), provides an opportunity to gain valuable hands-on training and experience in real world situations. Additionally, through exposure to current practice, students can reflect on, and appreciate the linkage between curriculum and practice. This is an advance to the Internship and Co-op Education. Students will develop specific skills both on engineering and professionals including hands-on experience required to their professional careers."
  },
  {
    "id": "90642036",
    "name-th": "เตรียมความพร้อมสำหรับวิศวกร",
    "name-en": "PRE-ACTIVITIES FOR ENGINEERS",
    "credits": "1 (0-3-0)",
    "prerequisite": null,
    "description-th": "การเข้าร่วมกิจกรรมทางคณะวิศวกรรมศาสตร์จัดเตรียมขึ้น เพื่อเป็นการแนะแนว และเตรียม ความพร้อม นักศึกษาในการศึกษาและประกอบอาชีพวิศวกรที่ประสบความสำเร็จ ปฏิบัติการพื้นฐานและโครงงานเบื้องต้นทาง วิทยาศาสตร์และเทคโนโลยี",
    "description-en": "Participates in activities organized by the Faculty of Engineering of advising and preparing students for successful Engineering education and career. Fundamental Laboratory and project in science and technology."
  },
  {
    "id": "90642037",
    "name-th": "ประเด็นและทักษะวิชาชีพ",
    "name-en": "PROFESSIONAL SKILLS AND ISSUES",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและแนะนำประเด็นทางสังคม จริยธรรม กฎหมาย และวิชาชีพที่เกี่ยวข้องกับการใช้เทคโนโลยี สารสนเทศอย่างกว้างขวาง และให้ผู้เรียนได้เรียนรู้การพัฒนาจุดยืนของตนเอง และมีการถกเถียงกันในประเด็นต่างๆ เหล่านี้",
    "description-en": "This course introduces the social, ethical, legal, and professional issues involved in the widespread deployment of information technology. It teaches students to develop their own, well-argued positions on many of these issues."
  },
  {
    "id": "90642038",
    "name-th": "ความปลอดภัยในที่ทำงาน",
    "name-en": "OCCUPATIONAL SAFETY AND HEALTH",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และตระหนักถึงการควบคุมอันตรายในสถานที่ทำงานซึ่งประกอบไปด้วย สารเคมี การควบคุมมลภาวะ ทางเสียงและการได้ยิน ความร้อนและการแผ่รังสี การติดเชื้อโรคทางผิวหนัง เรียนรู้กระบวนการควบคุม การจัดการและ วิธีการต่างๆเพื่อให้เกิดความปลอดภัยต่อสุขภาพ",
    "description-en": "Recognition and control of hazard; in workplace, chemical agent, noise and hearing conservation, heat and radiation, infectious agent, occupational dermatoses, general control practice; management and approaches."
  },
  {
    "id": "90642039",
    "name-th": "ซ่อมได้ภายในบ้าน",
    "name-en": "QUICK-FIX @ HOME",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาระบบสาธารณูปโภคพื้นฐานภายในบ้าน เช่น ระบบไฟฟ้า ระบบแสงสว่าง ระบบน้ำ และระบบการ สื่อสาร รวมทั้งศึกษาอุปกรณ์ เครื่องมือพื้นฐานที่ใช้ในระบบต่างๆ และเรียนรู้ที่จะป้องกันปัญหาต่างๆ ที่อาจเกิดขึ้น รวมทั้ง สามารถซ่อมแซมในปัญหาพื้นฐานได้อย่างปลอดภัย",
    "description-en": "Study the basic household utilities systems such as electricity, lighting, water and communication including study basic equipment and appliances in the house for basic fixing, and learn how to prevent possible problems as well as how to fix minor problems with safety."
  },
  {
    "id": "90642040",
    "name-th": "คอกาแฟ",
    "name-en": "COFFEE MANIA",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความเป็นมาของกาแฟ เมล็ดกาแฟ วิวัฒนาการและพัฒนาการการดื่มกาแฟ การปลูก การแปรรูป การ คั่วกาแฟ ศาสตร์การทำฟองนม ศาสตรและศิลป์ในการชงกาแฟแบบต่างๆ ซึ่งมีหลักการวิทยาศาสตร์เข้ามาเกี่ยวข้อง และ ศึกษาการเป็นผู้ประกอบการเพื่อนำความรู้ไปต่อยอดทำธุรกิจในอนาคต",
    "description-en": "Study the history of coffee, coffee beans, the evolution and development of drinking coffee, the cultivation, bean processing, roasting, how to brew coffee in a variety of styles and do milk froth based on science principles, and study how to be an entrepreneur with coffee business."
  },
  {
    "id": "90642041",
    "name-th": "ครัวเด็กหอ",
    "name-en": "DORM CHEF",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาโภชนาการที่สำคัญของอาหารที่ร่างกายต้องการ วิทยาศาสตร์และศิลปะของการทำอาหารใน รูปแบบ ต่างๆด้วยอุปกรณ์ที่สามารถหาได้ไม่ยากในชีวิตเด็กหอ ได้แก่ ไมโครเวฟ หม้อหุงข้าว กระทะไฟฟ้าและอื่นๆ ที่สามารถจะ ประกอบอาหารที่มีคุณค่าทางโภชนาการสูงเหมาะกับร่างกายในเวลาที่จำกัด",
    "description-en": "Study the importance of nutrition for human need, science and art of cooking nutrient dish with available cooking appliances for students, for instance, microwave oven, rice cooker, electric pan and so on."
  },
  {
    "id": "90642042",
    "name-th": "ศาสตร์และศิลป์ของเนื้อสัตว์",
    "name-en": "SCIENCE AND ART OF MEATS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเรื่องของชนิดเนื้อและชิ้นส่วนต่าง ๆ เพื่อนำมาบริโภคที่เหมาะสม แหล่งที่มาของเนื้อที่ดี การคัดเลือก และการเก็บรักษาด้วยหลักการทางวิทยาศาสตร์ ฝึกคิดรูปแบบที่หลากหลายในการทำอาหารที่ใช้เนื้อ การคิดสร้างสรรค์ เมนูเนื้อที่ถูกหลักโภชนาการและการบริโภคเนื้ออย่างมีความสุข เรียนรู้เมนูเนื้อจากแหล่งต่างๆ",
    "description-en": "Study types and parts of meats for proper consumption, sources of good meats, to select suitable material and prolong storage of shell-life base on scientific knowledge, creativity of quality and dishes and nutrition."
  },
  {
    "id": "90642043",
    "name-th": "ศาสตร์ของเบอร์เกอร์",
    "name-en": "SCIENCE OF BURGER",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "องค์ประกอบของเบอร์เกอร์รูปแบบของเบอร์เกอร์ที่หลากหลาย เบอร์เกอร์เพื่อสุขภาพ วัตถุดิบและการเลือก วัตถุดิบที่แตกต่างกันในการทำเบอร์เกอร์ เรียนรู้อุปกรณ์พื้นฐานที่จำเป็นในการทำเบอร์เกอร์ เรียนรู้เทคนิคการทำเบอร์ เกอร์ การคิดสร้างสรรค์ออกแบบรูปแบบเบอร์เกอร์",
    "description-en": "Burger materials, types of burger, including vegan burger and healthy burger. Basic equipments and new images creativity of burger."
  },
  {
    "id": "90642044",
    "name-th": "โลกของไส้กรอก",
    "name-en": "WORLD OF SAUSAGES",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความเป็นมาของไส้กรอกรูปแบบที่หลากหลายจากทั่วโลก ฝึกคิดถึงความเป็นไปได้ในการทำเมนูไส้กรอก จากวัตถุดิบที่แตกต่างกัน ศึกษาคุณค่าอาหารในไส้กรอกเพื่อนำมาคิดคำนวณประโยชน์ที่จะได้รับ เรียนรู้เทคนิคการทำไส้ กรอกแบบโฮมเมด และคิดสร้างสรรค์รูปแบบการจัดอาหารจากไส้กรอก",
    "description-en": "Study of sausages history and sausages varieties around the world, creation of practical ways to make new varieties of sausages using different ingredients and raw materials, study of nutrition in sausages and calculate their value in health benefit, leaning how to make homemade sausages and produce more new dishes."
  },
  {
    "id": "90642045",
    "name-th": "เรื่องเหล้า",
    "name-en": "BE MY BEV.",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ประวัติศาสตร์และประเภทของเครื่องดื่ม หลักการพื้นฐานในการผลิตและการเตรียมเครื่องดื่มประเภท ต่าง ๆ ประเภทและรูปแบบหลัก ๆ ของสุรากลั่น ปัจจัยที่ส่งผลต่อรสชาติสุรากลั่น วิธีการให้บริการเครื่องดื่ม การจับคู่ เครื่องดื่มกับอาหาร และการถ่ายภาพเครื่องดื่ม",
    "description-en": "Learn the history and types of beverages; basic of principles of beverage production method; major types and forms of distilled spirits; factors affecting taste; beverage service procedure; food pairing; and food photography."
  },
  {
    "id": "90642046",
    "name-th": "ไร้ซ์-สาระ",
    "name-en": "RICE-SARA",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเรื่องราวเกี่ยวกับข้าวโดยเลือกประเด็นตามความสนใจ โดยประเด็นที่เลือกอาจครอบคลุมประวัติศาสตร์ ของข้าว ความสำคัญของข้าว พันธุ์ข้าวที่สำคัญของประเทศไทยและของโลก วัฒนธรรมเรื่องข้าวและชาวนา กระบวนการ ปลูกและดูแลรักษา กระบวนการการเก็บเกี่ยว กระบวนการหลังการเก็บเกี่ยวข้าว การประกอบอาหารจากข้าว คุณประโยชน์และการใช้ประโยชน์จากข้าวและวัสดุเหลือใช้จากข้าว และนำประเด็นที่สนใจมาออกแบบการเรียนรู้เป็นกลุ่ม ผ่านโครงการเน้นการใช้ความคิดสร้างสรรค์ในกระบวนการเรียนรู้",
    "description-en": "Study the topics of the rice story and select one based on personal interests, the topic can include the history of rice and its importance, differences of domestic and international rice varieties, the culture of rice and farmers, pre-harvesting, harvesting and post harvesting processes of rice, cooking food using rice base, the nutrition and the usage of rice and its by-product. And design the selected topic to learn through project- and team- based learning with creative thinking."
  },
  {
    "id": "90642047",
    "name-th": "หมอต้นไม้",
    "name-en": "TREE DOCTOR",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาประเภทของต้นไม้ คุณค่าของต้นไม้กับการอยู่ร่วมกันระหว่างมนุษย์กับต้นไม้ วิธีการดูแล รู้จักอนุรักษ์ ต้นไม้ การลงพื้นที่สำรวจต้นไม้ที่อยู่ในความสนใจ การใช้สื่อเพื่อการรณรงค์รักษา และรู้คุณค่าของต้นไม้",
    "description-en": "Study a variety of trees, and their values, relationship and make a survey of trees at your own interests, using the media to do the campaign of trees protection and to understand the values of trees."
  },
  {
    "id": "90642048",
    "name-th": "ยาและสมุนไพรพาเพลิน",
    "name-en": "FUN WITH DRUGS AND HERBS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ระหว่างยากับสมุนไพรและ/หรือสารอื่นๆ ตัวอย่างยาและสมุนไพรที่ใช้ในการรักษาโรคเบื้องต้น การพิจารณาเลือกใช้ยา และสมุนไพรจากโฆษณาตามสื่อออนไลน์ ศึกษาความรู้เบื้องต้นของยาและสมุนไพรที่ใช้ในชีวิตประจำวัน แหล่งที่มาของการค้นพบตัวยาประโยชน์และ โทษของยาสมุนไพร การเลือกใช้ การเก็บรักษาและเคล็ดลับการใช้ยาสมุนไพรให้ถูกต้องและปลอดภัย การเกิดอันตรกิริยา",
    "description-en": "Study the basic knowledge of drugs and herbal medicines in daily life, a brief history of drug discovery, beneficial and harmful effects of drugs and herbal medicines, general principles for good storage condition and safe administration including taking medicines with the correct techniques, avoiding drug-drug or herb-drug interaction and reasonably selecting drug and herb products from online advertising for self-medication."
  },
  {
    "id": "90642049",
    "name-th": "การใช้ประโยชน์จากจุลินทรีย์ในชีวิตประจำวัน",
    "name-en": "MICROBIAL UTILIZATION FOR DAILY LIFE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ความรู้ที่เกี่ยวข้องกับจุลินทรีย์เบื้องต้น การใช้ประโยชน์จากจุลินทรีย์ในการกระบวนการผลิตอาหารหมัก วิธีการผลิตและเชื้อจุลินทรีย์ที่เกี่ยวข้องในอาหารหมัก จุลินทรีย์ที่มีผลต่อคุณภาพและความปลอดภัยของอาหาร สารออก ฤทธิ์ทางชีวภาพจากจุลินทรีย์ วิธีการผลิตและการประยุกต์ใช้ เอนไซม์จากจุลินทรีย์ การทำงานของเอนไซม์และการใช้ ประโยชน์ จุลินทรีย์ที่เกี่ยวข้องกับการบำบัดน้ำเสียและการชะล้างโลหะด้วยจุลินทรีย์ แนวโน้มการใช้ประโยชน์จาก จุลินทรีย์ในอนาคต",
    "description-en": "Introduction to basic knowledge of microorganism, Production and application of microorganisms in fermentation food, Food quality and food safety related to microorganism, Bioactive compound from microorganisms and its application, Microbial enzymes, Enzyme function and application, Microorganisms involved in wastewater treatment and microbial metal leaching, Future trends for microbial utilization."
  },
  {
    "id": "90642050",
    "name-th": "พืชพรรณที่เป็นยา",
    "name-en": "MEDICINAL PLANTS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความรู้พื้นฐานของพืชสมุนไพร ประวัติการค้นพบของพืชสมุนไพร พื้นฐานสารพฤกษเคมี การใช้พืช สมุนไพรในการดูแลสุขภาพเบื้องต้นและในชีวิตประจำวัน ศึกษาปฏิกิริยาระหว่างยาแผนปัจจุบันกับสมุนไพร และการเลือก ผลิตภัณฑ์สมุนไพรอย่างถูกต้องจากโฆษณาออนไลน์ สำหรับการใช้ยาเพื่อการดูแลสุขภาพเบื้องต้นด้วยตนเอง",
    "description-en": "Study the basic knowledge of medicinal plants, a brief history of medicinal plants discovery, basic phytochemicals, medicinal plants in primary health care and daily life, herb-drug interaction and reasonably selecting herb products from online advertising for self-medication"
  },
  {
    "id": "90642051",
    "name-th": "เทคโนโลยีชีวภาพเพื่อความเป็นอยู่ที่ดีขึ้น",
    "name-en": "BIOTECHNOLOGY FOR BETTER LIVING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาสี่หัวข้อดังนี้ เทคโนโลยีชีวภาพทางอาหาร เกษตรกรรม สิ่งแวดล้อม ทางการแพทยศาสตร์ หัวข้อแรก เทคโนโลยีชีวภาพทางอาหารจะประกอบด้วยเทคโนโลยีชีวภาพสำหรับการปรุงอาหารและเทคโนโลยีหลังการเก็บเกี่ยว หลังจากนั้นในส่วนเกษตรกรรมจะประกอบด้วยการเพาะเลี้ยงเนื้อเยื่อ พืชและสิ่งมีชีวิตดัดแปลงพันธุกรรม ในส่วนที่สามคือ สิ่งแวดล้อม ได้แก่ หัวข้อสารกำจัดศัตรูพืชจากธรรมชาติและโลกที่สวยงามด้วยเทคโนโลยีชีวภาพ ส่วนสุดท้ายประกอบด้วย หัวข้อของเซลล์และยีนบำบัด วิศวกรรมพันธุศาสตร์เพื่อการป้องกันโรค เทคโนโลยีในการพัฒนาวัคซีน ไมโครไบโอมของ มนุษย์ และอายุรศาสตร์ และ นิติวิทยาศาสตร์",
    "description-en": "The subject is divided into four sections including food biotechnology, agriculture, environment and medicine. At the first, food biotechnology consists of biotechnology for cooking and post-harvest technology. Next, agriculture section comprises plant tissue culture and genetically modified organisms. The third section, environment is which includes the topics of natural pesticide and beautiful world with biotechnology. The last section consists of the topics of cell and gene therapy, genetic engineering for disease prevention, technology for vaccine development, human microbiome and live medicine and forensic science."
  },
  {
    "id": "90642052",
    "name-th": "จากเส้นสาย สู่พันธุกรรม DNA",
    "name-en": "GENES & GENETICS : FROM HELIX TO HEREDITARY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการของพันธุศาสตร์ในระดับโมเลกุลและระดับโครโมโซมจากโครงสร้างพื้นฐานของดีเอ็นเอและ โครโมโซม การแสดงออกของยีน การถ่ายทอดลักษณะทางพันธุกรรม สาเหตุและผลกระทบของความผิดปกติของดีเอ็นเอ และโครโมโซมต่อสุขภาพและโรค เทคนิคในการศึกษาดีเอ็นเอและโครโมโซมไปจนถึงการนำไปใช้ หลักการทางพันธุกรรม ในวิทยาศาสตร์สุขภาพ",
    "description-en": "Principles of genetics in terms of molecular basis and chromosomal levels from basic structure of DNA and chromosomes, gene expression, inheritance of genetic materials, causes and effects of DNA and chromosome aberration in health and diseases, techniques to study DNA and chromosomes, to application of genetic principles in health sciences."
  },
  {
    "id": "90642053",
    "name-th": "สาระน่ารู้อณูพันธุศาสตร์",
    "name-en": "INTERESTING MOLECULAR GENETICS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความรู้พื้นฐานของพันธุศาสตร์ในมนุษย์ โรคทางพันธุกรรมที่พบบ่อยในประเทศไทย การป้องกันและ รักษาโรคทางพันธุกรรม ความรู้พื้นฐานด้านพันธุศาสตร์เพื่อการสืบพันธุ์และการวางแผนการมีบุตร ความรู้พื้นฐานด้านพันธุ ศาสตร์เพื่อการประยุกต์ใช้ในงานนิติวิทยาศาสตร์และการสืบหาญาติพี่น้อง การประยุกต์ใช้ความรู้พื้นฐานทางพันธุศาสตร์ เพื่อการปรับปรุงพันธุ์พืชและสัตว์ การประยุกต์ใช้ความรู้พื้นฐานทางพันธุศาสตร์เพื่อใช้ในอุตสาหกรรม จริยธรรมของการ ประยุกต์ใช้พันธุศาสตร์เพื่องานทางด้านวิทยาศาสตร์และเทคโนโลยี",
    "description-en": "Study the basic knowledge of genetics in human, common genetic diseases in Thailand, prevention and treatment of genetic diseases, genetics for reproduction and family planning, genetics and its applications in forensic sciences and detecting relatives. Application of basic knowledge in genetics for plant and animal breeding and industrial use. Ethics of genetics and its applications in science and technology."
  },
  {
    "id": "90642054",
    "name-th": "สิ่งพิทักษ์ร่างกาย",
    "name-en": "GUARDIANS OF OUR BODIES",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและอภิปรายเกี่ยวกับการสำรวจความรู้เกี่ยวกับกลไกการป้องกันขั้นพื้นฐานในมนุษย์ แนวคิดของการ ตอบสนองภูมิคุ้มกันของมนุษย์ในการป้องกันโรคติดเชื้อและความผิดปกติ กิจกรรมการเรียนรู้ส่วนใหญ่อาศัยการอภิปราย เชิงวิพากษ์เกี่ยวกับประเด็นร้อนในภาพยนตร์ละครโทรทัศน์และข่าวที่เกี่ยวข้องกับกระบวนการป้องกันและการตอบสนอง ของระบบภูมิคุ้มกัน",
    "description-en": "This is a discussion-based course that explores the knowledge of basic defensive mechanisms in human. We will introduce you to the concept of human immune responses in protection against infectious diseases and disorders. The learning activities rely mainly on the critical discussion about hot issues in movies, TV drama and news that involve the defensive processes and immune responses."
  },
  {
    "id": "90642055",
    "name-th": "จุลินทรีย์ร่วมชีพ",
    "name-en": "LIVING WITH MICROBES",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาถึงประวัติและการแนะนำจุลินทรีย์ พื้นฐานของจุลชีววิทยาและเทคนิค เรียนรู้แบคทีเรียคืออะไร เชื้อรา ไวรัส ปรสิต ไมโครไบโอมในผิวหนัง ใบหน้าและรักแร้ ศึกษาจุลินทรีย์ในระบบทางเดินอาหาร ไมโครไบโอมในอวัยวะ สืบพันธุ์ ไมโครไบโอมเป็นยาที่มีชีวิต (การแพทย์ทางเลือก) ยาปฏิชีวนะและความต้านทานต่อจุลินทรีย์ วัคซีนจากจุลินทรีย์ ปัญหาด้านโรคจุลินทรีย์และเทคโนโลยี",
    "description-en": "History and introduction of microbes; Basic microbiology and its techniques; What are Bacteria, Fungi, Virus, Parasite; Microbiome in Skin, Face and Armpits; Microbiome in Gastrointestinal tracts; Microbiome in Genital tracts; Microbiome as living drugs (alternative medicine); Antibiotics and how microbe resistance; Vaccines from microbes; Hot issues in microbial disease & technology."
  },
  {
    "id": "90642056",
    "name-th": "โรคระบาดในศตวรรษที่ 21",
    "name-en": "EPIDEMICS IN THE 21st CENTURY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและค้นคว้าข้อมูลประวัติศาสตร์โรคระบาดในอดีตที่ผ่านมาจนถึงโรคโควิด ทำความเข้าใจโรคใหม่ที่เกิด ขึ้นมาโดยเฉพาะโรคโควิด-19 พร้อมทั้งค้นคว้าสถานการณ์การเกิดขึ้นของโรคโควิด ฝึกวิเคราะห์ผลกระทบที่ส่งผลต่อด้าน ต่างๆ ทั้งวิถีการดำรงชีวิต เศรษฐกิจ การเงินและสังคม ฝึกการคาดการณ์สิ่งที่จะเกิดขึ้นในอนาคตโดยใช้หลักการทาง วิทยาศาสตร์และเทคโนโลยีทางการแพทย์เป็นฐานความรู้ และฝึกคิดวิเคราะห์สถานการณ์ที่จะทำให้เรารอดพ้นและ ปลอดภัย รวมทั้งฝึกนำเสนอวิธีการรับมือในระดับภาพรวมและการดูแลป้องกันในระดับบุคคล",
    "description-en": "Study and do the research of the history of the epidemic from the past to COVID-19, learn to understand the emerging COVID-19, the timeline of the incidence of COVID-19, practice analyzing the impacts of COVID-19 epidemic on economy, finance and society, practice predicting what could happen in the future using scientific principles and medical technology as a knowledge base, practice analyzing situations that will make us survive and safe, and practice presentation skills on how to cope well with the epidemic and recommend the preventive measures for individuals."
  },
  {
    "id": "90642057",
    "name-th": "ภูมิคุ้มกาย",
    "name-en": "IMMUNITY THROUGH MEDIA",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ความรู้เบื้องต้นเกี่ยวกับโรค และภูมิคุ้มกันของร่างกาย ผ่านทางการดูละครหรือภาพยนตร์เพื่อให้เกิด ความเข้าใจทางการแพทย์ อย่างถูกต้องและสามารถนำมาใช้ได้จริงในชีวิตประจำวัน",
    "description-en": "Study the diseases and the body immunity from media to understand medically purposes and to use in daily life."
  },
  {
    "id": "90642058",
    "name-th": "ความเข้าใจในนโยบายสุขภาพและสวัสดิภาพของประชาชน",
    "name-en": "UNDERSTANDING HEALTH POLICY AND PUBLIC WELFARE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการของนโยบายสาธารณะ สุขภาพและสวัสดิภาพของประชาชน การตัดสินใจ การวางแผน และ การดำเนินการเพื่อให้บรรลุเป้าหมายการดูแลสุขภาพโดยเฉพาะ โดยมีการจัดลำดับความสำคัญด้านสุขภาพตามบทบาท ของรัฐบาล ซึ่งมีแนวคิดเกี่ยวกับการวิจัยระบบสุขภาพ ตามหลักธรรมาภิบาล แนวคิดเกี่ยวกับเรื่องความรับผิดชอบ ความ โปร่งใส หลักนิติธรรม ความเสมอภาคและความเป็นธรรม การมีส่วนร่วม แสวงหาฉันทามติ เศรษฐศาสตร์สาธารณสุข เบื้องต้น ให้มีประสิทธิผลและประสิทธิภาพ มีการโต้ตอบ ในหลักธรรมาภิบาลและการดูแลสุขภาพ ตามบทบาทของหลัก ธรรมาภิบาลในศตวรรษที่ 21",
    "description-en": "Principle of public policy, population health and welfare; decisions, plans, and actions undertaken to achieve specific health care goals; prioritization in health; role of government; concept of health system research; principles of good governance, concepts of accountability, transparency, rule of laws, equitability and fairness, participatory, consensus oriented, basic health economics, effectiveness and efficiency, responsiveness; good governance and health care; role of good governance in the 21st century."
  },
  {
    "id": "90642059",
    "name-th": "การแพทย์และวรรณกรรม",
    "name-en": "MEDICINE AND LITERATURE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาภาษาทางการแพทย์ การบรรยายทางการแพทย์ แง่มุมทางการแพทย์ของวรรณกรรมคลาสสิก การเล่า เรื่องอย่างมีประสิทธิภาพเพื่อเพิ่มความเห็นอกเห็นใจในการดูแลทางการแพทย์ การเผยแพร่ทางการแพทย์ การศึกษาทางการแพทย์ด้วยสื่อสังคมออนไลน์และสื่อมวลชน",
    "description-en": "Language and medical practice, medical narrative, medical aspects of classic literature, effective storytelling to enhance empathy in medical care, medical publishing, social media and mass media in medical education."
  },
  {
    "id": "90642060",
    "name-th": "ค้นหาตัวตน",
    "name-en": "SELF-DISCOVERY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาการเปลี่ยนแปลงทางร่างกายในช่วงวัยแรกรุ่นรวมถึงอัตลักษณ์ทางเพศ การพัฒนาทางอารมณ์ การ พัฒนาทางสังคม สถานการณ์ที่เป็นปัจจัยเสี่ยงทั้งหมดที่เกี่ยวข้องกับการละเมิดและอาชญากรรม การพัฒนาทางศีลธรรม ช่วงการเปลี่ยนแปลงสู่การเป็นผู้ใหญ่",
    "description-en": "Physical changes during puberty including gender identity, emotional development, social development, vulnerable states to all risk factors related to abuses and crime, moral development, transition period to be an adult."
  },
  {
    "id": "90642061",
    "name-th": "โลกของแมลง",
    "name-en": "WORLD OF INSECTS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาสองโมดูล โมดูลแรกคือความหลากหลายทางชีวภาพ รวมถึงแมลง วิวัฒนาการ ความหลากหลาย ผลกระทบ แรงดึงดูดทางเคมี และการสื่อสาร โมดูลที่สองคือหัวข้อเกี่ยวกับการประยุกต์ใช้และประสบการณ์ด้านแมลง ได้แก่ โบราณคดี อาวุธ อาหารและความบันเทิง รวมถึงเทคโนโลยีหุ่นยนต์และแบบจำลองแมลง นอกจากนี้ยังมีนิติ วิทยาศาสตร์ แมลงที่เป็นอันตราย (แมลงที่เป็นอันตรายถึงตายและโรคไมอาซิส) และการควบคุมแมลง The subject is divided two modules. First module is the biodiversity including insect fauna",
    "description-en": "evolution, diversity and impacts and chemical attraction and communication. The second module is the topics with application and experiences in insects including archaeology, weapons, diets and entertainments. In addition, the topics are technology including robotics and insect model. Also, medical areas are the forensic importance, dangerous insects (deadly and myiasis insects), and insect control."
  },
  {
    "id": "90642062",
    "name-th": "เรื่องกินเรื่องใหญ่",
    "name-en": "ALL ABOUT FOOD",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การศึกษาความเป็นมา รูปแบบและประเภทของอาหารและเครื่องดื่ม ประเภทธุรกิจของอาหารและเครื่องดื่ม เครื่องมือและอุปกรณ์สำหรับการรับประทานอาหารเทคนิคและศิลปะการบริการอาหาร การรับประทานอาหารในรูปแบบ ต่าง ๆ รวมทั้งการจัดโต๊ะ และการเลือกสรรอาหารอย่างเหมาะสม",
    "description-en": "A study of fundamental knowledge, background, styles and types of food and beverage business; cooking utensils and cutlery; techniques and arts of food services, including eating various types of food, table setting and table manners as well as appropriate food selection."
  },
  {
    "id": "90642063",
    "name-th": "การพัฒนาสุขภาพแบบองค์รวม",
    "name-en": "HOLISTIC HEALTH DEVELOPMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความสำคัญของการรักษาสุขภาพกายและสุขภาพจิต องค์ประกอบของการพัฒนาสุขภาพกายและ สุขภาพจิตที่ดี ปัจจัยที่มีผลต่อการพัฒนาสุขภาพกายและสุขภาพจิตการปรับตัวเพื่อการอยู่ร่วมกับผู้อื่นอย่างมีความสุข",
    "description-en": "Study the concepts of health and mental care. Explore the components of good health and mental development and learn factors enhancing the development."
  },
  {
    "id": "90642074",
    "name-th": "อีสปอร์ต",
    "name-en": "E-SPORTS",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาความเป็นมาของกีฬาอีสปอร์ต เรียนรู้ กฎ กติกา มารยาทการเป็นนักกีฬาที่ดี เรียนรู้วิธีการ แข่งขัน การวางแผนกลยุทธ์การเล่นแบบเดี่ยวและทีม การเล่นกีฬาอย่างถูกวิธี ไม่ให้กระทบต่อสุขภาพ ศึกษาวงการกีฬาอี สปอร์ตในภาพรวมเพื่อสร้างความเข้าใจสายงานอาชีพที่เกี่ยวข้อง เลือกฝึกฝนทักษะความชานาญในด้านการเป็น นักกีฬาหรือเป็นผู้ชานาญการที่เกี่ยวข้องในการจัดการกีฬาอีสปอร์ต เช่น ผู้จัดการทีม ผู้จัดการแข่งขัน กรรมการ ผู้ดูแล เกม เป็นต้น",
    "description-en": "Study E-sports background, rules and appropriate manners, and study how to play and plan strategically for playing either as individuals and teams and how to play with no harm to health, including studying the overview of E-sport management to understand roles of all groups of people concerned such as team manager, competition organizer, committee, game master, etc., and practice skills of the role preferred."
  },
  {
    "id": "90642080",
    "name-th": "การประพันธ์เพลงเบื้องต้น",
    "name-en": "INTRODUCTION TO MUSIC COMPOSITION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การประพันธ์เพลงเบื้องต้น ศึกษาโครงสร้างการประพันธ์เพลงที่ไม่ซับซ้อน การจัดวางและการพัฒนาของโม ทีฟ รูปแบบจังหวะ ฟอร์ม การแต่งทำนอง เนื้อร้อง การแต่งเสียงประสาน การเรียบเรียงเสียง วงดนตรี การแต่งเพลงเพื่อ การพาณิชย์เบื้องต้น",
    "description-en": "Rudimentary skills in music composition. Basic understanding of musical structures. Motif, rhythmic pattern, form, melodic composition, harmonic composition, orchestration, song writing. Practical writing experience."
  },
  {
    "id": "90642081",
    "name-th": "สุนทรียะเพลงแรป",
    "name-en": "RAP APPRECIATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษารูปแบบการแต่งเพลงแรป วิวัฒนาการของเพลงแรพจากทั่วโลกและในประเทศไทย วิเคราะห์ สังเคราะห์และตีความการใช้ภาษาในเพลงอย่างมีวิจารณญาณ การมองสะท้อนวัฒนธรรมที่สอดแทรกในบทเพลงเพื่อให้ เข้าใจบริบทและเข้าใจคุณค่าของบทเพลง การฝึกแต่งและร้องเพลงแรปแบบปัญญาชน",
    "description-en": "Study the patterns and lyrics writing styles of rap songs, development of rap songs worldwide and in Thailand. Use critical thinking to analyze, synthesize and interpret the lyrics. Practice to appreciate the cultural contexts and the song values as well as to compose the rap song as intellectuals."
  },
  {
    "id": "90642082",
    "name-th": "สุนทรียะดนตรี",
    "name-en": "MUSIC APPRECIATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษารูปแบบ ลักษณะ ธรรมชาติ และองค์ประกอบของดนตรี ความรู้เบื้องต้นเกี่ยวกับดนตรีไทยและสากล การชื่นชมความงามและการตระหนักถึงคุณค่าของดนตรี ทักษะและมารยาทในการฟังดนตรี",
    "description-en": "Study the forms, characteristics, nature and compositions of music. Learn Introduction to Thai and International music, how to express appreciation for its aesthetics and value as well as learn appropriate manners in listening to music."
  },
  {
    "id": "90642083",
    "name-th": "ศิลปะแห่งภาพยนตร์",
    "name-en": "FILM APPRECIATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และฝึกฝนการพัฒนาจิตใจผ่านการชมภาพยนตร์โดยเน้นความซาบซึ้งใจในความงดงาม ของสิ่งต่าง ๆ และชมภาพยนตร์เพื่อความเข้าใจในแง่การสื่อความหมายทางด้านศิลปะ วัฒนธรรม สังคม การเมือง และวิถีชีวิต ผ่านการ เล่าเรื่องในเชิงสร้างสรรค์จากภาพยนตร์ในประเภทต่างๆ",
    "description-en": "Learn and practice the process of mental development through films with an emphasis on positive attitudes or feelings of appreciation on things, and learn to understand the messages behind a variety of creative stories in films especially in dimensions of arts, culture, society, politics and ways of life."
  },
  {
    "id": "90642084",
    "name-th": "สุนทรียะภาพถ่าย",
    "name-en": "PHOTOGRAPHY APPRECIATION",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาเรื่องหลักเกณฑ์การถ่ายภาพเพื่อให้เห็นความงามของภาพที่ถ่าย การใช้อุปกรณ์และเทคนิคต่างๆ การ เรียนรู้กระบวนการเพื่อให้ได้รูปถ่ายที่มีคุณค่าในแง่มุมต่างๆ และความซาบซึ้งในการพิจารณาและวิจารณ์รูปถ่าย",
    "description-en": "Understand the principles of taking photographs for appreciation and practice to use equipment and techniques. Learn to show appreciation for the values of pictures taken as well as give valuable and critical comments for pictures."
  },
  {
    "id": "90642085",
    "name-th": "วัฒนธรรมร่วมสมัย",
    "name-en": "CONTEMPORARY CULTURE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิดของพหุวัฒนธรรม วิเคราะห์ปรากฏการณ์ร่วมสมัย โครงสร้างของวัฒนธรรมทั้งระดับสังคมไทย และสังคมโลก วิเคราะห์ความสัมพันธ์และความต่างทางวัฒนธรรม",
    "description-en": "Study the concepts of multiculturalism and analyze the contemporary phenomenon, the structure of Thai and world cultures including similarities and differences of such cultures."
  },
  {
    "id": "90642086",
    "name-th": "วัฒนธรรมการออกแบบเบื้องต้น",
    "name-en": "INTRODUCTION TO DESIGN CULTURE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "รายวิชานี้มุ้งเน้นให้ผู้เรียนศึกษาและเข้าใจสาขาการออกแบบในเชิงวัฒนธรรม บนความสัมพันธ์ที่มีต่อสาขาอื่น ในลักษณะพหุนิยม อาทิ สังคมศาสตร์ เศรษฐศาสตร์ วิทยาศาสตร์เทคโนโลยี โดยถูกออกแบบมาในลักษณะของการศึกษา ประเด็นของการข้ามวัฒนธรรม (cross cultural issues) ผ่านประวัติศาสตร์ร่วมสมัย เพื่อผู้เรียนได้เรียนรู้ถึงเหตุปัจจัยที่ทำให้ การออกแบบมีความสำคัญต่อการพัฒนาคุณภาพชีวิต การสร้างความยั่งยืน และการรับผิดชอบต่อสังคม",
    "description-en": "This course emphasizes student on the studying and understanding cultural design field in relation to other areas in pluralism e.g. social science, economics, and science and technology. It is designed in the aspect of cross-cultural issues studying through contemporary history. Students are capable of learning factors that influence the importance of design toward quality of life development, sustainability building, and social responsibility."
  },
  {
    "id": "90642087",
    "name-th": "วัฒนธรรมรอบโลก",
    "name-en": "WORLD CULTURE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ประวัติศาสตร์อารยธรรมมนุษย์ วัฒนธรรมและปรัชญาตะวันตก วัฒนธรรมและปรัชญาตะวันออก: ประวัติศาสตร์วัฒนธรรมและปรัชญาไทย องค์กรระหว่างประเทศด้านความร่วมมือ กฎหมายและกฎระเบียบ พหุวัฒนธรรมใน ประเทศไทยและภูมิภาคอาเซียน ผลกระทบของโลกต่อวัฒนธรรมและการพัฒนาเศรษฐกิจของสังคม",
    "description-en": "History of human civilization; western culture and philosophy; eastern culture and philosophy: Thai history, culture and philosophy; international organization, collaboration, law and regulation; multiculturalism in Thailand and ASEAN region; effects of globalization on culture and socioeconomic development."
  },
  {
    "id": "90642088",
    "name-th": "วัฒนธรรมจีนดั้งเดิม",
    "name-en": "TRADITIONAL CHINESE CULTURE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเกี่ยวกับวัฒนธรรมจีนโบราณซึ่งรวมถึงแฟชั่นโบราณ อาหาร และด้านบันเทิงต่างๆเป็นต้น",
    "description-en": "Study and appreciate traditional Chinese culture including fashion, food and entertainment in order to appreciate the charming of Chinese culture."
  },
  {
    "id": "90642089",
    "name-th": "สังคมเศรษฐกิจ และการเมืองจีน",
    "name-en": "CHINESE SOCIETY, ECONOMY AND POLITICS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและวิเคราะห์สังคม เศรษฐกิจและการเมืองจีน เน้นการอ่านวิเคราะห์เพื่ออภิปราย เปรียบเทียบ กับ เศรษฐกิจและการเมืองไทย",
    "description-en": "Study and analyze Chinese society, economy and politics in order to understand Chinese influences on world society."
  },
  {
    "id": "90642090",
    "name-th": "เจาะลึกประเด็นโลก",
    "name-en": "GLOBAL INSIDE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาประเด็นสำคัญของโลก พร้อมผลกระทบที่มีต่อสังคมโลก โดยเฉพาะอย่างยิ่งต่อประเทศไทย ศึกษาและ วิเคราะห์บทบาทของปัจจัยภูมิรัฐศาสตร์ บทบาทขององค์การระหว่างประเทศ ความขัดแย้งรูปแบบต่างๆ อิทธิพลของประเทศ มหาอำนาจ เป้าหมายการพัฒนาที่ยั่งยืน (SDGs) และผลกระทบในด้านต่างๆ Study the major global issues and their impacts on the world’s society especially in Thailand.",
    "description-en": "Study and analyze the roles of geo-politic factors, the role of international organizations, conflicts, the influence of powerful nations as well as Sustainable Development Goals (SDGs) and their impacts."
  },
  {
    "id": "90642091",
    "name-th": "เอเชียนศึกษา",
    "name-en": "ASIAN STUDY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาวัฒนธรรม ภาษา และอัตลักษณ์ของประเทศในเอเชีย โดยเน้นการแสดงความคิดเห็นและวิเคราะห์การ เปลี่ยนแปลงและการพัฒนาในด้านเศรษฐกิจ วัฒนธรรม และสังคม รวมถึงความสัมพันธ์ระหว่างประเทศ",
    "description-en": "This course covers a study of an Asian country’s language, social identity and culture. The course will discuss development and evolution of an Asian country, their economic prospect, cultural settings, societies and relations to the society and cultures of other countries."
  },
  {
    "id": "90642092",
    "name-th": "การศึกษาเพื่อสร้างพลเมือง",
    "name-en": "CIVIC EDUCATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิดพื้นฐานของความเป็นพลเมือง สิทธิและหน้าที่ กฎหมายพื้นฐานในชีวิตประจำวัน ฝึกกิจกรรมการ สร้างสำนึกพลเมือง การส่งเสริมการมีส่วนร่วมทางการเมือง เพื่อนำไปสู่การสร้างสรรค์นวัตกรรมการศึกษาสำหรับการสร้าง พลเมืองในศตวรรษที่ 21 ภายใต้คำแนะนำและการดูแลอย่างใกล้ชิด Study the fundamental concepts of citizenship, civil rights and responsibility, Fundamental laws",
    "description-en": "for daily life, and practice several activities to enhance their civic consciousness to promote role of participation in politics."
  },
  {
    "id": "90642093",
    "name-th": "สานสัมพันธ์กับชุมชน",
    "name-en": "COMMUNITY ENGAGEMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิดการมีส่วนร่วมในสังคมชุมชน รูปแบบ บทบาทของแต่ละบุคคลที่มีต่อผู้อื่น รวมทั้งศึกษา กระบวนการที่จะเอื้อต่อการสื่อสารและการสร้างปฏิสัมพันธ์ การมีส่วนร่วมของชุมชน การฝึกปฏิบัติในการสร้างความร่วมมือ ให้แก่ชุมชน",
    "description-en": "Concept of community engagement; context, pattern, role of individual to others, process that facilitates communication and interaction; community involvement, embedding community engagement workshop."
  },
  {
    "id": "90642094",
    "name-th": "หลักการพัฒนาชุมชน",
    "name-en": "PRINCIPLES OF COMMUNITY DEVELOPMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาถึงความหมาย วัตถุประสงค์ ความสำคัญ หลักการ และความเป็นมาของการพัฒนาชุมชน แนวคิดการ พัฒนาชุมชน และความต้องการของชุมชนเมืองและชุมชนชนบท รวมถึงเทคนิคการพัฒนาชุมชนเพื่อดำเนินโครงการพัฒนา ระหว่างวัฒนธรรมของชุมชน การบริหารการพัฒนาชุมชน แผนพัฒนาเศรษฐกิจและสังคมแห่งชาติ การพัฒนาชุมชนใน ประเทศไทย ปัญหาและอุปสรรคของชุมชน",
    "description-en": "A study of meaning, objectives, significance, principles and history of community development, concepts of community development, kinds and demand of urban and rural commu-nities, methods and techniques of community development, implementation of community intercultural development projects, administration of community development, the National Economic and Social Development Plans, community development in Thailand, problems and obstacles."
  },
  {
    "id": "90642095",
    "name-th": "การพัฒนาความมั่นคงแห่งชาติ",
    "name-en": "NATIONAL SECURITY DEVELOPMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาองค์ประกอบความมั่นคงแห่งชาติ วิวัฒนาการด้าน ความมั่นคงของชาติไทย ความมั่นคง แห่งชาติทั้ง ด้านการเมือง ด้านเศรษฐกิจ สั งคมจิตวิทยา การป้องกันประเทศ ด้านวิทยาศาสตร์ เทคโนโลยีการพลังงาน ทรัพยากรธรรมชาติและสิ่งแวดล้อม และเรียนรู้บทบาทของคนไทยในการพัฒนาประเทศ แนวทางบูรณาการปรัชญาของ เศรษฐกิจพอเพียงกับการพัฒนาความมั่นคงแห่งชาติ",
    "description-en": "Study the components of national security and revolution of national and political Security along with politics, economy, sociology, national defense on technological science, energy, natural resources and environment, and learn the roles of Thai citizens for country development, guidelines for integrating Sufficiency Economy Philosophy with national security development."
  },
  {
    "id": "90642096",
    "name-th": "วิทยาการทางทหาร",
    "name-en": "MILITARY SCIENCE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "วิวัฒนาการทหารและความสัมพันธ์ระหว่างพลเรือนกับทหาร ยุทธศาสตร์ชาติ กำลังอำนาจแห่งชาติภารกิจ การจัด และการดำเนินงานทางทหาร กองทัพบก กองทัพเรือ กองทัพอากาศ การจัดฝ่ายอำนวยการทางทหาร การกำลัง สำรอง บทบาทของพลเรือนในการป้องกันประเทศ รวมถึงพัฒนาการเทคโนโลยีทางทหาร",
    "description-en": "Study evolution of military science and its relations to the public. Military strategies, national security, missions, and military management. Army, Marines, Airforce, Military Management and Administration, and Military Reserves. Public duty on the national security along with military technology development."
  },
  {
    "id": "90642097",
    "name-th": "ภูมิปัญญาไทยประยุกต์",
    "name-en": "APPLIED THAI WISDOMS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ และตระหนักถึงคุณค่าภูมิปัญญาไทย ความภาคภูมิใจในความเป็นไทย ภูมิปัญญาไทยกับพัฒนาการ ของชุมชน การแสวงหาองค์ความรู้ในภูมิปัญญาท้องถิ่น ให้สามารถนำไปประยุกต์ใช้เป็นแนวทางสำหรับพัฒนางานให้มี เอกลักษณ์ และเพิ่มมูลค่าแก่ชุมชนและเหมาะสมกับกระแสการเปลี่ยนอันเนื่องมาจากการเจริญของสังคมได้อย่างยั่งยืน ผลกระทบทางสังคมและกระแสโลกาภิวัตน์ต่อภูมิปัญญา",
    "description-en": "Learn to recognize and appreciate the values of Thai wisdoms. Explore the relation of Thai wisdom and community development and study the knowledge based on Thai local wisdoms as guidelines for developing the later workpieces for uniqueness and suitability. Explore the effects of changes in society and globalization that can affect Thai local wisdoms."
  },
  {
    "id": "90642098",
    "name-th": "พลวัตสังคมไทย",
    "name-en": "DYNAMICS OF THAI SOCIETY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ลักษณะทั่วไปและโครงสร้างของสังคมไทย การเมืองปกครองของไทย ศาสนาและความเชื่อของสังคมไทย ลักษณะของครอบครัวและเครือญาติในสังคมไทย พิธีกรรมและประเพณีไทย การเปลี่ยนแปลงและปัญหาในสังคมไทย ภูมิ ปัญญาไทยและภูมิปัญญาท้องถิ่น แนวคิดและวิสัยทัศน์ทางเศรษฐกิจ สังคม และการเมืองไทย",
    "description-en": "General characteristics and structure of Thai society; Thai political and government system; religion and beliefs in Thai society; features of Thai family members and relatives; rituals and traditions in Thailand; changes and problems in Thai society; Thai wisdom and Thai local wisdom; concepts and visions of Thai economy, Thai society and Thai politics."
  },
  {
    "id": "90642099",
    "name-th": "สังคมสูงวัยเชิงรุก",
    "name-en": "ACTIVE AGING SOCIETY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การเตรียมตัวสำหรับคนต่างรุ่น ในการเข้าสู่วัยสูงอายุ และสังคมสูงวัยอย่างสมบูรณ์ของประเทศไทย และ สังคมโลก เข้าใจแนวคิดสูงวัยเชิงรุก (Active Aging) ซึ่งเป็นกรอบแนวนโยบายที่สร้างโดยองค์การอนามัยโลก ที่มุ่งเน้นใน ด้านสุขภาพกายและจิตที่ดี การมีความมั่นคงทางเศรษฐกิจและครอบครัว และการมีส่วนร่วมในสังคม เพื่อให้ผู้สูงอายุ และ คนต่างรุ่นได้อยู่ร่วมกันอย่างมีความสุขในสังคมสูงวัยและสังคมสูงวัยอย่างสมบูรณ์ในอนาคต",
    "description-en": "Preparation for a different generation to enter the old age and the completed Aged society of Thailand and the world. Understanding the Active Aging: A Policy Framework which proposed by World Health Organization. This approach focus on physical and mental health, security of economics and family, and social participation for elderly and other generations to live happily together in Aging and aged society."
  },
  {
    "id": "90642101",
    "name-th": "นักรีวิว",
    "name-en": "REVIEWER",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "พัฒนาทักษะการรีวิวเพื่อเรียนรู้วิถีแห่งสังคม และชุมชน โดยใช้กระบวนการรีวิวที่เป็นระบบ ชัดเจน ถูกต้อง น่าเชื่อถือ และตรวจสอบได้ และเรียนรู้วิธีการค้นหาและเปรียบเทียบข้อมูลสิ่งต่าง ๆที่อยู่รอบๆตัวผู้เรียน ทักษะการคิดเชิง วิพากษ์ และการสื่อสารและประเมินสารสนเทศก่อนรีวิว",
    "description-en": "Develop reviewing skills for societal and community learnings by applying a systematic and transparent reviewing process with an emphasis on correctness, credibility, and accessibility, and learn the process of discovery and comparison of information around us, critical thinking and critique skills, and the process of communication and evaluation of information technology prior to review."
  },
  {
    "id": "90642102",
    "name-th": "นักสื่อสารผ่านยูทูบ",
    "name-en": "YOUTUBER",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และทำความเข้าใจการใช้เทคโนโลยีดิจิทัลอย่างสร้างสรรค์ ประยุกต์เทคโนโลยีดิจิทัลเพื่อการสร้างงาน โดยการเป็น Youtuber ทำความเข้าใจเกี่ยวกับการเป็น YouTuber วิธีการใช้งาน การสร้าง channel หรือช่องทางของ ตนเองผ่านทาง YouTube แนวคิดในการสร้าง content หรือเนื้อหาอย่างแตกต่างและสร้างสรรค์ การเขียนสคลิป การถ่าย วีดิโอ การตัดต่อภาพและเสียง เทคนิคการเพิ่มยอดติดตาม (Subscribe) รวมถึงการหารายได้จาก Youtube Learn how to use YouTube creatively for creating a job and learn how to use YouTube wisely",
    "description-en": "and create cool contents, write scripts and shoot videos, and learn audio and video editing techniques to increase your followers as well as earn money from YouTube."
  },
  {
    "id": "90642103",
    "name-th": "การดำรงชีพในสังคมดิจิทัล",
    "name-en": "LIVING IN DIGITAL SOCIETY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเกี่ยวกับการใช้ชีวิตในสังคมดิจิทัล ความสำคัญของข้อมูลสารสนเทศ การเข้าถึงแหล่งข้อมูลการพัฒนา ทักษะในการสืบค้นและอ้างอิงข้อมูล การใช้และจัดการสารสนเทศได้อย่างถูกต้องและมีประสิทธิภาพการนำเสนออย่าง สร้างสรรค์ และมีวิจารณญาณ ตระหนักในจรรยาบรรณและผลกระทบที่มีต่อบุคคลและสังคมรวมทั้งกฎหมายที่เกี่ยวข้อง",
    "description-en": "Study the life patterns in digital society, importance of ICT data, access to sources, development of searching and referencing skills, appropriate use of ICT as well as creative presentation. Study the computer crime act and follow with discretion and ethics."
  },
  {
    "id": "90642106",
    "name-th": "เล่าเรื่องการเดินทางแบบดิจิทัล",
    "name-en": "DIGITAL STORYTELLING IN JOURNEY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้กระบวนการคิดเชิงออกแบบเพื่อสร้างสรรค์การเล่าเรื่องแบบดิจิทัลด้วยการระดมสมอง การวางแผนการ เล่าเรื่อง การออกแบบเรื่องราว การเลือกสื่อในการนำเสนอเพื่อแบ่งปันเรื่องราวต่างๆ ในชีวิตและสะท้อนคิดผลจากการเรียนรู้ ผ่านการสร้างสรรค์ผลงานการเล่าเรื่องแบบดิจิทัลที่มีเทคโนโลยีเข้ามาเกี่ยวข้อง ทำให้ผู้เรียนเป็นคนช่างสังเกต มีมุมมองการใช้ ชีวิต และมีทักษะการเล่าเรื่องแบบดิจิทัล",
    "description-en": "Learn to use design thinking processes as a tool to design and create your own digital story telling by brainstorming planning design stories and choose proper media to present their stories and reflect knowledge and experience. Sharing and learning in the workshop project."
  },
  {
    "id": "90642107",
    "name-th": "การผลิตสื่อดิจิทัล",
    "name-en": "DIGITAL MEDIA PRODUCTION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การฝึกทักษะในการผลิตสื่อดิจิทัลโดยเน้นการสร้างไอเดียด้วยหลักการวิเคราะห์ข้อมูล หลักการนำเสนอแบบ เรื่องเล่า (story telling) การออกแบบและสร้างสื่อประเภทต่างๆ การนำเสนอในรูปแบบกราฟฟิกและวีดีโอผ่านช่องทาง ต่างๆ ทั้งแบบ off-line, online และ Social Media Practice digital media production skills focusing on the topics of idea creation through data",
    "description-en": "analytics, story telling techniques. Learn to design and produce several types of media, and present contents by using graphics and video for offline and online channels including social media."
  },
  {
    "id": "90642108",
    "name-th": "เทคโนโลยีการถ่ายภาพดิจิทัล",
    "name-en": "DIGITAL PHOTOGRAPHY TECHNOLOGY",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาความเป็นมาและการพัฒนาการของการถ่ายภาพ ส่วนประกอบและหลักการทำงานของกล้องถ่ายภาพ ดิจิทัล หลักการถ่ายภาพ อุปกรณ์การถ่ายภาพ การจัดองค์ประกอบ เทคนิคการถ่ายภาพแบบต่าง ๆ การจัดแสงเพื่อการ ถ่ายภาพ การจัดการภาพถ่ายดิจิทัล",
    "description-en": "Studying the background and development of photography. Components and working principles of digital cameras. Principles of photography ,Photography equipment, Various imaging techniques. Lighting for photography Digital photo management."
  },
  {
    "id": "90642109",
    "name-th": "การออกแบบอินโฟกราฟิก",
    "name-en": "INFOGRAPHIC DESIGN",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้การนำเสนอเนื้อหาในรูปแบบอินโฟกราฟฟิก และการใช้เครื่องมือ POWERPOINT ในการนำเสนอให้น่า ดึงดูดและน่าสนใจ เรียนรู้ทักษะการสร้างอินโฟกราฟิกอย่างมีประสิทธิภาพ เน้นเข้าใจทฤษฎีการใช้สี การจัดวางข้อมูล และ เครื่องมือต่างๆ ในการออกแบบและสร้างชิ้นงาน",
    "description-en": "Learn the process of presenting in format of infographic, and PowerPoint to attract the audiences. Learn the skills of establishing infographic for communicating subject to the target group and learn the use of colors, data arrangements and tools for building the media."
  },
  {
    "id": "90642110",
    "name-th": "สนุกกับวิทยาศาสตร์ข้อมูล",
    "name-en": "FUN WITH DATA SCIENCE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความสำคัญ หลักการ กระบวนการของวิทยาการข้อมูล การเตรียมข้อมูล วิทยาการวิเคราะห์ ข้อมูล แบบจำลองพยากรณ์ การแบ่งประเภท การแบ่งกลุ่ม การอนุมานเชิงสถิติ การถดถอยการวิเคราะห์เครือข่ายสังคม ข้อมูล ขนาดใหญ่ โดยมุ่งเน้นการนำข้อมูลรอบตัวในชีวิตประจำวันมาประยุกต์ใช้ให้เกิดประโยชน์ได้จริง",
    "description-en": "Study importance, principles, and process of data science including the topics of data preparation, data analytics predictive models, classification, clustering, statistical inference, regression, social network analytics, and big data, focusing applications of data in daily life."
  },
  {
    "id": "90642111",
    "name-th": "สนุกกับการเขียนโค้ด",
    "name-en": "FUN WITH CODING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การแก้ปัญหาอย่างเป็นระบบ การสร้างอัลกอริทึมเพื่อการเขียนโปรแกรม การวิเคราะห์และออกแบบขั้นตอนวิธี ในการแก้ปัญหาทางคอมพิวเตอร์โดยใช้ผังงานและรหัสเทียม การเขียน การทดสอบ การแก้ปัญหาข้อผิดพลาดในการเขียน โปรแกรมคอมพิวเตอร์ การเขียนเอกสารประกอบโปรแกรม โครงสร้างข้อมูลพื้นฐาน ตัวแปร นิพจน์ ข้อความสั่งและโครงสร้าง ควบคุมในการโปรแกรม เช่น การกําหนดค่า การดําเนินงานแบบมีเงื่อนไข การดําเนินงานแบบลูป โปรแกรมย่อยและ พารามิเตอร์",
    "description-en": "Systematic problem solving; algorithms for programming; analyzing and developing algorithms to solve computer problems using flow charts and pseudocode; writing, testing and debugging the program; program documentation; basic data structure; variables; expressions; statements and control structures such as the use of sequential, selection and repetition control structures; subprograms and parameters."
  },
  {
    "id": "90642112",
    "name-th": "สนุกกับปัญญาประดิษฐ์",
    "name-en": "FUN WITH AI",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ประยุกต์ใช้ปัญญาประดิษฐ์ที่เกี่ยวข้องในชีวิตประจำวัน ประโยชน์ของการนำมาใช้คาดเดาและ วิเคราะห์ พฤติกรรมผู้บริโภคจากโซเชียลมีเดีย ธุรกิจสินค้าออนไลน์ และการควบคุมการทำงานของหุ่นยนต์โดยมุ่งเน้นให้นักศึกษาสนุก ไปกับเกมส์ที่เล่นแข่งขันกับชุดปัญญาประดิษฐ์ในบริบทต่างๆ และการทำโครงงานจากการใช้ CLOUD PLATFORM ใน เบื้องต้น",
    "description-en": "Learn how to apply Artificial Intelligence (AI) system in our daily life, the benefit of its usage on predictions and analysis of consumer behaviors from social media, online business and robotic control, and focus on the joy of game playing with AI in various contexts as well as practice of the project based on basic Cloud Platform."
  },
  {
    "id": "90642113",
    "name-th": "หุ่นยนต์และปัญญาประดิษฐ์",
    "name-en": "ROBOTICS AND AI",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ความหมาย และความแตกต่างของหุ่นยนต์และปัญญาประดิษฐ์ การใช้หุ่นยนต์ในสายงานเทคโนโลยีต่างๆ ที่เกี่ยวข้องกับชีวิตประจำวันและการทำงาน เช่น การใช้งานในโรงงานอุตสาหกรรม การใช้งานทางด้านสาธารณสุข การใช้งาน ด้านการเกษตร และอาหาร การใช้งานในบ้าน การใช้เพื่อการบันเทิง การใช้งานในยานพาหนะ การใช้งานด้านการศึกษา แนว ทางการใช้หุ่นยนต์ในอนาคต และผลกระทบของการใช้หุ่นยนต์ต่อการใช้ชีวิตประจำวันและระบบเศรษฐกิจ",
    "description-en": "Study the definition and difference of robotics and artificial intelligence, the use of the robot in key technologies related to daily life and working style such as robots in factories, robots in healthcare, robots on the farm and food, robots at home, entertainment robots, robots that drive and robots at education, the various aspects of future robotics usage and impact of our daily life and the economy."
  },
  {
    "id": "90642114",
    "name-th": "ฟาร์มอัจฉริยะ",
    "name-en": "SMART FARMING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิดแบบใหม่ของการจัดการการเกษตรหรือเรียกว่า ระบบการเกษตรอัจฉริยะซึ่งใช้เทคโนโลยีไอซีทีที่ ทันสมัย พร้อมระบบเซ็นเซอร์ในการผลิตพืชและปศุสัตว์โดยเน้นกระบวนการควบคุม และป้องกันการสูญเสียในกระบวนการ ผลิตเพื่อให้ได้ผลผลิตที่คุ้มค่าที่สุด",
    "description-en": "Study a new concept of farm management, so called precision agriculture system or smart farming with the use of modern ICT technology and a sensor network for crop and livestock production system including monitoring process and waste control to achieve the maximum productivity with minimum cost."
  },
  {
    "id": "90642115",
    "name-th": "เทคโนโลยีสีเขียวและพลังงานทดแทน",
    "name-en": "GREEN TECHNOLOGY AND ALTERNATIVE ENERGY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาถึงสถานการณ์พลังงานของโลกและปัญหาพลังงาน แหล่งพลังงานจากเชื้อเพลิง ฟอสซิล เช่น น้ำมัน ปิโตรเลียม ถ่านหิน ก๊าซธรรมชาติ แหล่งพลังงานทดแทน ได้แก่ พลังงาน แสงอาทิตย์ พลังงานลม พลังงานน้ำพลังงานความ ร้อนใต้พิภพ พลังงานนิวเคลียร์ เซลล์เชื้อเพลิง พลังงานชีวมวลจากวัสดุเหลือใช้ทางการเกษตร อุตสาหกรรม คุณสมบัติชีวมวล วิธีการสำรวจ การ ประเมินศักยภาพ พืชพลังงาน การประยุกต์ใช้งานระบบพลังงาน",
    "description-en": "World energy status and challenge obstacles. Conventional energy resources : petroleum oil, coal and natural gas. Renewable energy resources : solar, wind, hydro, geothermal, nuclear energy, fuel cell, biomass, Biomass properties, survey, potential evaluation, energy crops and energy system application."
  },
  {
    "id": "90642116",
    "name-th": "เมืองอัจฉริยะและนวัตกรรมเมือง",
    "name-en": "SMART CITY AND CITY INNOVATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้แนวคิด การวางผัง ออกแบบและบริหารจัดการเมืองอัจฉริยะ รวมทั้งฝึกทักษะการออกแบบและพัฒนา นวัตกรรมเมืองให้สอดคล้องกับบริบททางกายภาพ เศรษฐกิจสังคม การเมือง เทคโนโลยีและสิ่งแวดล้อมของเมืองอย่างยั่งยืน",
    "description-en": "Learn Smart City concept, planning, designing, and management. Practice city innovation designing and development skills based on physical, socioeconomic, political, technological, and environmental contexts for sustainability."
  },
  {
    "id": "90642117",
    "name-th": "ทักษะการรู้สารสนเทศแห่งศตวรรษที่ 21",
    "name-en": "INFORMATION LITERACY SKILLS FOR THE 21st CENTURY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้แนวคิดและความสำคัญของสารสนเทศในศตวรรษที่ 21 แหล่งทรัพยากรเพื่อการเรียนรู้สารสนเทศ การ จัดเก็บทรัพยากรสารสนเทศ การสืบค้นสารสนเทศ การคัดเลือกแหล่งสารสนเทศ การประเมินคุณค่าของสารสนเทศ การ วิเคราะห์และสังเคราะห์สารสนเทศ การเรียบเรียงและนำเสนอสารสนเทศในรูปแบบต่างๆ รูปแบบการอ้างอิงเอกสารตามหลัก สากลในงานเขียนเชิงวิชาการและการโจรกรรมทางวรรณกรรม",
    "description-en": "Learn concepts and importance of information in the 21st century, information literacy resources, information resource storage, information retrieval, selecting sources of information, evaluation of information values, analyzing and synthesizing information, information composition and presentation in various formats, international citation styles used in academic writing, and plagiarism."
  },
  {
    "id": "90642118",
    "name-th": "โปรแกรมคอมพิวเตอร์ประยุกต์ทางธุรกิจ",
    "name-en": "APPLICATION SOFTWARE FOR BUSSINESS",
    "credits": "2 (1-2-3)",
    "prerequisite": null,
    "description-th": "การใช้โปรแกรมคอมพิวเตอร์สำเร็จรูปในงานธุรกิจประเภทต่างๆ ได้แก่ การทำเอกสาร การทำรายงาน การสร้าง แบบฟอร์ม การเก็บข้อมูล การวิเคราะห์ข้อมูล การแสดงข้อมูล การนำเสนอ แนะนำการลงทุนในหุ้นและโปรแกรมสำเร็จรูป เพื่อการลงทุนในหุ้น",
    "description-en": "Application software for business including creating document, report and form; data collection; data analytics; data visualization and presentation, introduction to stock trading and application software for stock trading."
  },
  {
    "id": "90642120",
    "name-th": "เอ็กเซลเพื่อความเป็นมืออาชีพ",
    "name-en": "FROM EXCEL TO EXCELLENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ความรู้ทั่วไปเกี่ยวกับคําสั่งและฟังชันก์ของโปรแกรมสําเร็จรูปประเภทเสปรดชีต เพื่อจัดการข้อมูลวิจัย การเรียบ เรียงข้อมูล การประมวลผลข้อมูล การคํานวณและวิเคราะห์ข้อมูลทางสถิติเบื้องต้น",
    "description-en": "Basic concepts of commands and functions in spreadsheet to manage data, collect data, process data, calculate and analyze data with elementary statistics."
  },
  {
    "id": "90642121",
    "name-th": "การวิเคราะห์และจัดการข้อมูลด้วยโปรแกรมคอมพิวเตอร์",
    "name-en": "DATA ANALYSIS AND MANAGEMENT WITH COMPUTATIONAL PROGRAM",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การประยุกต์ใช้คำสั่งและการทำงานของโปรแกรมสเปรดชีตยอดนิยมเช่น Microsoft Excel เพื่อจัดการข้อมูล ดิบ การทดลอง การประมวลผลข้อมูล การรวบรวมข้อมูล การคำนวณและวิเคราะห์ข้อมูลทางสถิติพื้นฐาน ตลอดจน การ นำเสนอข้อมูลด้วยโปรแกรมพื้นฐานเช่น Microsoft Power Point",
    "description-en": "Application of command and functionality of popular spreadsheet program such as Microsoft Excel to manage raw experimental data, data processing, data compilation, basic statistical data calculation and analysis as well as data presentation by basic program such as Microsoft Power Point."
  },
  {
    "id": "90642122",
    "name-th": "การใช้แอปพลิเคชันไมโครคอมพิวเตอร์",
    "name-en": "INTRODUCTION TO MICROCOMPUTER APPLICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาโครงสร้ างและคุณลั กษณะเฉพาะของไมโครคอมพิวเตอร์ เทคนิคการประยุกต์ใช้เทคโนโลยี ไมโครคอมพิวเตอร์ การใช้ซอฟท์แวร์ที่จำเป็นต่างๆ ในตระกูลไมโครซอฟท์ และระบบการจัดการฐานข้อมูล เป็นต้น รวมทั้ง เรียนรู้เทคโนโลยียุคปัจจุบันรวมถึงแนวโน้มของการใช้ไมโครคอมพิวเตอร์สำหรับอนาคต",
    "description-en": "Structure and characteristics of microcomputers, and the techniques of applying microcomputer technology, focus on software packages such as word processing, spreadsheet, database management systems, etc. The course will cover current technologies as well as future trends."
  },
  {
    "id": "90642123",
    "name-th": "เทคโนโลยีคอมพิวเตอร์ดนตรี",
    "name-en": "TECHNOLOGY IN MUSICAL SEQUENCING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนการเขียนภาษาคอมพิวเตอร์ที่เกี่ยวข้องกับการผลิตดนตรี อาทิ มิดี มิวสิค เอ๊กซ์เอ็มเอล เมค เอ็ม เอสพี การ ใช้ซีควินเซอร์ พื้นฐานการใช้งาน โปรแกรมผลิตดนตรี ประเภทต่างๆ ศึกษาแนวคิดและวิวัฒนาการ การใช้คอมพิวเตอร์ ใน การแสดงและผลิตดนตรี",
    "description-en": "Study computer programing related to the music production such as MIDI Music XML Max MSP. Study basic use of sequencer and music production software. study concept and evolution of computer application in music."
  },
  {
    "id": "90642124",
    "name-th": "เทคโนโลยีและนวัตกรรมทางวิทยาศาสตร์สำหรั SDGsบ",
    "name-en": "SCIENCE TECHNOLOGY AND SCIENCE INNOVATION FOR SDGS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมาย แนวคิด และบทบาทของเทคโนโลยีและนวัตกรรมต่อการสร้างสรรค์ที่ยั่งยืนและผลกระทบ ต่อสังคมและความเป็นมนุษย์ รวมถึงนโยบาย กลยุทธ์ เครื่องมือสำหรับการสังเคราะห์และพัฒนาเทคโนโลยีและนวัตกรรม เพื่อเสริมสร้างความแข็งแกร่งในเชิงเศรษฐกิจและสังคมฐานปัญญา ตลอดจน จริยธรรมในการบริหาร จัดการ การใช้ ประโยชน์ และการคุ้มครองทรัพย์สินทางปัญญาที่เกิดจากเทคโนโลยีและนวัตกรรม",
    "description-en": "This course is the study of the definitions, concepts and roles of science technology and innovation for SDGs to creation of wealth, and their impact on society and humanity. The course will explore the policies, strategies, and tools for synthesizing and developing technology and innovation for a wisdom-based society together with ethics in management. Students will study the exploitation and protection of intellectual property as a result of science technology and innovation for SDGs."
  },
  {
    "id": "90642125",
    "name-th": "การดำรงชีพท่ามกลางภัยพิบัติและวิกฤติในอนาคต",
    "name-en": "LIVING IN FUTURE DISASTER AND CRISIS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เข้าใจรูปแบบของภัยพิบัติ วิกฤติ หลักการเพื่อการอยู่รอด ปัจจัยที่เกี่ยวข้องและผลกระทบเพื่อการอยู่รอดทั้ง ในสถานการณ์ปกติ และสถานการณ์วิกฤติ วิเคราะห์กรณีศึกษาต่างๆที่เกิดขึ้น ฝึกทักษะการคิดและนำเสนอผลงานที่ สามารถใช้เพื่อการดำรงชีพท่ามกลางภัยพิบัติและวิกฤติในอนาคต",
    "description-en": "Understand types of disasters, crisis principles of thinking for survival, factors and effects of survival in either normal or critical situations. Analyze the case studies and practice thinking skills in various types and presentation skills for sharing ideas."
  },
  {
    "id": "90642126",
    "name-th": "วิชาเอาตัวรอด",
    "name-en": "SURVIVORS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาปัจจัยเสี่ยงต่อการดำรงชีวิตในอดีต ปัจจุบัน และอนาคต การวิเคราะห์ทักษะการดำรงชีวิตเชิงกลยุทธ์ เพื่อการจัดลำดับความต้องการจำเป็นในการดำรงชีวิตอย่างมีคุณภาพในแต่ละช่วงวัย การแก้ไขผลกระทบเชิงลบในอดีต การส่งเสริมการใช้ชีวิตในปัจจุบันอย่างมีคุณภาพ การวางแผนการดำรงชีวิตในอนาคตการออกแบบชีวิต การสร้างภูมิคุ้มกัน ชีวิต การออกแบบแผนการดำรงชีวิตอย่างไม่ประมาท บนพื้นฐานของหลักการและสถิติอย่างเป็นเหตุเป็นผลและเป็นระบบ",
    "description-en": "Study risks factors on living in the past, present, and future, analyze strategic living skills for prioritization of issues concerning healthy living in all stages of life, and corrections of negative impacts on life in the past, promotion of healthy living in the present, planning of future living, life design, development of immunization for life, and design of a fool-proof living plan on a basis of statistical and cause-and-effect principles."
  },
  {
    "id": "90642127",
    "name-th": "รักษ์โลก",
    "name-en": "THINK EARTH",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความสำคัญของการกระตุ้นความคิดและความสำนึกในการอนุรักษ์สิ่งแวดล้อมที่มีต่อคุณภาพชีวิต การศึกษาผลกระทบจากพฤติกรรมของมนุษย์ทั้งทางบวกและลบต่อทรัพยากรธรรมชาติและสิ่งแวดล้อม การคิดวิเคราะห์ เพื่อหาแนวทางการจัดการสิ่งแวดล้อมและการพัฒนาทรัพยากรธรรมชาติ การคิดอย่างเป็นระบบ และการวิเคราะห์ความ เหมาะสมโดยใช้เครื่องมือช่วยคิดแบบต่างๆ",
    "description-en": "Study the importance of raising awareness and concerns of environmental conservation for better quality of life. Study both positive and negative impacts of human behaviors on natural resources and environment. Use analytical thinking and systematic thinking approaches to find alternatives of environmental conservation and natural resources development. Learn how to analyze with thinking tools."
  },
  {
    "id": "90642128",
    "name-th": "นิเวศวิทยาและการรักษาสิ่งแวดล้อม",
    "name-en": "ECOLOGY, CONSERVATION AND ENVIRONMENTALISM",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้เรื่องผลผลิตทางชีวภาพในระบบนิเวศและการจำกัดผลผลิตและการก่อกวนปฏิสัมพันธ์ระหว่างสิ่งมีชีวิต ปัจจัยในการเติบโตของประชากรและความสมดุลของระบบนิเวศกิจกรรมการปกป้องสิ่งแวดล้อมจากมลภาวะหรือการ ทำลายล้างเกี่ยวกับการอนุรักษ์การปรับปรุงและความยั่งยืนของทรัพยากรธรรมชาติ",
    "description-en": "Biological productivity in ecosystem and limiting productivity and perturbation, interaction between species, factors in population growth and the ecological balance, protection activities of the environment from pollution or destruction concerning conservation, improvement and sustainability of natural resources."
  },
  {
    "id": "90642129",
    "name-th": "การท่องเที่ยวทางเลือก",
    "name-en": "ALTERNATIVE TOURISM",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมาย แนวคิด และรูปแบบของการท่องเที่ยวทางเลือก เช่น การท่องเที่ยวโดยชุมชน การ ท่องเที่ยวเชิงเกษตร การท่องเที่ยวเชิงวัฒนธรรม และการท่องเที่ยวเชิงสุขภาพ แนวโน้มของการท่องเที่ยวในปัจจุบัน บทบาทของภาครัฐและเอกชนในการส่งเสริมการตลาดท่องเที่ยว การมีส่วนร่วมของผู้มีส่วนได้ส่วนเสีย และผลกระทบต่อ เศรษฐกิจ สังคมและสิ่งแวดล้อม",
    "description-en": "Study the definitions, concepts and forms of alternative tourism such as community-based tourism, agro-tourism, cultural tourism and health tourism, and study current trends in tourism, roles of public and private sectors in promoting tourism market, stakeholder engagements and impacts on economy, society and environment."
  },
  {
    "id": "90642130",
    "name-th": "การท่องเที่ยวเชิงกีฬา",
    "name-en": "SPORTS TOURISM",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมาย ประเภท และองค์ประกอบของกิจกรรมการท่องเที่ยวเชิงกีฬา รูปแบบการกีฬาเพื่อการ ท่องเที่ยว พฤติกรรมการท่องเที่ยวของการท่องเที่ยวเชิงกีฬา การพัฒนาการท่องเที่ยวเชิงกีฬากิจกรรมกีฬากลางแจ้งทั้งทาง บก และทางน้ำ การรักษาความปลอดภัยในกิจกรรมการท่องเที่ยวเชิงกีฬา การวางแผน และการจัดกิจกรรมการท่องเที่ยว เชิงกีฬา แนวโน้มการท่องเที่ยวเชิงกีฬาในประเทศ",
    "description-en": "Study definitions, types, and factors of sports tourism activities, formats of sports tourism, sports tourist behaviors, development of sports tourism, outdoor and indoor sports activities, land and water sports, safety for sports tourism, planning and execution of sports tourism activities, and sports tourism trends in Thailand."
  },
  {
    "id": "90642131",
    "name-th": "วัฒนธรรมไทยกับการท่องเที่ยว",
    "name-en": "THAI CULTURE AND TOURISM",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้วัฒนธรรม ขนบธรรมเนียมประเพณี งานเทศกาล อาหารและมรดกทางภูมิปัญญาไทยที่มีความ หลากหลาย แนวคิดของวัฒนธรรมไทยกับการท่องเที่ยว ผลกระทบต่อเศรษฐกิจ สังคม และวัฒนธรรมของอุตสาหกรรม ท่องเที่ยว และศึกษาการอนุรักษ์และฟื้นฟูทรัพยากรการท่องเที่ยวทางวัฒนธรรม การสร้างจิตสำนึกทางวัฒนธรรมเพื่อการ อนุรักษ์",
    "description-en": "Learn various Thai cultures, norms, special events, foods, and intellectual wisdoms and properties, concepts of Thai culture and tourism, impacts of tourism industry on economy, Society, and culture, and study conservation and recovery of cultural tourism resources, promotion of cultural conscience for conservation."
  },
  {
    "id": "90642132",
    "name-th": "ชุมพรศึกษาเพื่อการท่องเที่ยว",
    "name-en": "CHUMPHON STUDY FOR TOURISM",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ภูมิศาสตร์ ประวัติศาสตร์ การเมือง การปกครอง ประชากร เศรษฐกิจ ประเพณีและวัฒนธรรม การ คมนาคม เหตุการณ์สำคัญ บุคคลที่มีชื่อเสียงในจังหวัดชุมพร สถานที่สำคัญและสถานที่ท่องเที่ยวที่สำคัญ เพื่อพัฒนาขึ้น เป็นแผนหรือโครงการการจัดนำเที่ยวระยะสั้นด้วยการปฏิบัติจริงในพื้นที่",
    "description-en": "Learn geography, history, politics, governance, population, economy, traditions and culture, transportation, important events, famous people, landmarks, and tourist attractions in order to develop plans or projects for short term tours and apply such plans or projects in the real site of Chumphon."
  },
  {
    "id": "90642133",
    "name-th": "รอบรั้วชุมพรศึกษา",
    "name-en": "CHUMPHON AREA STUDY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาในเชิงสหสาขาวิชา โดยใช้องค์ความรู้ที่ครอบคลุมทั้งด้านการเมืองการปกครอง เศรษฐกิจ สังคมและ วัฒนธรรม ประวัติศาสตร์ ภูมิศาสตร์ ภาษาและวรรณกรรม ประชากร เหตุการณ์ บุคคล และสถานที่สำคัญ หรืออื่นๆ ภายใต้กรอบแนวคิดอาณาบริเวณศึกษา เพื่อทำความเข้าใจบริบทต่างๆ ที่เกี่ยวข้องกับพื้นที่จังหวัดชุมพร ด้วยการเรียนรู้ ผ่านการทำโครงงานเดี่ยวหรือกลุ่ม ภายใต้คำแนะนำและการดูแลอย่างใกล้ชิด",
    "description-en": "Study interdisciplinary knowledge and learning according to area study approach such as politics and government, economics, social and culture, history, geography, languages and literatures, population as well as important events, people and places in order to understand contexts related to Chumphon Province by a method of project based learning under advice of facilitators – either single or group project."
  },
  {
    "id": "90642134",
    "name-th": "แผ่นดินพระจอมเกล้าฯ ศึกษา",
    "name-en": "KING MONGKUT'S REIGN STUDY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาองค์ความรู้ในด้านต่างๆ ที่เกี่ยวข้องกับรัชสมัยของพระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัว อาทิ พระ ราชประวัติ พระราชกรณียกิจในด้านการเมืองการปกครอง เศรษฐกิจ สังคมและวัฒนธรรม การนำพาประเทศสยามก้าวเข้า สู่ความเป็นสมัยใหม่ด้วยการทำนุบำรุงบ้านเมืองให้ทันสมัยในด้านต่างๆ ตลอดจนพระอัจฉริยภาพอันเป็นที่ปรากฏแก่ชน ชาวสยามและนานาชาติ",
    "description-en": "Study knowledge of The King Mongkut reign such as his majesty the king biography, his royal duties relating to politics and government, economics, social and culture those brought Siam to the flow of modernization including his talents accepted by both the Siamese and the world."
  },
  {
    "id": "90642135",
    "name-th": "ปรัชญาเศรษฐกิจพอเพียง",
    "name-en": "PHILOSOPHY OF SUFFICIENCY ECONOMY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความเป็นมา แนวคิด ความหมาย และ การประยุกต์ใช้ปรัชญาเศรษฐกิจพอเพียงในรูปแบบต่างๆ เรียนรู้ จากการปฏิบัติเพื่อให้เกิดความตระหนักในวิถีชีวิตแห่งความพอเพียง และนำหลักปรัชญาเศรษฐกิจพอเพียงไปประยุกต์ใช้ใน การดำรงชีวิตอย่างเหมาะสมกับบริบทสังคมและความเปลี่ยนแปลงในปัจจุบัน",
    "description-en": "Study the background, principles of the philosophy of sufficiency economy and its application. Learn by doing to instill awareness of sufficient ways of life and applying the philosophy to live appropriately in the changing society."
  },
  {
    "id": "90642136",
    "name-th": "จริยศาสตร์และสุนทรียศาสตร์",
    "name-en": "ETHICS AND AESTHETICS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมาย ความสำคัญ พัฒนาการและคุณลักษณะเชิงปรัชญาของความงามหรือคุณค่าในประเด็นของ จริยธรรมและสุนทรียศาสตร์ซึ่งคิดค้นขึ้นโดยปราชญ์ชาวตะวันตกและตะวันออกจากอดีตกาลจนถึงปัจจุบัน ซึ่งมาจากความ เชื่อ ศาสนา และหลักปรัชญาต่างๆ รวมทั้งฝึกคิดวิเคราะห์หลักการทางศิลป์ในเชิงจริยธรรมและเชิงสุนทรียศาสตร์",
    "description-en": "A study of meaning, significance, evolution, and philosophical characteristics of beauty or axiology in the field of ethics and aesthetics generated by westen and eastern philosophers from the beginning to the present time, based on beliefs, religions and pure philosophical concepts, including a practice in analyzing ethical and aesthetical principles of arts."
  },
  {
    "id": "90642137",
    "name-th": "ดูละครแล้วย้อนดูตัว",
    "name-en": "SERIES IN DAILY LIFE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเนื้อหา แนวคิด และคุณธรรมจริยธรรมที่สะท้อนผ่านเรื่องราวและตัวละครของละครชุดของไทยและ ต่างประเทศร่วมสมัย การวิเคราะห์ภาพสะท้อนของสังคมร่วมสมัย ค่านิยมของคนในสังคมตลอดจนความสัมพันธ์ระหว่าง ละครและสังคมร่วมสมัยที่มีอิทธิพลต่อกัน เน้นกระบวนการคิดและการใช้ประโยชน์จากสื่อละครในการวิเคราะห์ และ แก้ปัญหาในชีวิตประจำวันอย่างมีหลักการและเหตุผล โดยอาศัยแนวคิดทางวิทยาศาสตร์ สังคมศาสตร์ จิตวิทยา และการ รู้เท่าทันสื่อ",
    "description-en": "Study content, concept and ethics from watching movies, digital media contents, or TV series from domestic and international sources. Reflection of contemporary society and its values from the media focusing on the thinking process that applied from concept of science, of social science, of psychology and of media literacy."
  },
  {
    "id": "90642138",
    "name-th": "สมาธิเพื่อพัฒนาชีวิต",
    "name-en": "MEDITATION FOR LIFE DEVELOPMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมายของการทำสมาธิ จุดประสงค์ วิธีการ ขั้นตอน จุดเริ่มต้นของการทำสมาธิลักษณะของการ บริกรรมและการทำสมาธิ ประโยชน์ของสมาธิ การนำสมาธิไปใช้ในชีวิตประจำวัน สมาธิกับการเรียนและการงาน",
    "description-en": "Study the meaning of meditation, objectives, processes, history of meditation, characteristics of chanting and meditating. Understand the benefits of meditation and apply into daily use both study and work."
  },
  {
    "id": "90642140",
    "name-th": "ภูมิคุ้มกันทางใจ",
    "name-en": "IMMUNITY OF MIND",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิดทางจิตวิทยาเพื่อทำความเข้าใจและเห็นคุณค่าของตนเองและผู้อื่น การสร้างสัมพันธภาพ การใช้ ชีวิตร่วมกับผู้อื่น ทักษะการแก้ปัญหาในการดำเนินชีวิต การปรับเปลี่ยนเพื่อสร้างภูมิคุ้มกันชีวิตให้กับตนเอง",
    "description-en": "Learn psychology concepts to understand and appreciate yourself and others.Learn how to develop interpersonal skills, social and life skills, problem solving skills and selfhealing and self- empowerment skills."
  },
  {
    "id": "90642142",
    "name-th": "จิตวิทยาสำหรับการสื่อสาร",
    "name-en": "PSYCHOLOGY IN COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "อุปสรรคสำคัญของการสร้างสรรค์ศิลปะและการออกแบบประการหนึ่งนอกเหนือจากการสร้างสรรค์ผลงาน คือ ความสามารถในการสื่อสารให้ผลงานเป็นที่เข้าใจและยอมรับ การทำงานร่วมกับผู้อื่นอย่างเข้าใจ รายวิชานี้ถูก ออกแบบมาเพื่อให้ผู้ เรียนเข้าใจและมีทักษะในการสื่ อสารอย่างมีประสิทธิภาพ โดยผู้ เรียนมีความเข้าใจและ ความสามารถในการนำเอาความรู้ด้านจิตวิทยามาปรับปรุงกระบวนการสื่อสารอย่างสัมฤทธิ์ผล",
    "description-en": "One of the major obstacle in art and design creation besides artistic creation is the ability in communicating artwork to be comprehended and recognized, as well as working with others sensibly. This course is designed for student to be understood and practiced communication effectively. Consequently, students are capable of utilizing psychological knowledge in improving communication successfully."
  },
  {
    "id": "90642143",
    "name-th": "ชีวิตออกแบบได้",
    "name-en": "DESIGNING YOUR LIFE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และฝึกการออกแบบชีวิตของตนเอง เรียนรู้การตั้งเป้าหมายในชีวิตที่สอดคล้องต่อกระแสการ เปลี่ยนแปลงในศตวรรษที่ 21 เพิ่มทักษะทางสังคม การใช้ชีวิตอย่างมีความสุขบนพื้นฐานความพอเพียง สามารถจัดการ การเงินส่วนตัว การทำงาน การเข้าสังคม การสร้างความสัมพันธ์ส่วนตัวกับบุคคลรอบข้าง",
    "description-en": "Learn and practice designing your own life in other contexts, applying and adding social, living, financial, working, interpersonal skills to live happily based on sufficiency economy philosophy."
  },
  {
    "id": "90642144",
    "name-th": "กระจกส่องใจ",
    "name-en": "MAGIC MIRROR",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิดทางจิตวิทยาเพื่อเข้าใจพฤติกรรมและกระบวนการทำงานของจิตใจมนุษย์ที่ก่อให้เกิดพฤติกรรม ต่าง ๆ เช่น การรับรู้ การเรียนรู้ ความคิด ความจำ แรงจูงใจ ความรัก และการสื่อสารระหว่างบุคคล",
    "description-en": "Study psychology concepts to understand human behavior and the mechanisms of the human mind that lead to different behaviors concerning perception, learning, thinking, memory, motivation, love, and interpersonal communication."
  },
  {
    "id": "90642145",
    "name-th": "พลังแห่งบุคลิกภาพ",
    "name-en": "POWER OF PERSONALITY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาทฤษฎีบุคลิกภาพ กระบวนการในการพัฒนาบุคลิกภาพ เพื่อให้ได้บุคลิกภาพที่เหมาะกับตนเองตาม กาลเทศะ การพูดและฝึกพูดในโอกาสต่างๆ ความรู้ทั่วไปเกี่ยวกับมารยาท การเสริมสร้างมนุษย สัมพันธ์ ศิลปะการแต่งกาย การแก้ไขข้อบกพร่องทางร่างกายเพื่อเสริมสร้างบุคลิกภาพ",
    "description-en": "Study the personality theories, processes of personality development. Learn how to develop appropriate manners and speeches, interpersonal skills, and appropriate clothing selection. Practice techniques for improving personality deficiency."
  },
  {
    "id": "90642146",
    "name-th": "เปลี่ยนความคิดชีวิตเปลี่ยน",
    "name-en": "POWER OF CHANGE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและเข้าใจความเชื่อของมนุษย์ที่มีต่อรูปแบบการเรียนรู้และคุณลักษณะทางปัญญาของตนเองที่สามารถ เปลี่ยนแปลงและพัฒนาได้โดยเน้นเรื่องกระบวนการทางความคิดซึ่งนำไปสู่การใช้ศักยภาพของมนุษย์อย่างเต็มที่เพื่อไปสู่ ความสำเร็จ รวมทั้งเรียนรู้กระบวนการเปลี่ยนแปลงในกรอบความคิดแบบตายตัว (fixed mindset) ไปสู่การเปลี่ยนแปลง ในกรอบความคิดแบบเติบโต (growth mindset) เพื่อนำไปสู่การเพิ่มความสุข แรงจูงใจ และความสำเร็จ และฝึกฝน กระบวนการเปลี่ยนแปลงความคิดและทัศนะทางลบที่มีต่อความล้มเหลวให้เป็นความคิดในเชิงบวก",
    "description-en": "Study and understand the underlying beliefs about individuals’ learning and intelligence which can change and develop focusing on the process of mindset change leading to full potential for achievement, and learn the changing process of fixed mindset to growth one leading to increased happiness, motivation and achievement, including practice the process of change of negative thoughts from failures to positive thoughts."
  },
  {
    "id": "90642147",
    "name-th": "ทักษะแห่งความสุข",
    "name-en": "HAPPINESS SKILLS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการทางมนุษย์ศาสตร์และสังคมศาสตร์เชิงบวกโดยบูรณาการเพื่อการฝึกปฏิบัติทักษะแห่งความสุข ในทุกบริบทเช่น การยอมรับความจริง การรู้จักการให้อภัย การมองโลกในแง่บวก และการรู้คิดเพื่อการดำเนินชีวิตอย่างมี ความสุขทั้งในส่วนตน สังคม การงาน",
    "description-en": "Study principles of humanity and social sciences focusing on positive aspects in order to practice happiness skills in various situations such as being realistic, learning to forgive, being positive and having sense of awareness in order to live happily with personal life, society and at work."
  },
  {
    "id": "90642148",
    "name-th": "ศิลปะการพัฒนาอารมณ์",
    "name-en": "ARTS OF EMOTION DEVELOPMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมาย ความสำคัญ หลักการ แนวคิดทฤษฎีที่เกี่ยวข้องอารมณ์ที่มีอิทธิพลต่อการดำรงชีวิต การ ปรับเปลี่ยนความคิด การคิดเชิงบวก การเผชิญปัญหา การจัดการอารมณ์ในการทำงานและการดำเนินชีวิตประจำวัน",
    "description-en": "Study the definitions, Significances, principles and theories of emotion development especially ones influencing ways of life. Learn and practice thinking processes of adjustment, positiveness and problem confrontation. Explore how to manage emotion in daily life and workplace."
  },
  {
    "id": "90642149",
    "name-th": "ศิลปะสร้างสรรค์เพื่อพัฒนาอารมณ์และจิตวิญญาณ",
    "name-en": "IMAGINATIVE ART",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้การบูรณาการการสร้างสรรค์ผลงานศิลปะงานที่ไม่กำหนดผลลัพธ์ ไม่ยึดติดกับอุปกรณ์ทฤษฎี และ ความสวยงามของผลงาน ให้ความสำคัญกับความคิด การวางแผน และการลงมือทำ เน้นที่การสะท้อนตัวตนเพื่อให้เกิด ความรับรู้และเข้าใจในตนเอง รวมถึงการพัฒนาอารมณ์ สติปัญญา สมาธิ ความคิดสร้างสรรค์ และจิตวิญญาณ",
    "description-en": "Learn integration of formless art enhancing the process of thought, plan and action with no determination of ends, equipment, theories and beauty of end product, and focusing on self-reflection to practice acknowledgement and sense making including development of emotion, intellect, meditation, creative thinking and spirit."
  },
  {
    "id": "90642150",
    "name-th": "ศิลปะในชีวิตประจำวัน",
    "name-en": "ART IN EVERYDAY LIFE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศิลปะในชีวิตประจำวันเป็นเรื่องของสัมพันธบทที่ศิลปะมีต่อเรื่องราวปรากฎการณ์รอบตัว ศิลปะไม่ได้ดำเนิน ไปบนขนบปฏิบัติที่พึ่งพิงสื่ อศิลปะใดสื่ อศิลปะหนึ่ ง การเคลื่ อนตัวของสื่ อศิลปะ ตลอดจนการขยับขยายตัวของ สุนทรียศาสตร์และรสนิยม วัตถุประสงค์ของวิชานี้ เพื่อศึกษาและทำความเข้าใจการเปลี่ยนแปลงในศิลปะตั้งแต่หลัง สงครามโลกครั้งที่สอง ลัทธินิยมทางศิลปะ อาทิ ป้อปอาร์ต มินิมอลลิสม์ ศิลปะร่วมสมัย ตลอดจนผลกระทบที่มีต่อชีวิตคน มีเป้าหมายเพื่อให้นักศึกษาสามารถนำข้อมูลที่ได้ไปศึกษาต่อยอดในการสร้างสรรค์ส่วนอื่นๆ ต่อไป",
    "description-en": "Art in everyday life is the intertextuality that art connects to its surrounded phenomenon. Art is not only proceeded along the conventional practice that relies on one particular art medium, but also the shifting of art form, as well as the growing of aesthetics and taste. The objectives of this course are to study and understand the transformation of art during the post-World War II period and art movements such as Pop Art, Minimalism, and contemporary art, along with their effects toward human lives. Students are targeted to apply the obtained data to develop studying in other parts of creativity."
  },
  {
    "id": "90642151",
    "name-th": "มนุษย์กับศิลปะ",
    "name-en": "MAN AND ART",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษารูปแบบของศิลปะแต่ละยุคสมัย เทคนิคและวิธีการสร้างสรรค์งานศิลปะ การกำเนิดและที่มาของการ สร้างงานศิลปะ และอภิปรายแนวความคิดและวัตถุประสงค์ในการสร้างสรรค์ผลงานตั้งแต่อดีตจนถึงปัจจุบัน โดยเชื่อมโยง กับการเปลี่ยนแปลงของบริบททางสังคม ศาสนา เศรษฐกิจ และการเมือง ในแต่ละยุคสมัย",
    "description-en": "Study artistic forms in each period, techniques and how to create artwork, origins and backgrounds in artwork creation, and discuss concepts and objectives behind creation in each period by integrating with contextual changes in societies, religions, economies and politics."
  },
  {
    "id": "90642152",
    "name-th": "ปันสุข",
    "name-en": "JOY OF SHARING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาองค์ประกอบของจิตอาสา/จิตสาธารณะ ความหมาย รูปแบบของจิตอาสา/จิตสาธารณะ ประโยชน์ที่ ได้รับ วิธีการทำงานร่วมกันกับชุมชน การจัดการปัญหาสาธารณะหรือเสริมสร้างคุณภาพของชุมชน องค์กรด้านจิตอาสา/จิต สาธารณะทั้งในและต่างประเทศ ฝึกการเป็นจิตอาสาและหรือจัดทำโครงการเพื่อพัฒนาจิตอาสา/ จิตสาธารณะ Study the components of volunteer spirit/ public mind in terms of meanings, forms, benefits,",
    "description-en": "methods of participation with community, management of public problems or public health enhancement, a range of voluntary organizations both domestic and international, and practice being a volunteer and/or managing a voluntary project for community."
  },
  {
    "id": "90642153",
    "name-th": "ความเข้าใจในพฤติกรรมมนุษย์",
    "name-en": "UNDERSTANDING HUMAN BEHAVIOR",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้พื้นฐานพฤติกรรมทางชีววิทยา ความคิด แรงจูงใจ และอารมณ์ การพัฒนาสุขภาพจิตและบุคลิกภาพ ศึกษาทฤษฎีจิตวิเคราะห์ทฤษฎีการเรียนรู้ ทฤษฎีพฤติกรรม และพฤติกรรมบำบัด รวมถึงศึกษาความสัมพันธ์ระหว่าง ตนเอง ครอบครัวและสังคม ผลกระทบของความเชื่อและศาสนาที่มีต่อพฤติกรรม เรียนรู้วิธีการทำความเข้าใจสุขภาพและ ความเจ็บป่วยผ่านปัจจัยทางชีวภาพ จิตวิทยาและสังคม แนวคิดสุขภาพโลก",
    "description-en": "Learn Biological basis of behaviors, thought, motivation and emotion; psychosocial and personality development, psychoanalysis and psychodynamic theory, learning theory, behavioral theory and behavioral therapy; relationship between self, family and society; impact of belief and religion on behavior; social determinant of health and illness; biopsychosocial model in health-related behavior; global health and behavioral medicine."
  },
  {
    "id": "90642154",
    "name-th": "ล้มให้เป็น",
    "name-en": "FAIL-ABLE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาการเปลี่ยนแปลงในเชิงลบหรือความล้มเหลว ความผิดหวังที่เกิดขึ้นในชีวิต เพื่อให้เข้าใจตัวเอง และมอง โลกตามความเป็นจริง ฝึกฝนการปรับตัวเพื่อเผชิญจากสถานการณ์และทัศนคติทางบวกและลบที่เกิดขึ้นทั้งของตนเองและ ผู้อื่น และเรียนรู้แนวทางป้องกัน การปรับแผนชีวิตไม่ให้เกิดเหตุการณ์ซ้ำเดิม เพื่อนำความผิดพลาดไปปรับใช้สำหรับการ ดำเนินชีวิตในอนาคตได้",
    "description-en": "Study a comprehensive perspective of failure and disappointment to understand the state of mind and perceive the reality, and practice with self-adjustment tools for either positive or negative scenarios in real life and learn how to prevent and adjust life-plan to avoid negatively repeated or unwanted scenarios."
  },
  {
    "id": "90642156",
    "name-th": "ฮวงจุ้ย",
    "name-en": "FENG SHUI",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษา ความหมาย และหลักการของฮวงจุ้ย ที่สามารถนำมาประยุกต์ใช้ในชีวิตประจำวัน หรือนำไป ประยุกต์ใช้กับการอยู่ร่วมกับผู้อื่นอย่างมีความสุข",
    "description-en": "Study and apply the meaning and principles of Feng Shui, which can be advantages for daily life as well as for living in society with happiness."
  },
  {
    "id": "90642157",
    "name-th": "โหราศาสตร์ไทย",
    "name-en": "THAI ASTROLOGY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความเป็นมาเกี่ยวกับโหราศาสตร์และการพยากรณ์ เน้นโหราศาสตร์ไทยและการพยากรณ์ ที่มี หลักเกณฑ์และสถิติเพื่อความเข้าใจที่ถูกต้องเกี่ยวกับโหราศาสตร์ที่มีพื้นฐานจากวิทยาศาสตร์และดาราศาสตร์ และเรียนรู้ รูปแบบการพยากรณ์ในแบบของโหราศาสตร์ไทยเพื่อให้สามารถนำไปปรับใช้ในชีวิตประจำวัน",
    "description-en": "Study backgrounds of astrology and forecast with an emphasis on Thai astrology and systematic and statistical forecasting to achieve a correct understanding of the root of astrology based on science and astronomy and learn types of forecasting in Thai astrology in order to apply in daily life."
  },
  {
    "id": "90642158",
    "name-th": "มุมมองวิทยาศาสตร์และเทคโนโลยีร่วมสมัย",
    "name-en": "CONTEMPORARY SCIENCE AND TECHNOLOGY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกการแสดงความคิดเห็นในประเด็นร่วมสมัยด้านวิทยาศาสตร์และเทคโนโลยีรวมทั้งนวัตกรรมและเทคโนโลยี ฝึกวิเคราะห์ สรุปประเด็นต่างๆ ทั้งแนวคิด การประยุกต์ใช้ รวมทั้งเรียนรู้แอปพลิเคชันที่เกี่ยวข้องกับศาสตร์ที่หลากหลาย ในวิทยาศาสตร์",
    "description-en": "Discussion of contemporary topics in science and technology including innovation and technology in modern days, development and integration of science and technology, novel science and technology concepts, and recent applications of formal, physical, life, applied and interdisciplinary sciences."
  },
  {
    "id": "90642159",
    "name-th": "จิตวิทยาเบื้องต้น",
    "name-en": "INTRODUCTION TO PSYCHOLOGY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ ศาสตร์ด้านจิตวิทยาวิทยาศาตร์ ครอบคลุมถึง ความรู้ สึกและการรับรู้, การเรียนรู้, การจดจำ, ความสามารถในการเรียนรู้, ภาษา และความรู้ความเข้าใจด้านภาษา, อารมณ์และการแสดงออก, การพัฒนาตน, บุคลิกภาพ, สุขภาพและการเจ็บป่วย, และพฤติกรรมที่แสดงออกในสังคม นักศึกษาจะได้เรียนรู้และแสดงความเห็นเกี่ยวกับ ความสัมพันธ์ระหว่าง สมอง พฤติกรรม ประสบการณ์ และได้เรียนรู้กระบวนการของการค้นพบแนวคิดใหม่ การหาผลสรุป ของแนวคิด",
    "description-en": "Introduces a broad survey of psychological science including: sensation and perception; learning, memory, intelligence, language, and cognition; emotions and motivation; development, personality, health and illness, and social behavior. Students will study and discuss relations between the brain, behavior, and experience as well as learning the process of discovering new ideas and empirical results in the field."
  },
  {
    "id": "90642161",
    "name-th": "ดนตรีอิเล็กทรอนิกส์",
    "name-en": "ELECTRONIC MUSIC HISTORY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การศึกษาประวัติศาสตร์ดนตรีอิเล็กทรอนิกส์ตั้งแต่ช่วงทศวรรษ 1850 จนถึงปัจจุบัน ในหลักสูตรนี้ นักศึกษา จะได้เรียนรู้เกี่ยวกับพัฒนาการ พร้อมตัวอย่างเสียงในแต่ละช่วง ปรัชญาของดนตรีอิเล็คทรอนิคส์แต่ละประเภทจะได้รับ การศึกษา เชื่อมโยง กับผู้ร่วมสมัยในสาขาศิลปะและเทคโนโลยีอื่น ๆ ซึ่งรวมถึงวิธีการโน้ตสมัยใหม่ เช่น การให้คะแนนแบบ กราฟิกและสัญกรณ์ไฟฟ้าอะคูสติก โดยจะเรียนรู้ จากผลงานที่สำคัญผ่านประวัติศาสตร์ของการรู้ เท่าทันดนตรี อิเล็กทรอนิกส์",
    "description-en": "The study of electronic music history is investigated from the 1850s until now. In this course students will learn about its development overtime with audio examples from each period. Philosophy of each genre of electronic music will be investigated with their contemporary counterparts in other disciplines of arts and technology that includes the modern notation methods such as graphic scoring and electroacoustic notation will be studied, reviewing important works through history of electronic music literacy."
  },
  {
    "id": "90642162",
    "name-th": "พร้อมสู่วัยทำงาน",
    "name-en": "READY TO WORK",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ความรู้พื้นฐานและเทคนิคในการสมัครงาน การเขียนจดหมายสมัครงาน และการสัมภาษณ์งาน การพัฒนา บุคลิกภาพ การสร้างความมั่นใจในตนเอง ทักษะการทำงานเป็นทีม การพัฒนาทักษะการสื่อสาร เทคนิคการนำเสนองาน ปัญหาอุปสรรคและแนวทางแก้ไขระหว่างการปฏิบัติงาน การสร้างสมดุลชีวิตกับการทำงานด้วยอิคิไก การวางแผนการเงิน ส่วนบุคคล กฎหมายแรงงานและกฎหมายอื่นๆ ที่เกี่ยวข้อง",
    "description-en": "Basic knowledges and techniques in job application such as making curriculum vitae and interviewing; personality development; communication and human relations; report writing and presentations techniques; workplace management and problem solving; achieve work-life balance with Ikigai; personal financial planning; related civil and labor laws."
  },
  {
    "id": "90642163",
    "name-th": "โดดเด่นด้วยจุดแข็ง",
    "name-en": "STAND OUT WITH STRENGTHS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "รู้จักและเข้าใจจุดแข็ง ค้นหาจุดแข็งของตนเอง วิเคราะห์การกระทำและพฤติกรรมของตนเองจากจุดแข็ง การ พัฒนาจุดแข็ง การสังเกตจุดแข็งของผู้อื่น การใช้จุดแข็งเพื่อสร้างความแตกต่างในการทำงาน ข้อควรระวังของการใช้จุดแข็ง และการร่วมงานกับผู้ที่มีจุดแข็งแตกต่างกัน",
    "description-en": "Knowing and understanding strengths; finding your own strengths; analyzing actions and behaviours through strengths; developing the strengths; identifying others’ strengths; making differences in work with strengths; precautions for using strengths; and working with diverse strengths people."
  },
  {
    "id": "90642164",
    "name-th": "กฎหมายทรัพย์สินทางปัญญาสำหรับผู้ประกอบการ",
    "name-en": "INTELLECTUAL PROPERTY LAWS FOR ENTREPRENEUR",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ความเป็นมาในการคุ้มครองทรัพย์สินทางปัญญา กฎหมายระหว่างประเทศในการคุ้มครองทรัพย์สินทาง ปัญญา, ประเภทของทรัพย์สินทางปัญญา, หลักกฎหมายลิขสิทธิ์, หลักกฎหมายสิทธิบัตร และหลักกฎหมายเครื่องหมาย การค้า, กระบวนการยื่นคำขอแจ้งข้อมูลลิขสิทธิ์, กระบวนการจดทะเบียนสิทธิบัตรการประดิษฐ์, กระบวนการจดทะเบียน สิทธิบัตรการออกแบบผลิตภัณฑ์, กระบวนการจดทะเบียนอนุสิทธิบัตร, กระบวนการจดทะเบียนเครื่องหมายการค้า และ กรณีศึกษาต่าง ๆ ที่เกี่ยวข้องกับทรัพย์สินทางปัญญาสำหรับผู้ประกอบการ",
    "description-en": "Historical backgrounds of intellectual property protection, international laws on intellectual property protection, types of intellectual property, principles of copyright law, principles of patent law, and principles of trademark law, copyright, copyright registration process, invention patent registration process, design patent registration process, petty patent registration process, trademark registration process, studies on intellectual property for entrepreneur."
  },
  {
    "id": "90642167",
    "name-th": "จังหวะชีวิต",
    "name-en": "SLICE OF LIFE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิด และ การเปลี่ยนแปลงทางร่างกายและจิตใจในแต่ละช่วงเวลาของชีวิตตั้งแต่เกิดจนตาย เพื่อให้ เตรียมความพร้อมรับมือต่อสิ่งที่จะเกิดขึ้นในแต่ละช่วงเวลา ตั้งแต่วัยรุ่น วัยรัก วัยทำงาน สร้างครอบครัว เลี้ยงดูบุตร ดูแลผู้ สุงอายุในครอบครัว วัยทอง วัยเกษียณ เพื่อสร้างความเข้าใจภายในครอบครัว และสังคมที่เต็มไปด้วยความแตกต่าง หลากหลาย",
    "description-en": "Study the concepts and the ways of both physical and mental bodies of people in each period of lifetime in order to prepare the challenges and problems from teenage, working, family building, child raising, retirement to have understanding among family members and social diversity."
  },
  {
    "id": "90642168",
    "name-th": "เรื่องน่ารู้ของพืชสมุนไพรเพื่อสุขภาพและความงาม",
    "name-en": "INTERESTING TOPICS IN MEDICINAL PLANTS FOR WELLNESS AND AESTHETICS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "พืชสมุนไพรเพื่อสุขภาพและความงาม การตลาด การผลิตสมุนไพรที่มีความสาคัญอย่างง่าย การแปรรูป ผลิตภัณฑ์อย่างง่าย อาหารและเครื่องดื่มจากพืชสมุนไพรเพื่อสุขภาพและความงาม",
    "description-en": "Classification of medicinal plants for wellness and aesthetics business; marketing; simplified production of selected medicinal plants; simplified product processing; Food and drinks from medicinal plants for wellness and aesthetics."
  },
  {
    "id": "90642169",
    "name-th": "กัญชาเพื่อชีวิต",
    "name-en": "CANNABIS FOR LIFE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ประวัติของกัญชา กฎหมายกัญชาในประเทศไทย การจาแนกพืชในสกุลกัญชา สารสาคัญและการใช้ ประโยชน์จากกัญชา การปลูกและสกัดกัญชาอย่างง่าย อาหารและเครื่องดื่มที่มีส่วนผสมจากกัญชา",
    "description-en": "History of cannabis; Legal cannabis in Thailand; classification; phytochemical and use of cannabis; simplified cannabis growing and extraction; cannabis-infused food and drinks."
  },
  {
    "id": "90642170",
    "name-th": "ตรรกศาสตร์เบื้องต้น",
    "name-en": "INTRODUCTION TO LOGIC",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การศึกษาแนวคิด หลักการ เทคนิค และเครื่องมือเบื้องต้นทางตรรกศาสตร์ รวมถึงการนาไปประยุกต์ใช้ การวิเคราะห์การอ้างเหตุผล การให้เหตุผลแบบนิรนัยและแบบอุปนัย การอ้างเหตุผลบกพร่อง ตรรกศาสตร์สัญลักษณ์ เบื้องต้น วิธีการพิสูจน์ การประยุกต์ใช้ตรรกศาสตร์ในการแก้ปัญหาและในชีวิตประจ าวัน",
    "description-en": "Study of basic concepts, principles, techniques, and tools of logic, as well as their applications; analyzing arguments; deductive and inductive reasoning; fallacies; basic symbolic logics; methods of proof; applications of logic for problem solving and in everyday life."
  },
  {
    "id": "90642175",
    "name-th": "เปตอง",
    "name-en": "PETANQUE",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นเปตอง ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of playing petanque and practice techniques and",
    "description-en": "skills in competitions."
  },
  {
    "id": "90642176",
    "name-th": "รักบี้ฟุตบอล",
    "name-en": "RUGBY FOOTBALL",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นรักบี้ฟุตบอล ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการ แข่งขัน",
    "description-en": "Study principles, rules and proper manners of rugby football players and practice techniques and skills in competitions."
  },
  {
    "id": "90642177",
    "name-th": "ฟุตบอล",
    "name-en": "SOCCER",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นฟุตบอล ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of soccer players and practice techniques and",
    "description-en": "skills in competitions."
  },
  {
    "id": "90642178",
    "name-th": "ซอฟบอลและเบสบอล",
    "name-en": "SOFTBALL & BASEBALL",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นซอฟบอลและเบสบอล ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อ การแข่งขัน",
    "description-en": "Study principles, rules and proper manners of softball & Baseball players and practice techniques and skills in competitions."
  },
  {
    "id": "90642179",
    "name-th": "เทนนิส",
    "name-en": "TENNIS",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นเทนนิส ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of tennis players and practice techniques and",
    "description-en": "skills in competitions."
  },
  {
    "id": "90642180",
    "name-th": "วอลเลย์บอล",
    "name-en": "VOLLEYBALL",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นวอลเลย์บอล ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of volleyball players and practice skills as an",
    "description-en": "exercise to promote good health in daily life."
  },
  {
    "id": "90642181",
    "name-th": "กอล์ฟ",
    "name-en": "GOLF",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นกอล์ฟ ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of golf players and practice techniques and skills",
    "description-en": "in competitions."
  },
  {
    "id": "90642182",
    "name-th": "แบดมินตัน",
    "name-en": "BADMINTON",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นแบดมินตัน ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of badminton players and practice techniques",
    "description-en": "and skills in competitions."
  },
  {
    "id": "90642183",
    "name-th": "บาสเกตบอล",
    "name-en": "BASKETBALL",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นบาสเกตบอล ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการ แข่งขัน",
    "description-en": "Study principles, rules and proper manners of basketball players and practice techniques and skills in competitions."
  },
  {
    "id": "90642184",
    "name-th": "หมากกระดาน",
    "name-en": "CHESS",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นหมากกระดาน ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการ แข่งขัน",
    "description-en": "Study principles, rules and proper manners of playing chess and practice techniques and skills in competitions"
  },
  {
    "id": "90642185",
    "name-th": "คาราเต้",
    "name-en": "KARATE",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการต่อสู้ด้วยคาราเต้ ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการ แข่งขัน",
    "description-en": "Study principles, rules and proper manners of doing karate and practice techniques and skills in competitions."
  },
  {
    "id": "90642186",
    "name-th": "ยิงปืน",
    "name-en": "SHOOTING",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการยิงปืน ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of shooting and practice shooting techniques and",
    "description-en": "skills in competitions."
  },
  {
    "id": "90642187",
    "name-th": "เทเบิลเทนนิส",
    "name-en": "TABLE TENNIS",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นเทเบิลเทนนิส ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการ แข่งขัน",
    "description-en": "Study principles, rules and proper manners of table tennis players and practice techniques and skills in competitions."
  },
  {
    "id": "90642188",
    "name-th": "เทควันโด",
    "name-en": "TAEKWONDO",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการต่อสู้ด้วยเทควันโด ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการ แข่งขัน",
    "description-en": "Study principles, rules and proper manners of doing taekwondo and practice techniques and skills in competitions."
  },
  {
    "id": "90642189",
    "name-th": "ยูโด",
    "name-en": "JUDO",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการต่อสู้ด้วยยูโด ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of judo martial art and practice techniques and",
    "description-en": "skills in competitions."
  },
  {
    "id": "90642190",
    "name-th": "วิธีการออกแบบเพื่อสร้างนวัตกรรม",
    "name-en": "DESIGN METHODS FOR INNOVATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษากระบวนการออกแบบเชิงระบบเพื่อสร้างสรรค์ผลิตผลและบริการเชิงนวัตกรรม ฝึกการค้นคว้าหา แนวโน้มและข้อมูล เช่น แนวโน้มของโลก แนวคิดสาธารณะ ประเด็นด้านเทคโนโลยี ธุรกิจ สังคมและเศรษฐกิจ เรียนรู้ วิธีการแยกและสังเคราะห์บริบทเพื่อสร้างโอกาสในการสร้างนวัตกรรม ศึกษากระบวนการเก็บข้อมูลผู้บริโภค กระบวนการ สร้างความเข้าใจในประเด็นที่นำไปสู่แนวคิดในการสร้างสรรค์ผลงานเพื่อหาโซลูชั่นออกมาในการผลิตชิ้นงานนวัตกรรมและ การบริการเชิงนวัตกรรม",
    "description-en": "This course consists of structural design process to create innovative products or services. The students will study the process to gather trends and information such as global direction, public opinions, technology, business, society and economic; learn how to extract context of interested area to find opportunities; study the processes used to gather behaviors, generate intense understanding about areas that lead to innovative concepts, produce innovative solutions and finally offering innovative products and services."
  },
  {
    "id": "90642191",
    "name-th": "การตีความและการใช้เหตุและผล",
    "name-en": "INTERPRETATION AND ARGUMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้การตีความและการวิเคราะห์เนื้อหาที่เป็นเชิงอภิปราย แยกแยะคุณค่า นิยาม ความหมายของบท อภิปรายดังกล่าว และเรียนรู้วิธีการสังเคราะห์ความหลากหลายของมุมมองต่างๆ รวมทั้งสามารถแสดงความคิดเห็นขัดแย้ง ต่อมุมมองต่างๆ เหล่านั้นได้ และสามารถแสดงความคิดเห็นต่อยอดเพื่ออภิปรายประเด็นต่างๆ ในศาสตร์ของวิศวกรรม นวัตกรรมทางธุรกิจ และด้านเทคโนโลยี",
    "description-en": "This course provides the study of interpreting and analyzing written and visual arguments. Students will learn to identify the underlying values, definitions, and assumptions in those arguments. The students also learn how to synthesize a multiplicity of competing perspectives, and to articulate fundamental disagreements between those perspectives. Ultimately, students will advance their own contributions to discussions in engineering, business innovations, and technology studies."
  },
  {
    "id": "90642192",
    "name-th": "ฟันดาบสากล",
    "name-en": "FENCING",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของกีฬาฟันดาบสากล ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of fencing players and practice techniques and",
    "description-en": "skills in competitions."
  },
  {
    "id": "90642193",
    "name-th": "ฟุตซอล",
    "name-en": "FUTSAL",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของกีฬาฟุตซอล ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of futsal players and practice techniques and",
    "description-en": "skills in competitions."
  },
  {
    "id": "90642194",
    "name-th": "ลีลาศ",
    "name-en": "DANCESPORT",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของกีฬาลีลาศ ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of dancesport players and practice techniques",
    "description-en": "and skills in competitions."
  },
  {
    "id": "90642195",
    "name-th": "บริดจ์",
    "name-en": "BRIDGE",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการ กฎ กติกา มารยาท ของการเล่นบริดจ์ ฝึกฝนทักษะ และเรียนรู้เทคนิคเพื่อการแข่งขัน Study principles, rules and proper manners of bridge players and practice techniques and",
    "description-en": "skills in competitions."
  },
  {
    "id": "90642196",
    "name-th": "ผู้ฝึกสอนการออกกำลังกายส่วนบุคคล",
    "name-en": "PERSONAL TRAINER",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการต่างๆ ที่จำเป็นต่อการดูแลสุขภาพร่างกายให้มีสุขภาพดีและแข็งแรง เรียนรู้วิธีการประเมิน สุขภาพ และประเมินสมรรถภาพร่างกายก่อนการออกกำลังกาย โครงสร้างร่างกายเบื้องต้นที่ต้องรู้ก่อนการออกกำลังให้ ถูกต้อง ลักณะการเคลื่อนไหวร่างกายในการออกกำลังกายที่ถูกต้อง การออกกำลังกายในท่าต่างๆ ที่ถูกต้อง การยืดเหยียด ร่างกาย การจัดการเรื่องโภชนาการอาหารให้ครบ 5 หมู่ การออกกำลังกายที่เน้นการเต้นของหัวใจ การจัดโปรแกรมการ ออกกำลังการที่เหมาะสมของแต่ละบุคคล การนวดทางด้านกีฬา การปฐมพยาบาลและการช่วยชีวิตเบื้องต้น และการแก้ไข ลักษณะท่าทางให้เหมาะสมตามโครงสร้างร่างกายด้วยการออกกำลังกาย",
    "description-en": "Study the principles necessary to maintain a healthy and strongly. Learn how to do physical health assessment fitness test before exercise. Basic body structure that must be known before exercising correctly. The movement of the body in the exercise correctly. Posture, stretching, Food nutrition, Cardiovascular system, Personal exercising programs, Sport massage, First Aid & CPR and Correcting posture to suit the body structure by exercising."
  },
  {
    "id": "90642197",
    "name-th": "การดำน้ำเพื่อการท่องเที่ยวเชิงอนุรักษ์",
    "name-en": "DIVING FOR ECOTOURISM",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ความหมาย ความสำคัญ และรูปแบบของการดำน้ำเพื่อการท่องเที่ยวเชิงอนุรักษ์ ความสัมพันธ์ของระบบ นิเวศ และความหลากหลายทางชีวภาพใต้น้ำ ความสัมพันธ์ระหว่างวิถีชีวิตชุมชนกับการใช้ทรัพยากรทางทะเล แนวคิด และรูปแบบการอนุรักษ์และการจัดการทรัพยากรอย่างยั่งยืน สภาพแวดล้อมและการปรับตัวกับโลกใต้น้ำ การฝึกพื้นฐาน การดำน้ำ การประกอบและใช้อุปกรณ์ในการดำน้ำ การใช้สัญญาณมือ การสื่อสารใต้น้ำ การวางแผนดำน้ำ และการแก้ไข สถานการณ์ฉุกเฉิน",
    "description-en": "Meaning, importance, and type of diving for ecotourism; ecological relationships, underwater biodiversity; relationship between local community and marine resources utilization; concepts and models of conservation and sustainable management of natural resources; underwater environment and human physiology adaptation, basic diving training; installation and use of diving equipment; underwater communication and hand signals; dive planning; and handling with emergency."
  },
  {
    "id": "90642198",
    "name-th": "ขับร้องประสานเสียง",
    "name-en": "CHORUS",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "เพื่อให้นักศึกษาได้เรียนรู้และปฏิบัติการขับร้องในรูปแบบกลุ่ม การทำงานของเสียงร้องและกล้ามเนื้อส่วนที่ เกี่ยวข้อง การทำงานของฐานกรณ์ การออกเสียงภาษาต่างๆที่ใช้ในการขับร้อง การปรับเสียงในวงขับร้องประสานเสียง บท เพลงและเทคนิคการขับร้องประสานเสียงในดนตรียุคสมัยต่างๆ วรรณคดีเพลงขับร้องประสานเสียง และการแสดงต่อ ประชุมชน",
    "description-en": "To learn and practice choral singing including Articulatory Phonetics, Diction for Singers, Choral History and Literature, and Recital."
  },
  {
    "id": "90642199",
    "name-th": "บูรณาการงานสร้างสรรค์ทางศิลปะและการออกแบบ",
    "name-en": "INTEGRATED CREATIVE ART AND DESIGN",
    "credits": "3 (1-4-4)",
    "prerequisite": null,
    "description-th": "นักศึกษาได้ร่วมเรียนรู้ข้ามศาสตร์ ทางด้านสถาปัตยกรรม ศิลปะและการออกแบบ โดยบูรณาการการใช้ ความคิดสร้างสรรค์ สร้างนวัตกรรม งานศิลปะและงานออกแบบ ในรายวิชานี้ นักศึกษาจะได้เรียนรู้ผ่านโครงงานและการ ทำงานเป็นทีมร่วมกับผู้อื่น",
    "description-en": "Students participate in an inter-discipline learning approach in architecture, art, and design by integrating creative thinking for art and design innovation. This course also provides students opportunities to work with others as a team via project-based assignments."
  },
  {
    "id": "90642200",
    "name-th": "ดาราโหราศาสตร์",
    "name-en": "ASTROLOGY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ความหมายของดาราศาสตร์ ความรู้เกี่ยวกับดาว ตำแหน่งดาว การเคลื่อนย้ายของดาว เส้นขอบฟ้า และจุด ต่างๆ บนท้องฟ้า การนำความรู้ของดวงดาวมาใช้ในทางโหราศาสตร์ และการทำนายโชคชะตา จักรราศี เบื้องต้น",
    "description-en": "The definition of astronomy, stellar, constellation, transits and planetary degrees, horizons, and cardinal points. The application of astronomy in astrology and introductory to zodiac-related fortune- telling."
  },
  {
    "id": "90642999",
    "name-th": "โรงเรียนสร้างเสน่ห์",
    "name-en": "CHARM SCHOOL",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้การสร้างเสน่ห์จากการรู้จักตนเอง การวางตัว การสื่อสาร การมีมนุษยสัมพันธ์ การปรับบุคลิกภาพ เพื่อ การพัฒนาตนเองและการทำงานในอนาคตอย่างมีความสุข ปลูกฝังจิตสำนึกสาธารณะ เพื่อสะท้อนอัตลักษณ์ สจล.",
    "description-en": "Make yourself charming through enhancement of self-awareness, appropriate manners, communication, interpersonal skills, personalities to encourage personal development and happiness in the future work-life. Inspire social consciousness to reflect KMITL identities."
  },
  {
    "id": "90643001",
    "name-th": "ปฏิบัติงานตามทักษะด้านการจัดการ 1",
    "name-en": "PRACTICE UNDER MANAGEMENT SKILLS 1",
    "credits": "1 (0-2-1)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดาเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านการจัดการโดยมีเวลาดาเนินการไม่น้อยกว่า 15 ชั่วโมง This course provide practice for working or industrial training or training or other related",
    "description-en": "activities which reflect development of the management skills at least 15 hours."
  },
  {
    "id": "90643002",
    "name-th": "ปฏิบัติงานตามทักษะด้านการจัดการ 2",
    "name-en": "PRACTICE UNDER MANAGEMENT SKILLS 2",
    "credits": "2 (0-4-2)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดาเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านการจัดการโดยมีเวลาดาเนินการไม่น้อยกว่า 30 ชั่วโมง This course provide practice for working or industrial training or training or other related",
    "description-en": "activities which reflect development of the management skills at least 30 hours."
  },
  {
    "id": "90643003",
    "name-th": "ปฏิบัติงานตามทักษะด้านการจัดการ 3",
    "name-en": "PRACTICE UNDER MANAGEMENT SKILLS 3",
    "credits": "3 (0-6-3)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดาเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านการจัดการโดยมีเวลาดาเนินการไม่น้อยกว่า 45 ชั่วโมง This course provide practice for working or industrial training or training or other related",
    "description-en": "activities which reflect development of the management skills at least 45 hours."
  },
  {
    "id": "90643004",
    "name-th": "ผู้นาพลังบวก",
    "name-en": "POSITIVE POWER LEADER",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "หลักการสาคัญของการเป็น “ผู้นาพลังเชิงบวก” การพัฒนาภาวะความเป็นผู้นา การสร้างเสริมทัศนคติเชิง บวกในการทางานให้ทีมงาน จิตวิทยาการบริหารและจูงใจ",
    "description-en": "Study and practice the principle of being a positive leader, developing the leadership, building the positive attitude for teamworking, psychology in management and persuasion."
  },
  {
    "id": "90643005",
    "name-th": "นักเปลี่ยนโลก",
    "name-en": "THE DISRUPTOR",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ประสบการณ์ชีวิต แนวคิดการใช้ชีวิต การจัดการกับปัญหา หรืออุปสรรคในชีวิต การให้กาลังใจ พลัง ใจ การสร้างแรงบันดาลใจให้กับตนเองและผู้อื่น การจัดการความเสี่ยง การบริหารงาน บริหารคน และการพัฒนา ตนเอง การสื่อสารในโลกดิจิทัล จนประสบความสาเร็จในชีวิต",
    "description-en": "Learn life experiences, ways of thinking, approaches to solve complex problems or manage threats, ways to create self-motivation and inspire others. Study of risk management, administration, people management, self-development, and digital media communication, which drives to successful life."
  },
  {
    "id": "90643006",
    "name-th": "การจัดการและผู้นาสมัยใหม่",
    "name-en": "MODERN MANAGEMENT AND LEADERSHIP",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการการบริหารจัดการยุคใหม่ ทฤษฎีผู้น ายุคใหม่ และทฤษฎีผู้น ายุคปัจจุบัน ศึกษา ความสัมพันธ์ระหว่างการจัดการและภาวะผู้นา การเรียนรู้แนวทางการพัฒนาทักษะการจัดการ และทักษะภาวะความ เป็นผู้นา",
    "description-en": "Study modern management principles and modern leadership theories and modern leadership theories in contemporary period. Study the relationship between modern management and leadership. Learn to develop both managerial skills and leaderships skills."
  },
  {
    "id": "90643007",
    "name-th": "ภาวะผู้นาสาหรับคนรุ่นใหม่",
    "name-en": "NEXT GEN LEADERSHIP",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และฝึกฝนทักษะภาวะผู้นาสาหรับคนรุ่นใหม่ซึ่งประกอบด้วยการฝึกเป็นผู้ริเริ่ม กาหนด หรือเลือกสิ่ง ต่างๆ ก่อน ให้มีนิสัยเชิงรุกพร้อมรับมือโดยการคาดการณ์ไว้ก่อนเพื่อเตรียมพร้อมรับมือหากเกิดเหตุการณ์หรือสิ่งที่ไม่ พึ่งประสงค์เกิดขึ้น การตั้งเป้าหมายความสาเร็จในชีวิตและสร้างภาพความคิดให้ชัดเจนเพื่อจะนามาวางแผนการ ดาเนินการได้ง่ายขึ้น การรู้จักจัดเรียงความสาคัญของสิ่งที่จะต้องทาและเลือกทาในสิ่งที่สาคัญก่อน การมีทัศนคติที่ ชนะทั้งคู่โดยไม่เอาเปรียบใครและส่งเสริมการได้ประโยชน์ซึ่งกันและกันในทุกสถานการณ์ การสร้างนิสัยการฟังที่ดี เพื่อให้เข้าใจผู้อื่น การสร้างนิสัยการทางานเป็นทีมและการดึงจุดเด่นของแต่ละคนมาเป็นประโยชน์เพื่อการทางาน ร่วมกัน และการหมั่นพัฒนาตนเองอยู่เสมอ",
    "description-en": "Study and practice leadership skills for young generations including being proactive, setting goals and missions, prioritizing, building ‘win-win’ attitude, being deep listener, being a good player in a team, self-evaluating and willing to adjust yourself and so on in order to live and work in digital age"
  },
  {
    "id": "90643008",
    "name-th": "ศาสตร์การต่อรอง",
    "name-en": "SCIENCE OF NEGOTIATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาสถานการณ์การต่อรองโดยใช้ตรรกะการคิดแบบองค์รวมและวิธีการคิดแบบต่างๆ ศึกษาปัจจัย กระตุ้นให้เกิดการต่อรอง เรียนรู้ทฤษฎีความต้องการพื้นฐานของมนุษย์ที่เกี่ยวข้องกับการต่อรอง และเทคนิคการต่อรอง ศึกษากรณีตัวอย่างของการต่อรอง",
    "description-en": "Study the situations of negotiation with the use of holistic thinking approaches and thinking methods. Study the factors effecting negotiation, Maslow’s hierarchy of needs, and negotiation techniques. Learn from the case studies."
  },
  {
    "id": "90643010",
    "name-th": "การตลาดร่วมสมัย",
    "name-en": "CONTEMPORARY MARKETING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการตลาดร่วมสมัยและสมัยใหม่ รวมถึงการเปลี่ยนแปลงของพฤติกรรมผู้บริโภค การวิเคราะห์ สภาพแวดล้อมทางธุรกิจยุคใหม่ การแบ่งสัดส่วนตลาด การกาหนดกลุ่มเป้าหมาย การกาหนดตาแหน่งทางการตลาด ส่วนประสมทางการตลาด ผลิตภัณฑ์ ราคา ช่องทางการจัดจาหน่าย การส่งเสริมการตลาด จริยธรรมทางการตลาด การตลาดดิจิทัล",
    "description-en": "Study contemporary and new principles of marketing, changes in consumer behaviors, new business environment analysis, market segmentation, market target, market positioning, marketing mix : product ; price ; place and promotion, ethics in marketing, digital marketing."
  },
  {
    "id": "90643012",
    "name-th": "การทางานเป็นทีม",
    "name-en": "TEAMWORK",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมายและความสาคัญของการสร้างทีมงาน แนวคิดพื้นฐานในการพัฒนาองค์การ แนวคิด เกี่ยวกับการทางานเป็นทีม การพัฒนาการทางานเป็นทีม แผนการสื่อสารในทีม การเป็นผู้นาและผู้ตามที่ดี ประโยชน์ และอุปสรรคในการทางานเป็นทีม การบริหารความขัดแย้งในทีม ทักษะในการสร้างทีมงานที่มีประสิทธิผล การสร้าง ความภาคภูมิใจในทีมงาน ปัญหาในการสร้างทีมงานและแนวทางแก้ไข",
    "description-en": "Study working environments as a role of collaborators, team members, and team leaders under potential conflicts of simulated situations, learn how to overcome issues and developing the leadership to make a powerful team for success."
  },
  {
    "id": "90643013",
    "name-th": "การจัดการเชิงอุตสาหกรรม",
    "name-en": "INDUSTRIAL MANAGEMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเกี่ยวกับการจัดการการผลิต ขอบเขตและกระบวนการต่าง ๆ ของการจัดการการผลิต โครงสร้าง องค์กร การวางแผนและพัฒนาผลิตภัณฑ์ใหม่ การคาดการณ์การผลิต การวางแผนการผลิต รูปแบบการผลิตและ มาตรฐานการปฏิบัติงาน การจัดตารางการผลิต จัดการที่ตั้งการผลิต การจัดซื้อและการควบคุมสินค้าคงคลัง ควบคุม คุณภาพ อุตสาหกรรมการเงิน การบริหารงานบุคคล แรงงานสัมพันธ์ แรงจูงใจการทางานของบุคลากร การบารุงรักษา การผลิต และการจัดการด้านความปลอดภัย",
    "description-en": "This course provides a study of production management, the scope and various activities of production management, organization structures, planning and development of new products, forecasting of production, production planning, production layouts and operation standards, production scheduling, factory location, purchasing and inventory control, quality control, industrial finance, personnel management, labor relations, personnel motivation, production maintenance, and safety management."
  },
  {
    "id": "90643014",
    "name-th": "ความรู้ทั่วไปเกี่ยวกับธุรกิจ",
    "name-en": "GENERAL BUSINESS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมายของกระบวนการบริหาร โดยเป็นเนื้อหาในองค์การธุรกิจ การใช้ทรัพยากรทางการบริหาร ให้เป็นประโยชน์ต่อธุรกิจ รูปแบบของการดาเนินงานทางธุรกิจ การจัดองค์การ การสร้างมนุษยสัมพันธ์ ความเป็นผู้นา และการจูงใจบุคคลภายในองค์การ และการนาหลักการพื้นฐานและความรู้ทั่วไปทางด้านการตลาด การบริหารงาน บุคคล การบริหารการเงิน และการบัญชีมาใช้ในการบริหารธุรกิจขององค์การ",
    "description-en": "A study of the meaning of administration processes focusing on business, business resources and allocation, types of business organization, organizing, human relations, leadership, motivation and the implementation of basic principles and general knowledge of marketing, personnel management, finance and accounting in the business."
  },
  {
    "id": "90643015",
    "name-th": "การบัญชีทางธุรกิจสาหรับคนรุ่นใหม่",
    "name-en": "BUSINESS ACCOUNTING FOR NEW GEN",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาถึงแนวความคิดและความหมายทั่วไปของการบัญชี งบการเงิน สมการบัญชี การวิเคราะห์รายการ ค้า ขั้นตอนของการบันทึกข้อมูลทางการบัญชี ทฤษฎีการบัญชีคู่ การบันทึกรายการค้าในบัญชีแยกประเภท งบทดลอง และสมุดรายวันทั่วไป การปรับปรุงบัญชี และการปิดบัญชี",
    "description-en": "A study of concepts and meaning of accounting, financial statements, accounting equation, accounting transaction analysis, the recording of the accounting data, theory of double-entry bookkeeping, general and trail balance, closing and adjusting entries."
  },
  {
    "id": "90643016",
    "name-th": "สนุกกับธุรกิจออนไลน์",
    "name-en": "FUN WITH ONLINE BUSINESS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาธุรกิจออนไลน์เบื้องต้น โอกาสในการทาธุรกิจออนไลน์ รูปแบบการสร้างรายได้ออนไลน์ การตลาด ออนไลน์ การประมูลออนไลน์ กฎหมายและจริยธรรมกับการค้าออนไลน์ การสร้างธุรกิจออนไลน์ด้วยตนเอง",
    "description-en": "Study a basic of online based business and format of income channels in online market, including online auctions, ethics and law regarding to online transactions."
  },
  {
    "id": "90643018",
    "name-th": "ธุรกิจระหว่างประเทศ",
    "name-en": "INTERNATIONAL BUSINESS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเบื้องต้นเกี่ยวกับธุรกิจระหว่างประเทศ คาศัพท์ที่สาคัญในสาขาธุรกิจระหว่างประเทศ อัตราการ แลกเปลี่ยนระหว่างประเทศ ระบบการเงินระหว่างประเทศ ตลาดปริวรรตเงินตรา กฎหมายระหว่างประเทศและการ ปรับตัวของโลก องค์กรเหนือรัฐและสถาบันระหว่างประเทศ การตลาดระหว่างประเทศและการจัดการห่วงโซ่อุปทาน การพาณิชย์อิเล็กทรอนิกส์ วัฒนธรรมและธุรกิจระหว่างประเทศในระบบเศรษฐกิจของตลาดเกิดใหม่ และการจัดการ ด้านจริยธรรมในบริบทระหว่างประเทศ",
    "description-en": "Study the main components of international business, key vocabulary, Exchange Rates, International Monetary System, Foreign Exchange Market, International Law and Global Orientation, Supranational Organizations and International Institutions, International Marketing and Supply-Chain Management, E-Commerce, Culture and International Business in Emerging Markets and Ethical Management in the International Context."
  },
  {
    "id": "90643019",
    "name-th": "เศรษฐศาสตร์กับการเป็นผู้ประกอบการ",
    "name-en": "ECONOMICS AND ENTREPRENEURSHIP",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการทางด้านเศรษฐศาสตร์ การผลิต การกระจายและการบริโภคสินค้าและบริหาร เศรษฐศาสตร์ระดับจุลภาคและมหภาค รวมทั้งเรียนรู้การเป็นผู้ประกอบการ",
    "description-en": "Principle of economics; production, distribution and consumption of goods and services, macroeconomics; microeconomics; economics; entrepreneurship."
  },
  {
    "id": "90643020",
    "name-th": "นักพัฒนาธุรกิจสร้างสรรค์",
    "name-en": "INNOVATIVE ENTREPRENEURS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิดเกี่ยวกับการเป็นผู้ประกอบการเชิงสร้างสรรค์ โดยใช้เทคโนโลยีและนวัตกรรมเป็นเครื่องมือสู่ การเป็นผู้ประกอบการที่มีทักษะเชิงประยุกต์และสามารถส่งผ่านเทคโนโลยีและนวัตกรรม ให้เกิดเป็นธุรกิจเชิง สร้างสรรค์",
    "description-en": "Study concepts and roles of innovative entrepreneurs in association with technology and innovation application to build skillful entrepreneurs capable of creative business invention."
  },
  {
    "id": "90643021",
    "name-th": "ผู้ประกอบการสมัยใหม่",
    "name-en": "MODERN ENTREPRENEURS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาบทบาท ประเภทและคุณลักษณะของการเป็นผู้ประกอบการสมัยใหม่มีความรู้รอบด้านเกี่ยวกับ ธุรกิจ การจัดตั้งธุรกิจ องค์ประกอบของการแผนธุรกิจ กลยุทธ์ในการดาเนินการธุรกิจเพื่อเพิ่มโอกาสในการแข่งขัน การ สร้างความแตกต่าง การสร้างเอกลักษณ์ให้องค์กร การมุ่งตอบสนองความต้องการของลูกค้า",
    "description-en": "Study the roles, types and characteristics of being new entrepreneurship. Learn the comprehensive knowledge on business including business start-up, elements of business plan, strategies on running business for challenging the competition, building uniqueness, creating images to respond with the customers’ need."
  },
  {
    "id": "90643022",
    "name-th": "ผู้ประกอบการทางสังคม",
    "name-en": "SOCIAL ENTREPRENEURS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาบทบาทการเป็นผู้ประกอบการที่มองเห็นปัญหาของสังคม หรือการเพิ่มคุณค่าด้านประกอบการใน ชุมชนท้องถิ่น และใช้หลักของผู้ประกอบการในการออกแบบ และจัดระบบทางธุรกิจเพื่อบรรลุเป้าหมายในการ เปลี่ยนแปลงทางสังคมและการเพิ่มทุนทางสังคม ไม่เน้นกาไรส่วนบุคคล พร้อมกับคิดค้นวิธีการใหม่ๆ ในการแก้ไข ปัญหา เพื่อเปลี่ยนแปลงสังคมไปในทางที่ดีขึ้น",
    "description-en": "Study the role of social entrepreneur in selecting social problems of adding the value of local business by the principles of business both planning and managing the system in order to resolve those social problems without the emphasis on individual profit from the business. Explore possibility of creating new ways for solving the social problem and improving the society."
  },
  {
    "id": "90643023",
    "name-th": "ผู้ประกอบการเทคโนโลยี",
    "name-en": "TECHNOPRENEURS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษากระบวนการในการเริ่มต้นเป็นผู้ประกอบการเทคโนโลยี กลยุทธ์สาหรับก่อตั้งและพัฒนาการลงทุน ทางธุรกิจ การประเมินและการตระหนักถึงโอกาสของธุรกิจ การประสบความสาเร็จของผู้ประกอบการ การตลาด สาหรับการเป็นผู้ประกอบการ รูปแบบของการลงทุนแบบต่างๆ ที่สอดรับกับความก้าวหน้าทางเทคโนโลยี ศึกษากรณี ตัวอย่างการริเริ่มธุรกิจด้านเทคโนโลยี",
    "description-en": "Study and practice the begin of being technopreneurs, strategy of establish and investment development in business, evaluate the business opportunities and its successful, type of investments in technology market, case study of tech business."
  },
  {
    "id": "90643024",
    "name-th": "ฟาร์มสุข",
    "name-en": "HAPPINESS FARMS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาธรรมชาติของการทาฟาร์มด้านผลิตพืช สัตว์และสัตว์น ้า องค์ประกอบของการทาฟาร์ม การจัดการ ฟาร์ม การจัดการผลผลิตของฟาร์ม และประยุกต์ใช้การทาฟาร์มด้านการผลิตพืช สัตว์ และสัตว์น ้า รวมทั้งด้าน พัฒนาการเกษตรและนิเทศศาสตร์เกษตร เพื่อให้สอดคล้องกลมกลืนกับสภาพแวดล้อมในปัจจุบัน อย่างมีความสุข",
    "description-en": "Study on nature of farming in production of plants, animals and aquatic animals, farming composition, farm management, management for production for farms and application of farming in production of plants, animals and aquatic animals, including agricultural development and communication for harmonization with happiness."
  },
  {
    "id": "90643025",
    "name-th": "เส้นทางสู่ IPO",
    "name-en": "ROAD TO IPO",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมาย ความสาคัญ และหลักการเบื้องต้นของ IPO การเตรียมความพร้อมธุรกิจและการจัด โครงสร้างองค์กร การวางแผนค่าใช้จ่ายต่างๆ การจัดการบัญชี และกฎหมายที่เกี่ยวข้อง เพื่อเข้าตลาดหลักทรัพย์ หน้าที่ และความรับผิดชอบของตาแหน่งต่างๆขององค์กร การบริหารความเสี่ยงองค์กร การจัดการความขัดแย้งทาง ผลประโยชน์เพื่อการบริหารงานเพื่อความโปร่งใสเพื่อเป็นองค์กรที่มีธรรมาภิบาล การวางเป้าหมายและการ เขียน Road map การออกแบบแผนธุรกิจที่จะท าองค์กรเข้า IPO กระบวนการนาเข้า IPO Study the principles of meaning importance and principle of IPO (Initial Public Offering),",
    "description-en": "business preparation and organization structure management, cost planning, accounting management and regulations for stock exchange, functions and accountabilities of all relative parties in organization, risk management and conflict of interest management of organization for good governance organization, Target setting and design road map of organization, business plan for IPO, process of entering IPO."
  },
  {
    "id": "90643026",
    "name-th": "การวางแผนเพื่อการลงทุน",
    "name-en": "INVESTMENT PLANNING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาประเภทของการลงทุน ทฤษฎีการเงินที่ใช้เพื่อการลงทุน การบริหารความเสี่ยงในการลงทุน หลักการ วิเคราะห์และการลงทุนเพื่อผลตอบแทนที่คุ้มค่า การคานวณหาความคุ้มค่าในการลงทุน",
    "description-en": "Study types of investment, finance theories related to investment, risk management, analysis of investment for cost effectiveness, calculation cost effectiveness on investment."
  },
  {
    "id": "90643027",
    "name-th": "มนุษย์เงิน และคณิตศาสตร์",
    "name-en": "MAN, MONEY AND MATH",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการทางคณิตศาตร์ที่เกี่ยวข้องในการใช้ชีวิตประจาวัน การทาความเข้าใจ และการนาไป ประยุกต์ให้ชีวิตมีความสุขและยั่งยืน โดยมุ่งเน้นความสัมพันธ์ ความสอดคล้องและความสมดุล ในด้านการบริหาร จัดการ ด้านการใช้เงิน การออม และการลงทุนในสินทรัพย์ประเภทต่างๆ เช่น เงินฝาก พันธบัตร หุ้นกู้ หุ้นสามัญ ตลอดจนสินทรัพย์ประเภทอื่นๆ ตามความเหมาะสม และความถนัดของแต่ละบุคคล",
    "description-en": "Study the principles of mathematics related to daily life, understanding and applying this fundamental to have sustainably happiness by focusing the relation and the balance of own management on money usage, on saving and investment for instance, saving money, government bond, stock market and other interesting properties."
  },
  {
    "id": "90643028",
    "name-th": "มือใหม่(หัด) เล่นหุ้น",
    "name-en": "SMART TIPS FOR BEGINNING INVESTERS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความรู้เบื้องต้นและหลักการเกี่ยวกับการลงทุน ความรู้เรื่องตลาดหลักทรัพย์ การวางแผน ทางการเงิน การลงทุนในตลาดหลักทรัพย์/ตลาดทุน ขั้นตอนการลงทุนและการบริหารพอร์ตการลงทุน การวิเคราะห์ ปัจจัยพื้นฐานและปัจจัยทางเทคนิค ช่วงเวลาการลงทุนที่เหมาะสมและการตัดสินใจในผลตอบแทนจากหุ้น",
    "description-en": "Study basic knowledge and principles of investment, the stock exchange and financial planning investment in the stock market / capital market, investment process and portfolio management, Analysis of basic factors and technical factors, The appropriate investment period and decision-making on stock returns."
  },
  {
    "id": "90643029",
    "name-th": "เศรษฐกิจดิจิทัล",
    "name-en": "DIGITAL ECONOMY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้หลักการทางเศรษฐศาสตร์เพื่อให้เข้าใจและสามารถอธิบายการขยายตัวเศรษฐกิจโลก รวมทั้งการ ประยุกต์ใช้ข้อมูลและเทคโนโลยีการสื่อสารเพื่อการวิเคราะห์ประเด็นต่างๆ ของเศรษฐกิจดิจิทัล",
    "description-en": "This course will develop and utilize economic principles to better understand and explain the expansion and integration of information and communications technologies into the global economies. It will provide an introduction to concepts and theories useful in analyzing economic aspects of the digital and information technology revolutions."
  },
  {
    "id": "90643030",
    "name-th": "เศรษฐศาสตร์ทั่วไปและการศึกษาความเป็นไปได้ของโครงการ",
    "name-en": "GENERAL ECONOMICS AND PROJECT FEASIBILITY STUDY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมายและหลักทั่วไปของเศรษฐศาสตร์ว่าด้วยมูลค่า ราคา และการจัดสรรทรัพยากร ทฤษฎี เบื้องต้นเกี่ยวกับพฤติกรรมผู้บริโภคและผู้ผลิต ทฤษฎีเน้นปัจจัยต่าง ๆ ที่กาหนดอุปสงค์และอุปทานของสินค้า ศึกษา การกาหนดราคา และประสิทธิภาพของการใช้ทรัพยากรในตลาดที่มีการแข่งขันอย่างสมบูรณ์และไม่สมบูรณ์ ศึกษา เกี่ยวกับความหมายของความเป็นไปได้ของโครงการ ความสาคัญ การจัดทา และขั้นตอนในการศึกษาถึงความเป็นไป ได้ของโครงการ รายละเอียดของการวิเคราะห์ความเป็นไปได้ทางด้านต่างๆ ที่เกี่ยวข้องกับการดาเนินโครงการทั้ง ทางด้านการจัดการ การผลิต การตลาด การเงิน สภาพแวดล้อมที่มีผลกระทบต่อโครงการ",
    "description-en": "A study of the meaning and general principles of economics: values, prices and resource allocation; fundamental theories in consumer and firm consumer and behavior with an emphasis on factors affecting product’s demand and supply, as well as a study of price determination and efficiency in resource allocation both in perfect competitive and imperfect competitive markets. A study of definitions of project feasibility; importance, procedures and steps of project feasibility study, details of feasibility analysis relating to project operations including management, production, marketing, finance, and project environments."
  },
  {
    "id": "90643031",
    "name-th": "วิถีชีวิตตามแนวคิดเศรษฐกิจหมุนเวียนในศตวรรษที่ 21",
    "name-en": "CIRCULAR ECONOMIC LIFESTYLE FOR 21st CENTURY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การเรียนรู้คุณค่าธรรมชาติต่อการดารงชีวิตของมนุษย์ในด้านการนาทรัพยากรมาใช้ประโยชน์ และการ เป็นแหล่งรองรับและบาบัดมลพิษ ภาวะวิกฤติของปัญหาด้านทรัพยากร สถานการณ์ฉุกเฉินด้านสภาพภูมิอากาศและ สิ่งแวดล้อม แนวคิดโดยตลอดวัฏจักรชีวิตและกระบวนการออกแบบธุรกิจภายใต้แนวคิด เศรษฐกิจหมุนเวียน นวัตกรรม โมเดลธุรกิจสู่เศรษฐกิจหมุนเวียนวิถีชิวิตภายใต้แนวคิดเศรษฐกิจหมุนเวียน ความตระหนักและแรงผลักดันสู่วิถีชีวิต ภายใต้แนวคิดเศรษฐกิจหมุนเวียนและสังคมเศรษฐกิจหมุนเวียน",
    "description-en": "Learning the value of nature to human life in the use of resources and being a source of support and pollution treatment, crisis of resource problems, climate and environmental emergency situations, concepts throughout the life cycle and business design process under the concept of circular economy, business model innovation to the circular economy, lifestyle under the concept of circular economy, awareness and driving force to the way of life under the concept of circulating economy and circulating economy society."
  },
  {
    "id": "90643032",
    "name-th": "ปักหมุดเศรษฐกิจ",
    "name-en": "BCG ECONOMY IN ACTION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การฝึกทักษะการคิดอย่างมีวิจารณญาณและนาไปสู่การคิดเพื่อแก้ไขปัญหาภาวะวิกฤติของทรัพยากร ชีวภาพ พร้อมทั้งฝึกทักษะการคิดเชิงออกแบบและลงมือปฏิบัติในการพัฒนาเศรษฐกิจ 3 ด้าน ได้แก่เศรษฐกิจชีวภาพ เศรษฐกิจหมุนเวียน และเศรษฐกิจสีเขียว โดยด้านเศรษฐกิจชีวภาพเน้นการนาความรู้เทคโนโลยี และนวัตกรรม มา พัฒนาต่อยอดจากฐานความเข้มแข็งเดิม เพื่อเพิ่มมูลค่าให้กับสินค้าเกษตร ด้านเศรษฐกิจหมุนเวียนเน้นการน า ทรัพยากรมาใช้ให้เกิดประโยชน์สูงสุดและคุ้มค่าที่สุด ที่สาคัญคือการมุ่งไปที่การลดปริมาณของเสียให้น้อยลงหรือ เท่ากับศูนย์ ด้วยการปรับกระบวนการผลิต และด้านเศรษฐกิจสีเขียวเน้นการลดผลกระทบต่อโลกอย่างยั่งยืน โดยเฉพาะความยั่งยืนด้านสิ่งแวดล้อม",
    "description-en": "Develop critical thinking skills which lead to ideas for solving bio-resources crisis, and practice design thinking skills and economics development in three aspects: Bioeconomy(B), Circular Economy (C), and Green Economy (G). Bioeconomy focuses on applying knowledge, technology and innovation to build on developed strengths aiming to add value to agricultural products. Circular Economy focuses on design for optimize resource use and especially minimize trash or leaving zero waste. Green Economy aims to reduce environmental impact in long term and particularly aims for environmental sustainability."
  },
  {
    "id": "90643034",
    "name-th": "การจัดการกับความคิดสร้างสรรค์",
    "name-en": "MANAGEMENT AND CREATIVITY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การจัดการศิลปะเป็นกระบวนการหลังการผลิต (Post-Production) ซึ่งศิลปินหรือผู้สร้างสรรค์ จาเป็นที่ ต้องนาความรู้ในศาสตร์และวิธีคิดในด้านการจัดการนี้มาใช้โดยมีวัตถุประสงค์เพื่อศึกษาและเข้าใจในการจัดการอย่าง สร้างสรรค์ทั้งนี้เพื่อช่วย ให้กระบวนการผลิตงานสร้างสรรค์เป็นไปอย่างมีประสิทธิภาพ และเพื่อบรรลุเป้าหมายของการ สื่อสารผลงานสร้างสรรค์ในกระบวนการหลังการผลิต",
    "description-en": "Art management is the post-production that is required by artist or creator to utilize knowledge and thinking method, by aiming to study and understand creative management, in order to facilitate the efficiency of creative art production, as well as to fulfill the purpose of creative art communication in post-production."
  },
  {
    "id": "90643035",
    "name-th": "การจัดการความรู้เพื่อการพัฒนานวัตกรรม",
    "name-en": "KNOWLEDGE MANAGEMENT FOR INNOVATION DEVELOPMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ความหมายและบทบาทของการจัดการความรู้ในการพัฒนานวัตกรรม กระบวนการจัดการความรู้ รูปแบบการจัดการความรู้ เครื่องมือที่ใช้ในการจัดการความรู้ ปัจจัยที่ส่งผลต่อการจัดการความรู้ การประยุกต์ใช้การ จัดการความรู้ในบริบทต่างๆ หลักการของอภิมหาข้อมูล แนวคิดและประเภทของนวัตกรรมกระบวนการพัฒนา นวัตกรรม และความสัมพันธ์ของการจัดการความรู้ นวัตกรรม และ การจัดการอภิมหาข้อมูล",
    "description-en": "Learn definitions and role of knowledge management in innovation development,knowledge management processes, knowledge management models, tools for knowledge management, the factors impacting on knowledge management, application of knowledge management in various contexts, principles of big data, concepts and types of innovation, innovation development process, and the relationship of knowledge management with innovation and big data management."
  },
  {
    "id": "90643036",
    "name-th": "การจัดการความรู้เพื่อการบริหารโครงการ",
    "name-en": "KNOWLEDGE MANAGEMENT FOR PROJECT MANAGEMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมายและความสาคัญของการจัดการความรู้ กระบวนการจัดการความรู้ รูปแบบการจัดการ ความรู้ เครื่องมือที่ใช้ในการจัดการความรู้ในการบริหารโครงการ แนวคิดการบริหารงานโครงการ วงจรชีวิตของโครงการ ประเภทของโครงการ ลักษณะของการทางานโครงการ ปัจจัยที่ส่งผลต่อการจัดการความรู้ในโครงการ และการประยุกต์ การจัดการความรู้ในบริบทของโครงการ",
    "description-en": "Study definitions and importance of knowledge management, knowledge management processes in project, knowledge management models in project, tools for knowledge management in project, concepts of project management, project life cycle, types of projects, the nature of project work, the factors impacting on knowledge management in projects, and application of knowledge management in project context."
  },
  {
    "id": "90643037",
    "name-th": "การบริหารงานภาครัฐและนโยบายสาธารณะในศตวรรษที่ 21",
    "name-en": "PUBLIC ADMINISTRATION AND PUBLIC POLICY IN THE 21st CENTURY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การศึกษาแนวคิดและกรณีศึกษาของการบริหารงานภาครัฐและนโยบายสาธารณะในศตวรรษที่ 21 การ น าเป้าหมายการพัฒนาที่ยั่งยืน (SDGs) มาปฏิบัติในส่วนราชการ รวมถึงการศึกษานโยบายสาธารณะที่ประสบ ความสาเร็จจากประเทศพัฒนาแล้ว เพื่อให้ทราบถึงปัจจัยและสิ่งกาหนดที่สาคัญของนโยบายสาธารณะสมัยใหม่และ การบริหารงานภาครัฐในเชิงปฏิบัติ",
    "description-en": "A study of the concepts and the case studies of public administration and public policy in the 21st century; the adoption of the Sustainable Development Goals (SDGs) in public sectors, including a study of the successful public policies of developed countries in order to understand significant factors and determinants for practical public administration and modern public policy."
  },
  {
    "id": "90643038",
    "name-th": "ศัลยกรรมชีวิต",
    "name-en": "REBRANDING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและปรับใช้แนวคิด ทฤษฎี และหลักการสาคัญที่เกี่ยวข้องกับการเปลี่ยนโฉม (Rebranding) เข้ากับ การใช้ชีวิต การวิเคราะห์สภาพปัจจุบันและสภาพที่พึงประสงค์ของตนเองและปัจจัยภายนอก การพัฒนาคุณสมบัติ และภาพลักษณ์ส่วนบุคคลที่สอดคล้องกับเป้าหมายของตนเองและสังคม การดารงตนให้เหมาะสมกับการเปลี่ยนแปลง และสถานการณ์ที่แตกต่าง",
    "description-en": "Study concepts, theories, and principles of rebranding and apply into lifestyle, Selfanalysis of current practice and future expectations for the identification of issues needed for rebranding. Develop self-images and looks in alignment with societal, technological,economical, and political impacts on life as well as improve self in appropriation to the various and ever-changing situation."
  },
  {
    "id": "90643039",
    "name-th": "นวัตกรรม สจล.",
    "name-en": "KMITL INNOVATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "แนวคิดการออกแบบและสร้างนวัตกรรม กระบวนการออกแบบและสร้างนวัตกรรมของ สจล. แนวทางการ ค้นคว้าวิจัย การออกแบบ การผลิตนวัตกรรมต้นแบบ การเผยแพร่ผลงานวิชาการให้เป็นที่ยอมรับ การนาผลงาน วิชาการไปใช้ในเชิงพาณิชย์ หรือเพื่อสาธารณะประโยชน์",
    "description-en": "Design and innovation concept; KMITL’s design and innovation process; innovative prototype research and design guideline; academic work dissemination; applications of an academic work for commercial or public benefits."
  },
  {
    "id": "90643040",
    "name-th": "ผู้นาในฐานะโค้ช",
    "name-en": "LEADERSHIP AS A COACH",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "นิยามของโค้ช บทบาทของโค้ช ความแตกต่างระหว่างโค้ชกับผู้สอน การกาหนดเป้าหมาย การรับฟังอย่าง ตั้งใจ การใช้คาถามที่ทรงพลัง การให้ข้อมูลป้อนกลับเชิงบวก เครื่องมือของการโค้ช การพัฒนาทีมงานด้วยการโค้ช",
    "description-en": "Definition of coach; role of coach; differences between coach and instructor; goal setting; deep listening; asking powerful questions; providing positive feedback; coaching tools; team development through coaching."
  },
  {
    "id": "90643041",
    "name-th": "ธรรมาภิบาลสากล",
    "name-en": "GLOBAL GOVERNANCE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาทฤษฎี และแนวคิดธรรมาภิบาล ที่มา ความสาคัญ กระบวนการ กลไกต่างๆ และแนวทางที่ถูก นาไปใช้ในบริบทที่แตกต่างกัน ทั้งในระดับประเทศ และระดับสากล รวมทั้ง การนาไปประยุกต์ใช้ในมิติภาครัฐและ เอกชน",
    "description-en": "Study the theories and concepts of governance including the background, importance, processes, mechanisms, the way to apply for both domestic and global contexts as well as the utilization of this concept in public and private sectors."
  },
  {
    "id": "90643042",
    "name-th": "ฮาร์ดเพาเวอร์และซอฟท์เพาเวอร์",
    "name-en": "HARD POWER AND SOFT POWER",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาแนวคิดและทฤษฎีของ Hard Power และ Soft Power ภูมิหลังความเป็นมา ความสาคัญ รูปแบบ การใช้งาน พร้อมตัวอย่างในบริบทโลกที่สาคัญต่างๆ รวมทั้ง ประโยชน์และข้อจากัดของการใช้ แนวทางการประยุกต์ใช้ สาหรับอนาคต",
    "description-en": "Study of the concepts and theories of Hard and Soft Power including background, importance, patterns, utilization with important case studies in global context as well as the benefits and challenges of using both power and the ways to apply in the future."
  },
  {
    "id": "90643043",
    "name-th": "ธุรกิจดนตรี",
    "name-en": "MUSIC BUSINESS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาธุรกิจดนตรี ตั้งแต่ก่อกำเนิดผ่านนวัตกรรมการผลิตสื่อและสิ่งบันทึกเสียงที่เปลี่ยนแปลงไปจนถึงปัจจุบัน การบริหารค่ายเพลงในยุคดิจิทัล อนาคตของธุรกิจดนตรีและการปรับตัว รวมถึงกฎหมายลิขสิทธิ์ที่เกี่ยวข้อง",
    "description-en": "study music business Since its inception through the innovation of media production and sound recording that has changed to the present. Management of music labels in the digital age The future of the music business and improvisation including the relevant copyright laws."
  },
  {
    "id": "90643044",
    "name-th": "ลีนสตาร์ทอัพและแนวคิดธุรกิจแบบคล่องตัว",
    "name-en": "LEAN STARTUP AND AGILE BUSINESS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาโครงสร้างและคุณลักษณะเฉพาะของไมโครคอมพิวเตอร์ เทคนิคการประยุกต์ใช้เทคโนโลยี ไมโครคอมพิวเตอร์ การใช้ซอฟท์แวร์ที่จำเป็นต่างๆ ในตระกูลไมโครซอฟท์ และระบบการจัดการฐานข้อมูล เป็นต้น รวมทั้ง เรียนรู้เทคโนโลยียุคปัจจุบันรวมถึงแนวโน้มของการใช้ไมโครคอมพิวเตอร์สำหรับอนาคต",
    "description-en": "This course covers the basic principles of lean startup and agile business practice. Students will learn how to create an innovation accounting system to build products that meets customer demands; find the easiest and fastest ways to build minimum viable products to reduce time-to-market; learn tactics for improvement and measure customers’ needs such as experimenting landing pages, A/B tests, MVPs on real customers; study how to implement an agile culture in business environments and learn how to develop business structures in order to keep the business functioning on constantly-moving units."
  },
  {
    "id": "90643045",
    "name-th": "การจัดการนวัตกรรม",
    "name-en": "INNOVATION MANAGEMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษากระบวนการคิดเชิงนวัตกรรมและการปฏิบัติในการบริหารจัดการนวัตกรรม โดยฝึกให้เรียนรู้ในหัวข้อ การจัดการองค์กร การวางแผนกลยุทธ์ การพัฒนานโยบาย ชุมชน การวิจัยและพัฒนา รวมทั้งการจัดการผลิตภัณฑ์ ฝึกคิด วิเคราะห์ประเด็นที่ท้าทายต่อการบริหารจัดการองค์กร เรียนรู้แนวปฏิบัติที่ดีจากผู้เชี่ยวชาญหรือผู้มีประสบการณ์การ บริหารจัดการเชิงนวัตกรรม",
    "description-en": "This course introduces students to the concepts of innovative thinking and innovation management practices. This course prepares students with the insights and instruction necessary to successfully lead worldwide enterprises or local ventures. Covered topics include organization, strategy planning, policy development, communities, research and development and product management. Students are exposed to issues that challenged real-world organizations. Students will learn best practices used by engineering leaders who successfully develop commercially viable products and services, create efficient operating processes, manage profitable organizations, and transform companies into industry leaders."
  },
  {
    "id": "90644001",
    "name-th": "ปฏิบัติงานตามทักษะด้านการสื่อสาร 1",
    "name-en": "PRACTICE UNDER LANGUAGE AND COMMUNICATION SKILLS 1",
    "credits": "1 (0-2-1)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดำเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านภาษาและการสื่อสารโดยมีเวลาดำเนินการไม่น้อยกว่า 15 ชั่วโมง This course provide practice for working or industrial training or training or other related",
    "description-en": "activities which reflect development of the communication skills at least 15 hours."
  },
  {
    "id": "90644002",
    "name-th": "ปฏิบัติงานตามทักษะด้านการสื่อสาร 2",
    "name-en": "PRACTICE UNDER LANGUAGE AND COMMUNICATION SKILLS 2",
    "credits": "2 (0-4-2)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดำเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านภาษาและการสื่อสารโดยมีเวลาดำเนินการไม่น้อยกว่า 30 ชั่วโมง This course provide practice for working or industrial training or training or other related",
    "description-en": "activities which reflect development of the communication skills at least 30 hours."
  },
  {
    "id": "90644003",
    "name-th": "ปฏิบัติงานตามทักษะด้านการสื่อสาร 3",
    "name-en": "PRACTICE UNDER LANGUAGE AND COMMUNICATION SKILLS 3",
    "credits": "3 (0-6-3)",
    "prerequisite": null,
    "description-th": "เป็นการปฏิบัติงาน หรือการฝึกงาน หรือการฝึกอบรม หรือกิจกรรมอื่นๆ ที่สื่อให้เห็นถึงการดำเนินการที่ เกี่ยวกับการพัฒนาทักษะด้านภาษาและการสื่อสารโดยมีเวลาดำเนินการไม่น้อยกว่า 45 ชั่วโมง This course provide practice for working or industrial training or training or other related",
    "description-en": "activities which reflect development of the communication skills at least 45 hours."
  },
  {
    "id": "90644009",
    "name-th": "การออกเสียงภาษาอังกฤษเบื้องต้น",
    "name-en": "BASIC ENGLISH PRONUNCIATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกฝนระบบเสียงและระดับเสียงในภาษาอังกฤษ โดยเน้นสัทอักษรในระบบเสียงภาษาอังกฤษ การ ออกเสียงสระและพยัญชนะ การเน้นเสียงในระดับคำและระดับประโยค และสำเนียงภาษาอังกฤษในปัจจุบัน",
    "description-en": "A study and practice of English sound systems and intonation, focusing on the study of phonetic alphabets, the pronunciation of English vowel and consonant sounds, word and sentence stress, and different accents in today’s English."
  },
  {
    "id": "90644010",
    "name-th": "การพัฒนาทักษะการอ่านและการเขียนภาษาอังกฤษ",
    "name-en": "DEVELOPMENT OF READING AND WRITING SKILLS IN ENGLISH",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาวิธีการอ่านอย่างมีประสิทธิภาพ การอ่านจับใจความ การอ่านหนังสือพิมพ์ การอ่านเพื่อแปลใจความ การพัฒนาทักษะการเขียน โดยเน้นการเขียนที่ถูกรูปแบบทางภาษาและไวยากรณ์ ฝึกการเขียนที่จะนำไปใช้ประโยชน์ทั้ง ทางด้านการศึกษาและอาชีพ เช่น การเขียนจดหมาย การกรอกใบสมัคร การเขียนรายงาน เป็นต้น",
    "description-en": "Study effective reading techniques in English relevant to reading for the main idea, newspaper reading, reading for translation, writing skills development in English focusing on accuracy in both language forms and grammar beneficial to careers and academic purposes such as writing application letters, filling application forms, writing reports, etc."
  },
  {
    "id": "90644011",
    "name-th": "ภาษาอังกฤษเชิงวิชาการ",
    "name-en": "ENGLISH FOR ACADEMIC PURPOSES",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "พัฒนาทักษะทางภาษาอังกฤษและการเรียนเชิงวิชาการที่เกี่ยวข้องกับความสนใจของตนเอง โดยเน้นการฟัง บรรยาย การมีส่วนร่วมในการอภิปรายกลุ่ม การนำเสนอผลงาน การอ่านและเขียนข้อเขียนเชิงวิชาการ",
    "description-en": "Develop language and study skills in English for academic purposes related to personal interests, focusing on listening to lectures, participating in group discussions, giving oral presentations, reading and writing academic texts."
  },
  {
    "id": "90644012",
    "name-th": "ภาษาอังกฤษเพื่อการสื่อสาร",
    "name-en": "ENGLISH FOR COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกฟัง พูด อ่านและเขียน ภาษาอังกฤษ ในบริบทที่เกี่ยวข้องกับการสื่อสาร การทักทาย การนัดหมาย การ สนทนาในชีวิตประจำวัน การเจรจาต่อรอง การนำเสนองาน การแสดงความคิดเห็น การอ่านจับใจความสำคัญจากสื่อต่างๆ การเขียนเพื่อการสื่อสารในรูปแบบอีเมล์",
    "description-en": "Practice listening, speaking, reading and writing in communicative contexts such as greeting, making appointments, communicating in daily life situations, negotiating, presenting work-related assignments and ideas, reading for main ideas from different rhetorical patterns, and writing emails."
  },
  {
    "id": "90644013",
    "name-th": "การเขียนภาษาอังกฤษเพื่อการสื่อสาร",
    "name-en": "ENGLISH FOR COMMUNICATIVE WRITING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกการเขียนเพื่อการสื่อสารอย่างมีประสิทธิภาพในบริบทต่าง ๆ โดยเน้นการฝึกการเขียนจดหมาย ในลักษณะต่าง ๆ เขียนรายงาน คำสั่ง คู่มือ และกระบวนการต่าง รวมทั้งการเขียนบรรยายสิ่งของ สถานที่ และเหตุการณ์",
    "description-en": "A study and effective practice in English communicative writing in various contexts Focusing on letters, reports instructions, manuals, and as a description of things, places, and events."
  },
  {
    "id": "90644014",
    "name-th": "ภาษาอังกฤษเพื่อการสื่อสารทางวิชาชีพ",
    "name-en": "ENGLISH FOR PROFESSIONAL COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และฝึกทักษะภาษาอังกฤษที่ใช้ในการติดต่อสื่อสาร โดยเน้นทักษะในการฟังและการพูดในโอกาสต่าง ๆ รวมทั้งพัฒนาทักษะการสนทนา การอภิปราย การแสดงความคิดเห็น การกล่าวสุนทรพจน์ และการเสนอผลงานทางวิชาชีพ ต่อที่ประชุม",
    "description-en": "Learn and practice English communication skills emphasizing listening and speaking skills for various occasions, including the development of skills in conversation, discussion, exchanges of opinions, speech making and academic paper presentation in public."
  },
  {
    "id": "90644015",
    "name-th": "ภาษาอังกฤษเพื่อการศึกษาต่อ",
    "name-en": "ENGLISH FOR FURTHER STUDIES",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกการใช้ภาษาอังกฤษเพื่อการศึกษาต่อในระดับบัณฑิต โดยเน้นฝึกการอ่านข้อเขียนทางวิชาการ การย่อความ การฟัง และการเขียนโน้ตย่อ รวมทั้งฝึกทำข้อทดสอบทางภาษาอังกฤษในรูปแบบต่างๆ",
    "description-en": "Study and practice of English for further graduate study focusing on academic reading, summary writing, listening and note–taking, including a practice in doing various kinds of English test paper."
  },
  {
    "id": "90644016",
    "name-th": "อังกฤษเพื่ออุตสาหกรรม",
    "name-en": "ENGLISH FOR INDUSTRY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกใช้ภาษาอังกฤษในวงการอุตสาหกรรมในรูปแบบต่างๆ เช่น การบรรยายกระบวนการผลิต การ อธิบายการใช้อุปกรณ์ หรือการทำงานของเครื่องจักร การอธิบายความปลอดภัยในที่ทำงาน การเขียนป้ายเตือนอันตราย การเขียนคำสั่ง การฝึกฝนทักษะการสื่อสารทั้งการพูดและการเขียนในที่ทำงาน",
    "description-en": "Study and practice different industrial aspects: describing production processes; explaining how to use equipment or how to operate machines; explaining safety at work; writing warnings and instructions, applying communication skills both speaking and writing related to work."
  },
  {
    "id": "90644017",
    "name-th": "ภาษาอังกฤษสำหรับธุรกิจ",
    "name-en": "ENGLISH FOR BUSINESS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกการใช้ภาษาอังกฤษเพื่อการสื่อสารทางธุรกิจ โดยเน้นความเข้าใจในการอ่านข้อเขียนทางธุรกิจ ประเภทต่าง ๆ การใช้ศัพท์ สำนวน และภาษาในเชิงธุรกิจ การเขียนจดหมายบันทึกช่วยจำ รวมทั้งการฝึกฟังและพูดใน สถานการณ์ต่าง ๆ ทางธุรกิจ",
    "description-en": "Study and practice English for business communication, with emphasis on reading texts from various kinds of business, on vocabulary and expression usage in business contexts, on writing business letters, memos, and on listening and speaking in various situations of business."
  },
  {
    "id": "90644018",
    "name-th": "ภาษาอังกฤษเพื่อการตลาด",
    "name-en": "ENGLISH FOR MARKETING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกใช้โครงสร้างภาษา คำศัพท์และสำนวนจากบริบทที่เกี่ยวกับการตลาดซึ่งคัดเลือกเนื้อหาด้าน การตลาดที่เป็นเนื้อหาจริงมาให้ฝึก โดยเน้นทักษะการอ่านเพื่อความเข้าใจพร้อมทั้งประยุกต์ความรู้ที่ได้ศึกษามา",
    "description-en": "Study and practice language structures, vocabulary and expressions in marketing contexts extracted from authentic marketing materials with an emphasis on reading comprehension, including the application of knowledge studied."
  },
  {
    "id": "90644019",
    "name-th": "ภาษาอังกฤษเพื่อการจัดการ",
    "name-en": "ENGLISH FOR MANAGEMENT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกใช้โครงสร้างภาษา คำศัพท์และสำนวนจากบริบทที่เกี่ยวกับการจัดการซึ่งคัดเลือกเนื้อหาด้าน การจัดการที่เป็นเนื้อหาจริงมาให้ฝึก โดยเน้นทักษะการอ่านเพื่อความเข้าใจพร้อมทั้งประยุกต์ความรู้ที่ได้ศึกษามา",
    "description-en": "Study and practice language structures, vocabulary and expressions in management contexts extracted from authentic management materials with an emphasis on reading comprehension, including the application of knowledge studied."
  },
  {
    "id": "90644020",
    "name-th": "ภาษาอังกฤษเพื่อความเข้าใจข่าวสาร",
    "name-en": "ENGLISH FOR MEDIA",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาภาษาอังกฤษในสื่อสารมวลชนรูปแบบต่างๆ เช่นหนังสือพิมพ์ นิตยาสาร โฆษณา เว็บไซต์ รายการวิทยุ และโทรทัศน์ เพื่อเข้าใจข่าวสารและเนื้อหา",
    "description-en": "Study English in various types of mass media such as newspapers, magazines, advertisements, website, radio, and television in order to understand news and information."
  },
  {
    "id": "90644022",
    "name-th": "ภาษาอังกฤษสำหรับมืออาชีพ",
    "name-en": "ENGLISH FOR PROFESSIONAL PURPOSES",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การพัฒนาทักษะทางภาษาที่จำเป็นสำหรับจุดประสงค์ทางวิชาชีพ: การอ่าน คู่มือและสัญญาณทางเทคนิค การเขียนและการวิจัยเชิงวิชาการการเขียนจดหมายสมัครงานประวัติย่อบันทึกช่วยจำรายงานบทคัดย่ออีเมลการเรียก ประชุมรายงานการประชุมและการดำเนินการ ฝึกการสัมภาษณ์การอภิปรายงานและการนำเสนองาน",
    "description-en": "Development of language skills necessary for professional purposes: reading manuals and technical signs; academic writing and research, writing job application letter, resumes, memos, reports, abstracts, emails, calls for meeting, minutes and proceedings; practicing interviews, job discussion and work presentation."
  },
  {
    "id": "90644023",
    "name-th": "ภาษาอังกฤษเพื่อเตรียมตัวทำงาน",
    "name-en": "ENGLISH FOR WORK PREPARATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "พัฒนาทักษะการใช้ภาษาอังกฤษที่จำเป็นต่อการปฏิบัติงาน เช่น การอ่านคู่มือ เครื่องหมายสัญลักษณ์ที่ใช้ใน งานอาชีพ การเขียนจดหมายสมัครงาน การเขียนประวัติย่อ บันทึกข้อความ บทคัดย่อ รายงาน จดหมายอิเล็กทรอนิกส์ จดหมายเชิญประชุม บันทึกและรายงานการประชุม รวมทั้งฝึกการสัมภาษณ์ การอภิปรายต่อที่ประชุม และการนำเสนอ ผลงาน",
    "description-en": "Develop language skills necessary for professional purposes: reading manuals and technical signs; writing job application letter, resumes, memos, reports, abstracts, emails, calls for meeting, minutes and proceedings; practicing interviews, job discussion and work presentation."
  },
  {
    "id": "90644024",
    "name-th": "ภาษาอังกฤษเพื่อการท่องเที่ยวและการเดินทาง",
    "name-en": "ENGLISH FOR TOURISM AND TRAVELLING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาคำศัพท์และการใช้ภาษาเกี่ยวกับการเดินทาง ธุรกิจการท่องเที่ยว การโรงแรม ร้านอาหาร สนามบิน ฯลฯ พร้อมทั้งฝึกทักษะการฟัง การพูด การอ่านและการเขียนในปริบทดังกล่าว เช่น การทักทาย การต้อนรับ การเดินทาง การแนะนำสถานที่ท่องเที่ยว การวางแผน การหาและสอบถามข้อมูลการเดินทาง การถามทาง การผ่านด่านตรวจคนเข้า เมืองและศุลกากร ตลอดจนความรู้ทั่วไปในด้านการท่องเที่ยวและการเดินทาง",
    "description-en": "Study vocabulary and language used in travelling and tourism business, such as hotel, restaurant, airport, including a practice of the four skills in contexts as greeting, welcoming, travelling, introducing tourist attraction, planning trips, looking for and inquiring travelling information, dealing with customs and passport control as well as an explanation of general knowledge on tourism and travelling."
  },
  {
    "id": "90644025",
    "name-th": "ภาษาอังกฤษเพื่อการสื่อสารในงานสถาปัตยกรรม",
    "name-en": "ENGLISH FOR ARCHITECTURAL ARTS & DESIGN COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความหมายและโครงสร้างของภาษาอังกฤษเพื่อการสื่อสารเพื่อนำไปใช้ในการนำเสนอผลงานทาง สถาปัตยกรรม",
    "description-en": "Study meanings and structure of English language for communication reading to support on architectural English presentation."
  },
  {
    "id": "90644026",
    "name-th": "ภาษาอังกฤษเพื่อการนำเสนอในงานสถาปัตยกรรม",
    "name-en": "ENGLISH FOR ARCHITECTURAL ARTS & DESIGN PRESENTATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเทคนิคการใช้ภาษาอังกฤษขั้นสูงสำหรับการอ่านและการวิเคราะห์ข้อมูลจากกรณีศึกษาและศึกษา วิธีการนำเสนอรวมทั้งการวิพากษ์งาน การสรุปเนื้องาน ฝึกปฎิบัติในการนำเสนอผลงานโดยการอ่านและสรุปเนื้อหาเพื่อใช้ สำหรับนำเสนอ",
    "description-en": "Study technique of using advance English for reading and analytical data from case studies and presentation method include commenting on works through debate and data conclusion include practice by reading on architectural case studies and summarizing into English."
  },
  {
    "id": "90644027",
    "name-th": "ภาษาอังกฤษสำหรับการเขียนพรรณนา",
    "name-en": "ENGLISH FOR NARRATIVE WRITING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "วิชานี้ส่งเสริมให้มีการพัฒนากลยุทธ์เพื่อการเขียนเนื้อเรื่องที่เขียนขึ้นมีความชัดเจน วิชานี้ยังเปิดโอกาสให้ นักเรียนได้เรียนรู้และทำความเข้าใจองค์ประกอบพื้นฐาน 5 ประการในการเขียนเรื่อง คือ ตัวละคร ฉากหลัง เนื่อหา ความ ขัดแย้ง และการแก้ปัญหา นักเรียนสามารถแลกเปลี่ยนความคิด จินตนาการ และเรียนรู้ที่จะผสมผสานองค์ประกอบ พื้นฐานเหล่านี้เข้าด้วยกัน",
    "description-en": "The course is to encourage the development of the mechanics of writing to ensure clarity of your storytelling. This course also provides students an opportunity to learn and understand basic 5 components in writing a story: characters, setting, plot, conflict, and resolution. Students will share their ideas, imagination and learn to combine these basic elements as a whole."
  },
  {
    "id": "90644028",
    "name-th": "ภาษาอังกฤษเพื่อการออกแบบ",
    "name-en": "ENGLISH FOR DESIGN",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาคำศัพท์ โครงสร้างประโยคและการใช้ภาษาอังกฤษเพื่อการออกแบบ รวมถึงการพัฒนาและเสริมสร้าง ทักษะการสื่อสารเพื่อการศึกษาและการทำงานทางด้านการออกแบบ",
    "description-en": "Study English vocabulary, structures and usage for design including developing skills for communicating for study and work in design."
  },
  {
    "id": "90644029",
    "name-th": "ภาษาอังกฤษสำหรับวิชาชีพสุขภาพ",
    "name-en": "ENGLISH FOR HEALTH PROFESSIONS",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "เรียนรู้และฝึกการใช้ภาษาอังกฤษในบริบทของอาชีพแพทย์ศาสตร์ในการสื่อสารเชิงวิชาการ ที่มาของคำศัพท์ ทางการแพทย์ที่ควรต้องรู้ รากศัพท์ คำอุปสรรค (prefix) และคำปัจจัย (suffix) ที่ใช้กับคำศัพท์ทางการแพทย์ ภาษาอังกฤษ เพื่อการสื่อสาร การโต้ตอบในวงการแพทย์ การเขียนในงานอาชีพแพทย์ประกอบไปด้วย ใบประกอบวิชาชีพ เอกสารทาง การแพทย์ เอกสารงานวิชาการ ฝึกการอ่านงานวิจัย ตำรา และบทความทางการแพทย์โดยใช้ทักษะการประเมินและ ตรวจสอบอย่างเป็นระบบ",
    "description-en": "Learn and practice English for academic communication, essential medical Etymology; root words, suffixes and prefixes of the medical term; English for medical study. Medical correspondence; writing medical certificates, medical documents and academic papers; reading research papers, textbooks, and medical articles with critical appraisal skills."
  },
  {
    "id": "90644030",
    "name-th": "ภาษาอังกฤษเพื่อการประชาสัมพันธ์",
    "name-en": "ENGLISH FOR PUBLIC RELATIONS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และฝึกทักษะการใช้ภาษาอังกฤษทั้ง 4 ทักษะเพื่อการประชาสัมพันธ์ อาทิ การฟังบรีฟงาน การใช้ศัพท์ เฉพาะ สำนวน การเขียนข่าว และการนำเสนอโครงงาน เป็นต้น",
    "description-en": "Learn and practice the 4 skills of English in public relations contexts such as listening to PR brief, specific vocabulary, expressions for press release, and project proposal, etc."
  },
  {
    "id": "90644031",
    "name-th": "ภาษาอังกฤษสำหรับวิทยาศาสตร์และเทคโนโลยี",
    "name-en": "ENGLISH FOR SCIENCE AND TECHNOLOGY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และฝึกทักษะการสื่อสารทางภาษาอังกฤษทั้ง 4 ทักษะ โดยเน้นเนื้อหาเกี่ยวกับวิทยาศาสตร์และ เทคโนโลยี รวมถึงการศึกษาคำศัพท์ โครงสร้างประโยค และลักษณะของภาษาอังกฤษเพื่อวิทยาศาสตร์และเทคโนโลยี ผ่าน สื่อต่างๆ และบทคัดย่อ รายงานการวิจัย บทความวิจัย โปสเตอร์นำเสนองานวิจัย บทความในวารสาร",
    "description-en": "Learn and practice the 4 skills of English in science and technology contexts and study vocabulary, structures, genres of English for science and technology through various types of media including abstracts, research reports, research papers, posters and articles."
  },
  {
    "id": "90644032",
    "name-th": "ภาษาอังกฤษสำหรับการบิน",
    "name-en": "ENGLISH FOR AVIATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การศึกษาและฝึกปฏิบัติในการใช้ภาษาอังกฤษสำหรับอุตสาหกรรมการบิน ประกอบด้วย ศัพท์ทางเทคนิค เฉพาะทางสำหรับนักบิน ลูกเรือที่ให้บริการบนเครื่องบิน ลูกเรือที่ให้บริการภาคพื้น วิศวกรอากาศยาน ผู้ให้บริการเที่ยวบิน ผู้ควบคุมการจราจรทางอากาศ ผู้ให้บริการโลจิสติกส์การบิน",
    "description-en": "A study and practice in the use of English for aviation industry, including technical terms for pilots, cabin crews, ground crews, aeronautical engineers, flight operators, air traffic controllers, airport operators, and aviation logistics operators."
  },
  {
    "id": "90644033",
    "name-th": "การเขียนและการพูดในงานอาชีพ",
    "name-en": "WRITING AND SPEAKING IN THE PROFESSIONS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "พัฒนาทักษะการเขียนและการพูดเกี่ยวกับสาขางานอาชีพ เช่น การเขียนจดหมายธุรกิจ โทรสารบันทึก ข้อความ จดหมายไม่เป็นทางการ จดหมายอิเล็กทรอนิกส์ คู่มือ หรือรายงานประจำวัน การมีส่วนร่วมในการประชุม การ นำเสนอผลงาน และการใช้ภาษาอังกฤษในปริบทของการทำงาน",
    "description-en": "Improve writing and speaking skills related to areas of professional activities such as writing business letters, faxes, memos, informal letters, emails, technical manuals, or routine reports; participating in a meeting; giving a presentation; and using English in professional settings."
  },
  {
    "id": "90644034",
    "name-th": "การเขียนทางเทคนิค",
    "name-en": "TECHNICAL WRITING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การพัฒนาภาษาและทักษะภาษาอังกฤษในการเขียนทางเทคนิค ประกอบด้วย การใช้ภาษาอังกฤษเพื่อเขียน อธิบายถึง ความหมาย เปรียบเทียบ แบ่งประเภท วัตถุประสงค์ หน้าที่ ขั้นตอนกระบวนการ อธิบายเหตุและผล",
    "description-en": "Development of language and study skills in English for technical writings including language use for expressing definition, comparison, classification, purposes, functions, processes, cause and effect."
  },
  {
    "id": "90644035",
    "name-th": "การอ่านและเขียนเชิงวิชาการสำหรับวิทยาศาสตร์สุขภาพ",
    "name-en": "ACADEMIC READING AND WRITING FOR HEALTH SCIENCES",
    "credits": "3 (2-2-5)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการอ่านอย่างมีวิจารณญาณ ทักษะการอ่านเชิงวิชาการ ฝึกพัฒนาอัตราเร็วในการอ่าน การใช้กลวิธี ต่างๆ ในการอ่านเพื่อความเข้าใจ และตีความสำหรับบริบทที่แตกต่างกัน การฝึกการเขียนโดยเน้นการให้เหตุและผล เน้น ฝึกเขียนสื่อความชัดเจนในประเด็นต่างๆ ฝึกการเขียนทั้งส่วนขึ้นต้น เนื้อหา บทสรุป เรียนรู้รูปแบบการเขียนต่างๆ และฝึก กระบวนการกลั่นกรองและปรับปรุงเนื้อหาโดยให้ผู้เรียนสลับกัน (peer review)",
    "description-en": "Study concept of critical reading; skills for academic reading, improving reading speed, using reading strategies to improve text comprehension, organization of different types of texts, academic vocabulary; academic writing skill, writing with logical development and clarity of thought, pre-writing activities and idea generation, writing an effective and focused introduction, detailed body, and conclusion, rhetorical styles; process of peer editing."
  },
  {
    "id": "90644036",
    "name-th": "การพัฒนาทักษะทางภาษาอังกฤษเพื่อการเรียนรู้ตลอดชีวิต",
    "name-en": "ENGLISH SKILL DEVELOPMENT FOR LIFE-LONG LEARNING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และพัฒนาทักษะทางภาษาอังกฤษทั้ง 4 ทักษะโดยเน้นเนื้อหาตามความสนใจของผู้เรียนแต่ละคนผ่าน กิจกรรมการเรียนรู้ทางภาษาแบบอิสระ ทั้งในและนอกชั้นเรียนเพื่อส่งเสริมทักษะการเรียนรู้ภาษาอังกฤษตลอดชีวิตด้วย ตนเอง",
    "description-en": "Learn and develop English language skills based on topics of individual learners’ interest through active language learning activities customized for each learner to promote self-directed, life-long language learning skills."
  },
  {
    "id": "90644037",
    "name-th": "การสื่อสารข้ามวัฒนธรรม",
    "name-en": "CROSS CULTURAL COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความแตกต่างและความเหมือนในการสื่อสารข้ามวัฒนธรรมด้วยวิธีการเปรียบเทียบมิติของวัฒนธรรม เชื้อชาติ และศาสนา เพื่อเข้าใจในความแตกต่างทางวัฒนธรรมในด้านพฤติกรรมการสื่อสารและแรงจูงใจและฝึกฝนการ สื่อสารกับผู้ที่มาจากวัฒนธรรมที่แตกต่าง เพื่อให้เข้าใจถึงพฤติกรรมการสื่อสารแรงจูงใจ วัฒนธรรมสัมพัทธ์ วัจนภาษา และอวัจนภาษาที่เกิดขึ้นจากความหลากหลายของวัฒนธรรม รวมถึง ฝึกการสื่อสารกับผู้ที่มาจากต่างวัฒนธรรม",
    "description-en": "Study the differences and similarities in cross-cultural communication by comparing different cultures, races, and regions to understand cultural variations in communication behaviors and motivations, cultural relativism, verbal, and nonverbal communication across a variety of cultural contexts, and practice communicating with people from different cultures."
  },
  {
    "id": "90644039",
    "name-th": "ทักษะการสื่อสารผ่านการอภิปราย",
    "name-en": "COMMUNICATION SKILLS THROUGH DEBATE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้พื้นฐานของการอภิปราย และทักษะการโต้แย้ง ที่จะมีประโยชน์ต่อการศึกษา การประกอบอาชีพ และ อื่น ๆ ซึ่งนักศึกษาจะได้พัฒนาการนำเสนอ การโต้แย้ง การคิดเชิงวิพากษ์ การทำงานร่วมกัน และทักษะด้านข้อมูล ที่จะทำ ให้นักศึกษามีความรู้รอบตัว และพัฒนาความมั่นใจในตนเอง ผ่านกิจกรรมการอภิปรายกลุ่ม",
    "description-en": "Learn the basics of debate and the valuable skills of argumentation to enhance their presentation, argumentation, critical thinking, collaboration, and information skills and increase their world knowledge and develop self-confidence through engaging in a broad range of debating activities."
  },
  {
    "id": "90644040",
    "name-th": "ทักษะการสื่อสารผ่านละคร",
    "name-en": "COMMUNICATION SKILLS THROUGH DRAMA",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกทักษะการสื่อสารผ่านละคร ศึกษาการพัฒนาคำศัพท์พื้นฐานในการแสดงด้วยเทคนิคต่างๆ การเปล่งเสียง ของนักแสดง จินตนาการ การจัดระเบียบร่างกาย การทำงานร่วมกับผู้อื่นในการสร้างตัวละคร บทบาท และสถานกา รณ์ สมมติ ละคร สามารถนำมาใช้เพื่อส่งเสริมกระบวนการจัดการเรียนรู้ที่ผู้เรียนได้ลงมือกระทำ (active learning) ผ่าน การฝึกปฏิบัติ และพัฒนาการของตัวละคร ซึ่งจะทำให้นักศึกษามีทักษะการพูด และการสื่อสารที่ดี",
    "description-en": "Practice communication skills through drama by developing a basic acting vocabulary by exploring techniques in enhancing your actor’s voice, imagination and physicality, working with others in the creation of character, situation an role."
  },
  {
    "id": "90644041",
    "name-th": "ภาษาอังกฤษจากสื่อบันเทิง",
    "name-en": "ENGLISH FROM ENTERTAINMENT MEDIA",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การศึกษาเชิงวิเคราะห์ภาษาอังกฤษและวัฒนธรรมตะวันตก ผ่านสื่อบันเทิง ได้แก่ เพลง ภาพยนตร์ นิตยสาร และโฆษณาทางโทรทัศน์ โดยเน้นที่รูปแบบของภาษา คำศัพท์ สำนวนและแสลงที่ใช้ในการสื่อสารภาษาอังกฤษใน ชีวิตประจำวัน",
    "description-en": "An analytical study of English and Western cultures through entertainment media, such as songs, movies, magazines, and TV commercials, focusing on language styles, vocabulary, expressions, and slangs used in everyday English communication."
  },
  {
    "id": "90644042",
    "name-th": "การสื่อสารและการนำเสนออย่างมืออาชีพ",
    "name-en": "PROFESSIONAL COMMUNICATION AND PRESENTATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ทักษะการวิเคราะห์ข้อมูลและประเมินสถานการณ์เพื่อกลั่นกรอง ให้ได้ประเด็นที่ต้องการนำเสนอ การเลือกใช้ สื่อ วิธี และเทคนิคในการนำเสนอ การเลือกใช้ภาษา ถ้อยคำ และบุคลิกภาพที่เหมาะสมกับบริบทต่างๆ",
    "description-en": "Develop media literacy skills. Learn to analyze and evaluate situations, and screen contents to get key points for presentation. Learn to select proper media for presentation. Learn proper verbal language and body language for each different context."
  },
  {
    "id": "90644043",
    "name-th": "การพูดในที่สาธารณะ",
    "name-en": "PUBLIC SPEAKING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้ และฝึกทักษะการพูดในที่ สาธารณะ โดยศึกษาเทคนิคการลดความวิตกกังวล และการใช้สื่อ โสตทัศนูปกรณ์เพื่อส่งเสริมการนำเสนอ โดยนักศึกษาจะได้รับการพัฒนาและเสริมสร้างทักษะในการนำเสนอในที่สาธารณะ ได้อย่างหลากหลายสถานการณ์",
    "description-en": "Study the introduction to practice public speaking, including techniques to lessen speaker anxiety, and the use of visual aids to enhance speaker presentations to develop and strengthen skills in preparing and presenting public oral presentations in a variety of situations."
  },
  {
    "id": "90644044",
    "name-th": "พูดได้พูดดี พูดเป็น",
    "name-en": "BEST SPEECH",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษากระบวนการการสื่อสารของมนุษย์ ฝึกการใช้วัจนภาษาและอวัจนภาษาในการสื่อสาร หลักการ เตรียมการพูดในสถานการณ์ต่าง ๆ การแก้ไขความวิตกกังวลในการพูด รวมทั้งเรียนรู้เทคนิคการใช้เสียง ท่าทางและ บุคลิกภาพที่เหมาะสม เพื่อการพูดที่มีประสิทธิภาพ",
    "description-en": "Study Human communication processes. Practice of verbal and non-verbal communication, how to structure and organize information to present in various situations, physical and vocal skills includes techniques in controlling speech anxiety."
  },
  {
    "id": "90644045",
    "name-th": "การค้นคว้าและการเขียนรายงาน",
    "name-en": "RESEARCH PAPER WRITING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "เรียนรู้และฝึกการค้นคว้าข้อมูล การทำวิจัยเบื้องต้น การเขียนรายงานและบทความวิชาการโดยเน้นการใช้ ภาษาวิชาการ และวิธีการเผยแพร่ผลงานวิชาการผ่านทางวารสารและการประชุมวิชาการ",
    "description-en": "Learn and practice the process of data searching, basic research, report and paper writing with academic language, and the process of academic publishing and conferencing."
  },
  {
    "id": "90644046",
    "name-th": "การฟังและการอ่านเพื่อพัฒนาคุณภาพชีวิต",
    "name-en": "LISTENING AND READING FOR IMPROVING LIFE QUALITY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการรับสารอย่างมีวิจารณญาณ รู้เท่าทันสื่อและการสื่อสาร ฝึกทักษะการฟังและการอ่านเพื่อพัฒนา คุณภาพชีวิต ให้เกิดความรอบรู้ มีประสบการณ์และสร้างจินตนาการ การพัฒนาความสามารถในการจับใจความสำคัญ การ สรุปประเด็น การวิเคราะห์และประเมินค่าสารทั้งสาระความรู้และบันเทิงคดี",
    "description-en": "Study and practice principle and perception skills, Media literacy skills. Listening and Reading for improving Life quality to understand, experience enhancement, and imagination. Development in ability of finding main ideas, analyzing and evaluating messages for both academic and non-academic purposes."
  },
  {
    "id": "90644047",
    "name-th": "การพัฒนาทักษะการเขียนภาษาไทยเชิงสร้างสรรค์",
    "name-en": "DEVELOPMENT OF THAI CREATIVE WRITING SKILLS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกฝนและพัฒนาความสามารถทางการเขียนเชิงสร้างสรรค์ การถ่ายทอดความรู้ ความคิดและจินตนาการ ออกมาเป็นลายลักษณ์อักษร การเลือกสรรถ้อยคำได้อย่างสละสลวย ถูกต้อง และเหมาะสมกับ รูปแบบงานเขียน รวมทั้งสามารถแก้ไขข้อบกพร่องทางการเขียนได้ด้วยตนเอง",
    "description-en": "Practice and develop the creative writing skills. The expression of knowledge Ideas and imagination into writing. The chosen words are euphemisms correct and appropriate writing style including can review and edit writings manually."
  },
  {
    "id": "90644048",
    "name-th": "ภาษาในสังคมไทย",
    "name-en": "LANGUAGE IN THAI SOCIETY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาโครงสร้างของภาษาที่ใช้ในสังคมไทย โครงสร้างของสังคมไทยความสัมพันธ์ของภาษากับสังคม การ เปลี่ยนแปลงของภาษาอันเนื่องมาจากสภาพของสังคมและภูมิศาสตร์ การพัฒนาภาษากับการพัฒนาประเทศ ได้แก่ บ้านพักอาศัย วัด และวัง การเกิดการพัฒนาของชุมชนและเมืองโบราณ",
    "description-en": "Study structure of language used in Thai society, structure of Thai society, relationship between language and society; language change caused by social and geographical factors; language development and the development of the nation."
  },
  {
    "id": "90644049",
    "name-th": "ภาษาไทยเพื่อการสร้างสรรค์",
    "name-en": "THAI LANGUAGE FOR CREATIVITY",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักการใช้ภาษาไทยเพื่อการสื่อสารอย่างมีประสิทธิภาพ ฝึกทักษะที่ใช้การสื่อสาร ได้แก่ ทักษะการ ฟัง การพูด การอ่าน การเขียนและการคิดเชิงสร้างสรรค์",
    "description-en": "Study Thai language in order to communicate effectively. Practice good communication skills including listening, speaking, reading, writing, and creative thinking."
  },
  {
    "id": "90644050",
    "name-th": "การเขียนภาษาไทยในที่ทำงาน",
    "name-en": "THAI WRITING IN WORKPLACE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาหลักเกณฑ์ รูปแบบและวิธีการเขียนงานเอกสารภาษาไทยประเภทต่างๆ ที่ใช้ทั่วไปในที่ทำงาน การใช้ ภาษาที่ถูกต้องและเหมาะสมกับประเภทของเอกสาร ฝึกการเขียนเอกสารในระบบการทำงานสำนักงาน",
    "description-en": "Study Principles, formats and methods of writing Thai document types; correct use of the Thai language appropriate for each type of documents. Practice in document writing in accordance with working system in the workplace."
  },
  {
    "id": "90644051",
    "name-th": "ภาษาไทยสำหรับทันตแพทย์",
    "name-en": "THAI FOR DENTAL PROFESSIONS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ภาษาไทยเพื่อการสื่อสารทางวิชาการ เช่น การซักประวัติ การนำเสนอแผนการรักษา การสอนสุขอนามัยช่อง ปาก คำแนะนำหลังการผ่าตัด",
    "description-en": "Thai for academic communication, for example history taking, treatment plan presentation, oral hygiene instruction, post- operative instruction"
  },
  {
    "id": "90644052",
    "name-th": "ศิลปะการสื่อสารสำหรับมืออาชีพด้านอาหาร",
    "name-en": "COMMUNICATION IN THAI FOR CULINARY PROFESSIONALS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกการใช้ภาษาไทยในบริบทของธุรกิจอุตสาหกรรมอาหาร โดยเรียนรู้หลักการสื่อสารทั้งวัจนภาษาและอวัจน ภาษา ความสำคัญของการสื่อสารในธุรกิจอุตสาหกรรมอาหาร ฝึกทักษะการฟังและการแสดงความคิดเห็นเชิงรุก การ สื่อสารในโซเชียลเนตเวิร์คและการสร้างประสบการณ์การใช้ภาษาแบบสร้างสรรค์ในสถานการณ์เผชิญหน้าระหว่างผู้ สนทนา (constructive confrontation) รวมทั้งการสื่อสารกับสื่อต่างๆ Thai language; principle of communication (verbal and non-verbal), importance of",
    "description-en": "communication in food catering and services; essential skills in active listening and discussion; communication in social network and constructive confrontation; practice in communication with patients, relatives and colleagues; dealing with the media."
  },
  {
    "id": "90644053",
    "name-th": "การฟังและการพูดภาษาจีนพื้นฐาน",
    "name-en": "FUNDAMENTAL CHINESE FOR LISTENING AND SPEAKING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเกี่ยวกับคำศัพท์และสำนวน รวมทั้งการใช้ภาษาจีนเพื่อใช้ในชีวิตประจำวัน โดยมุ่งเน้นทักษะการฟัง และการพูด",
    "description-en": "A study of Chinese vocabulary and expressions, including language use for daily life, with an emphasis on listening and speaking."
  },
  {
    "id": "90644054",
    "name-th": "การอ่านและเขียนภาษาจีนพื้นฐาน",
    "name-en": "FUNDAMENTAL CHINESE READING AND WRITING",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาเกี่ยวกับคำศัพท์และสำนวน รวมทั้งการใช้ภาษาจีนเพื่อใช้ในชีวิตประจำวัน โดยมุ่งเน้นทักษะการอ่าน และการเขียน",
    "description-en": "A study of Chinese vocabulary and expressions, including language use for daily life, with an emphasis on reading and speaking."
  },
  {
    "id": "90644055",
    "name-th": "ไวยากรณ์ภาษาจีนพื้นฐานและสำนวนและสุภาษิตภาษาจีน",
    "name-en": "BASIC CHINESE GRAMMAR AND CHINESE IDIOMS AND PROVERBS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาไวยากรณ์ภาษาจีนตั้งแต่ระดับหน่วยคำ วลี และประโยค รวมถึงโครงสร้างประโยค สำนวนและสุภาษิต ภาษาจีน",
    "description-en": "A study of Chinese basic grammar: words, phrases, and sentences, including sentence structures, idioms, and proverbs."
  },
  {
    "id": "90644056",
    "name-th": "วัฒนธรรมสำนวนและสุภาษิตจีน",
    "name-en": "CHINESE CULTURE IDIOMS AND PROVERBS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาความรู้เบื้องต้นเกี่ยวกับวัฒนธรรม ประเพณีและมารยาทจีน ความแตกต่างระหว่างวัฒนธรรมไทยจีน และพื้นฐานที่มา ความหมาย คติ แนวคิดและการใช้สำนวนและสุภาษิตจีนในชีวิตประจำวัน",
    "description-en": "Study the introduction to Chinese cultures, traditions and manners; differences between Thai and Chinese cultures and background, meanings, principles, concepts and use of Chinese idioms and proverbs in everyday life."
  },
  {
    "id": "90644057",
    "name-th": "ภาษาจีนเพื่อการสื่อสาร",
    "name-en": "CHINESE FOR COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกทักษะการใช้ภาษาจีน โดยเน้นทักษะการฟังและการพูดเพื่อการสื่อสารในชีวิตประจำวัน และเสริมสร้าง ความเข้าใจด้านสังคมและวัฒนธรรมระหว่างไทยและจีน ผลลัพธ์การเรียนรู้ของรายวิชานี้คือสามารถพูดภาษาจีนได้",
    "description-en": "Study and practice skills in Chinese, focusing on listening and speaking for daily communication and promoting the understanding of Thai and Chinese cultures. the course learning outcome is being able to speak Chinese."
  },
  {
    "id": "90644058",
    "name-th": "ภาษาจีนฉบับแฟนด้อม",
    "name-en": "CHINESE FANDOM",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาวัฒนธรรมแฟนคลับชาวจีน และโครงสร้าง และหลักไวยากรณ์ภาษาจีนเบื้องต้นจากสื่อต่างๆ ภาพยนตร์ และโทรศัพท์ คำศัพท์ และสำนวนในภาพยนตร์ที่สามารถนำมาประยุกต์ใช้ในชีวิตประจำวันได้",
    "description-en": "Study the Chinese fan cultures and fundamental elements of Chinese grammar, vocabulary and idiomatic expressions from different sources of media (e.g. film and television) which are applied to everyday life."
  },
  {
    "id": "90644059",
    "name-th": "ภาษาจีนเพื่อการท่องเที่ยว",
    "name-en": "CHINESE FOR TRAVEL",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกการใช้คำศัพท์ สำนวน การใช้ภาษาจีนเชิงท่องเที่ยว การสนทนาในสถานการณ์ต่างๆ ระหว่างการเดินทาง รวมทั้ง การสื่อสารข้ามวัฒนธรรม",
    "description-en": "A practice of Chinese vocabulary as well as expressions, language use of Chinese for travel, conversations in various situations during trips, and intercultural communication."
  },
  {
    "id": "90644060",
    "name-th": "ภาษาเยอรมันเพื่อการสื่อสาร",
    "name-en": "GERMAN FOR COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การพัฒนาทักษะภาษาเยอรมันที่จำเป็นสำหรับการสื่อสารขั้นพื้นฐาน นักเรียนจะได้รับการแนะนำให้รู้จักกับ ตัวอักษรและตัวเลขภาษาเยอรมันในช่วงเริ่มต้นของหลักสูตร จากนั้นจึงเปลี่ยนไปใช้การคำแนะนำตนเองและภูมิหลัง ส่วนตัว ส่วนที่เหลือของหลักสูตรจะเป็นส่วนของคำศัพท์ในชีวิตประจำวันของนักเรียนด้วยรูปศัพท์ปัจจุบันและอดีต การ แสดงบทบาทสมมติและรูปแบบบทสนทนาในชีวิตประจำวันของกิจกรรมในชั้นเรียนเพื่อสร้างความมั่นใจของนักเรียนในการ ใช้ภาษาเยอรมัน",
    "description-en": "Development of German language skills necessary for basic communication. Students are introduced to the German alphabet and numbers at the start of the course and then move to basic introductions of themselves and their personal background. The remainder of the course builds students’ daily life vocabulary with the present and past tenses. Role plays and dialogues form in daily life of classroom activities to build students’ confidence in using German language."
  },
  {
    "id": "90644061",
    "name-th": "ภาษาเยอรมันเพื่อการทำงานและธุรกิจ",
    "name-en": "GERMAN FOR WORK AND BUSINESS",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "สร้างทักษะด้านคำศัพท์และไวยากรณ์ในภาษาเยอรมันที่ใช้ในตำแหน่งงานและธุรกิจที่แตกต่างกันให้ความ สนใจเป็นพิเศษกับคำศัพท์เกี่ยวกับสถานการณ์การทำงานเพื่อสร้างความมั่นใจของนักเรียนในการใช้ภาษาเยอรมัน มีการ แนะนำอดีตกาลร่วมกับกริยาช่วยเพิ่มเติม ทักษะการสนทนาได้รับการพัฒนาโดยการสำรวจคำคุณศัพท์และสร้างคำอธิบาย อย่างง่ายเกี่ยวกับตำแหน่งงานในธุรกิจที่แตกต่างกัน",
    "description-en": "Builds on vocabulary and grammar skills in the German language used in different work positions and businesses. Particular attention is paid to the vocabulary of working situations to build students’ confidence in their use of the German language. The past tense is introduced together with additional modal verbs. Dialogue skills are developed through exploring adjectives and creating simple descriptions of different position of business works."
  },
  {
    "id": "90644062",
    "name-th": "ภาษาญี่ปุ่นเพื่อการสื่อสาร",
    "name-en": "JAPANESE FOR COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกทักษะการใช้ภาษาญี่ปุ่น โดยเน้นทักษะการฟังและการพูดเพื่อการสื่อสารในชีวิตประจำวัน และ เสริมสร้างความเข้าใจด้านสังคมและวัฒนธรรมระหว่างไทยและญี่ปุ่น ผลลัพธ์การเรียนรู้ของรายวิชานี้คือสามารถพูดภาษาญี่ปุ่นได้",
    "description-en": "Study and practice skills in Japanese, focusing on listening and speaking for daily communication and promoting the understanding of Thai and Japanese cultures, the course learning outcome is being able to speak Japanese."
  },
  {
    "id": "90644063",
    "name-th": "ภาษาญี่ปุ่นเพื่อการท่องเที่ยว",
    "name-en": "JAPANESE FOR TRAVEL",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกการใช้คำศัพท์ สำนวน การใช้ภาษาญี่ปุ่นเชิงท่องเที่ยว การสนทนาในสถานการณ์ต่างๆ ระหว่างการ เดินทาง รวมทั้ง การสื่อสารข้ามวัฒนธรรม",
    "description-en": "A practice of Japanese vocabulary as well as expressions, language use of Japanese for travel, conversations in various situations during trips, and intercultural communication."
  },
  {
    "id": "90644064",
    "name-th": "ภาษาเกาหลีเพื่อการท่องเที่ยว",
    "name-en": "KOREAN FOR TRAVEL",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกการใช้คำศัพท์ สำนวน การใช้ภาษาเกาหลีเชิงท่องเที่ยว การสนทนาในสถานการณ์ต่างๆ ระหว่างการ เดินทาง รวมทั้ง การสื่อสารข้ามวัฒนธรรม",
    "description-en": "A practice of Korean vocabulary as well as expressions, language use of Korean for travel, conversations in various situations during trips, and intercultural communication."
  },
  {
    "id": "90644065",
    "name-th": "ภาษาเวียดนามเพื่อการท่องเที่ยว",
    "name-en": "VIETNAMESE FOR TRAVEL",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกการใช้คำศัพท์ สำนวน การใช้ภาษาเวียดนามเชิงท่องเที่ยว การสนทนาในสถานการณ์ต่างๆ ระหว่างการ เดินทาง รวมทั้ง การสื่อสารข้ามวัฒนธรรม",
    "description-en": "A practice of Vietnamese vocabulary as well as expressions, language use of Vietnamese for travel, conversations in various situations during trips, and intercultural communication."
  },
  {
    "id": "90644066",
    "name-th": "ภาษามาเลย์เพื่อการท่องเที่ยว",
    "name-en": "MALAY FOR TRAVEL",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ฝึกการใช้คำศัพท์ สำนวน การใช้ภาษามาเลย์เชิงท่องเที่ยว การสนทนาในสถานการณ์ต่างๆ ระหว่างการ เดินทาง รวมทั้ง การสื่อสารข้ามวัฒนธรรม",
    "description-en": "A practice of Malay vocabulary as well as expressions, language use of Malay for travel, conversations in various situations during trips, and intercultural communication."
  },
  {
    "id": "90644067",
    "name-th": "สนทนาภาษาจีนเพื่อไอที",
    "name-en": "CHINESE CONVERSATION FOR IT",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "การเรียนรู้และฝึกฝนบทสนทนาภาษาจีนในการทำงานที่เกี่ยงข้อง IT ผ่านสถานการณ์จำลอง ผู้เรียนได้สัมผัส คำศัพท์ วลี รวมถึงประโยคต่าง ๆ ของภาษาจีน ที่เกี่ยวข้องกับ IT ได้แก่ การใช้คอมพิวเตอร์ด้วยภาษาจีน การ Install และ Uninstall ซอฟต์แวร์ การเข้าถึงแพลตฟอร์มจีน การใช้ Search Engine การซื้อสินค้าทางอินเตอร์เน็ต การเปิดร้านค้าออนไลน์ ซึ่งผู้เรียนจะได้ฝึกฝนทักษะในการฟัง การพูดภาษาจีน และเกิดความเข้าใจในเนื้อหาสำหรับการสนทนาภาษาจีนเพื่อ IT",
    "description-en": "Learning and practicing Chinese conversation in IT-related work through simulations. Students are exposed to Chinese vocabulary, phrases and sentences related to IT, including using computers in Chinese, Installation and Uninstalling of software, Accessing Chinese platforms, Using search engines, Shopping on the Interne, Opening an online store in which students will practice listening skills speaking Chinese and gain an understanding of the content for Chinese conversation for IT."
  },
  {
    "id": "90644068",
    "name-th": "รู้จีนให้ได้เงิน",
    "name-en": "HOW TO MAKE MONEY WITH CHINESE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ภาษาจีนพื้นฐานสำหรับการประกอบธุรกิจ กระบวนการคิดทางธุรกิจและการสื่อสาร การสร้างธุรกิจผ่าน เว็บไซต์อีคอมเมิร์ชเพื่อการประกอบการ กระแสและทิศทางของธุรกิจออนไลน์ ข้อควรรู้ในการประกอบธุรกิจของประเทศที่ ใช้ภาษาจีน",
    "description-en": "Essential Chinese for business; business thinking and communication; entrepreneurship via e- commerce websites; online business trends and directions; necessity insight for enterprising in Chinese- speaking countries."
  },
  {
    "id": "90644069",
    "name-th": "ภาษาญี่ปุ่นพื้นฐาน",
    "name-en": "FOUNDATION JAPANESE",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "พัฒนาโครงสร้างทางไวยากรณ์และคำศัพท์ภาษาญี่ปุ่นระดับพื้นฐาน ทักษะการฟัง พูด และอ่าน ระดับพื้นฐานที่ พอเพียงแก่การเรียนรู้วิชาภาษาญี่ปุ่นพื้นฐาน ทักษะการฟังและพูดในหัวข้อที่ใช้ในชีวิตประจำวัน การฟังเพื่อจับใจความ สำคัญและรายละเอียด ไวยากรณ์และสำนวนภาษาที่จำเป็นสำหรับการสื่อสาร",
    "description-en": "Develop the basic Japanese grammatical structures and vocabulary; basic listening, speaking and reading skills for learning compulsory Japanese courses for the skills in listening and speaking on everyday life topics; listening for gist and details; grammar and language functions necessary for communicative purposes"
  },
  {
    "id": "90644070",
    "name-th": "การสื่อสารนวัตกรรม",
    "name-en": "INNOVATIVE COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ศึกษาและฝึกทักษะการสื่อสารที่หลากหลายรวมทั้งการเขียนทางเทคนิค และการเขียนเชิงสร้างสรรค์ การ ออกแบบอินโฟกราฟฟิค และการนำเสนอ ฝึกใช้เทคนิคการสื่อสารต่างๆ เพื่อการนำเสนองานเฉพาะด้าน รวมทั้งเรียนรู้และ ฝึกการสื่อสารเพื่อสื่อถึงความเป็นเอกลักษณ์และความน่าเชื่อถือของแนวคิดเชิงนวัตกรรมต่อกลุ่มเป้าหมาย",
    "description-en": "This course provides the study and practice of different communication skills including technical, professional and creative writing; infographics design; and delivering presentation. The students will study relevant techniques and learn to combine a range of skills in order to effectively communicating technical or specialized concepts. They will be able to explore and translate the benefit, the uniqueness, and the credibility of innovative ideas to a target audience."
  },
  {
    "id": "90644071",
    "name-th": "ภาษามือเบื้องต้นเพื่อการสื่อสาร",
    "name-en": "INTRODUCTION TO SIGN LANGUAGE FOR COMMUNICATION",
    "credits": "3 (3-0-6)",
    "prerequisite": null,
    "description-th": "ความหมาย ความเป็นมา ประเภท และลักษณะที่แตกต่างของภาษามือ โครงสร้างพื้นฐานของภาษามือ และวัฒนธรรมของผู้ที่มีความบกพร่องทางการได้ยิน ตลอดจนฝึกปฏิบัติการใช้ภาษามือภาษาในการสื่อสารเพื่อประโยชน์ใน ชีวิตประจำวัน",
    "description-en": "Meaning, history, types and different characteristic, standard structure of sign language, and hearing-impaired person’s culture as well as to practice using sign Language for everyday use"
  }
]
